import 'package:flutter/material.dart';
import 'package:chatapp_firebase/farming/post_data/view/widgets/post_card.dart';
import 'package:chatapp_firebase/farming/post_data/model/comment_model.dart';
import 'package:chatapp_firebase/farming/post_data/model/post_model.dart';
import 'package:chatapp_firebase/farming/post_data/model/user_model.dart';
import 'package:url_launcher/url_launcher.dart';

import '../../../views/millet.dart';

const String _url = 'http://103.47.184.69:81/post-categories/28';

void _launchURL() async {
  if (!await launch(_url)) throw 'Could not launch $_url';
}

class PostHomePage1 extends StatelessWidget {
  const PostHomePage1({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        leading: IconButton(

          onPressed: () {
            Navigator.push(context, MaterialPageRoute(builder: (context) {
              return  HomePage();
            }));


          },
          icon: Icon(Icons.arrow_back_ios_new),
        ),
        title: Text("စပါးဖျက်ပိုးအမျိုးအစားများ"),

      ),
      body: ListView.builder(
        itemCount: DemoValues.posts.length,
        itemBuilder: (BuildContext context, int index) {
          return PostCard(postData: DemoValues.posts[index]);
        },
      ),
      floatingActionButton: const FloatingActionButton.extended(
        backgroundColor: Colors.blue,
        foregroundColor: Colors.white,
        onPressed: _launchURL,
        label: Text('See More'),
      ),
      floatingActionButtonLocation: FloatingActionButtonLocation.centerFloat,
    );
  }
}

class DemoValues {
  static final List<UserModel> users = [
    UserModel(
      id: "1",
      name: "ထွက်တိုး",
      //email: "ishfar@gmail.com",
      email: "မြန်မာ",
      image: "assets/images/p9.jpg",
      followers: 123,
      joined: DateTime(2022, 11, 25),
      posts: 12,
    ),
    UserModel(
      id: "2",
      name: "သုတကျော်",
      //email: "ishrak@gmail.com",
      email: "တောင်သူဦးကြီးများ",
      image: "assets/images/p7.jpg",
      followers: 456,
      joined: DateTime(2022, 11, 25),
      posts: 13,
    ),
    UserModel(
      id: "3",
      name: "ဆန်း",
      //email: "shakleen@gmail.com",
      email: "စိုက်ပျိုးရေးသမားလေး",
      image: "assets/images/p10.jpg",
      followers: 789,
      joined: DateTime(2022, 11, 24),
      posts: 14,
    ),
  ];

  static final String _body =
  """ စပါးဖျက်ပိုး အမျိုးအစားများ
  
  - စပါးဆစ်ပိုး
  - စပါးကြက်သွန်မြိတ်ပိုး
  - ငမြှောင်တောင်ပိုး
  - စပါးရွက်လိပ်အိမ်ပိုး
  - စပါးပိုးလောင်မီး
  - စပါးဖြုတ်ပိုး
  - စပါးနှံစုပ်ပိုး
 
စပါးဆစ်ပိုး

စပါးရွက်အောက်မျက်နှာပြင် ရွက်ဖုံးပေါ်နှင့် ရွက်ဖုံးကြားအစုလိုက် ဥဥလေ့ရှိသည်။

ပိုးလောက်ကောင်ဘဝ ပင်စည်အတွင်း ဝင်ရောက်ဖျက်ဆီးသည်။ 

အပင်ငယ်စဉ် ကျပါက ပင်စည်အူပုပ်ခြင်းနှင့် ခေါင်ညွန့်သေ လက္ခဏာများကို တွေ့ရမည်။

စပါးနှံထွက်ချိန် ကျပါက ထောင်မတ်နေသော အဖြူရောင်စပါးနှံများ ခွေကျသွားသည်ကို တွေ့ရမည်။


စပါးကြက်သွန်မြိတ်ပိုး 

စပါးရွက်အောက်မျက်နှာပြင်၊ ရွက်ဖုံးပေါ်နှင့် ရွက်ဖုံးကြားအစုလိုက် ဥဥလေ့ရှိသည်။

ပိုးလောက်ကောင်ဘဝ ပင်စည်အတွင်း ဝင်ရောက်ဖျက်ဆီးသည်။

အပင်ငယ်စဉ်ကျပါက ပင်စည်အူပုပ်ခြင်းနှင့် ခေါင်ညွန့်သေ လက္ခဏာများကို တွေ့ရမည်။

စပါးနှံထွက်ချိန်ကျပါက ထောင်မတ်နေသော အဖြူရောင်စပါးနှံခြောက်များကို တွေ့ရမည်။


ငမြှောင်တောင်ပိုး

အကောင်ငယ်စဉ် အရွက်၏ အစိမ်းရောင်အသားကိုခြစ်စားသဖြင့် အဖြူရောင်ကွက်များ တွေ့ ရမည်။

အကောင်ကြီးဘဝ-ညနေပိုင်းနှင့် မနက်အစောပိုင်းတွင် အရွက်များ၊ အနှံများကို ကိုက်ဖြတ်စားသည်။

အစုလိုက် အပြုံလိုက် ဆိုးရွားစွာ ကျရောက်လေ့ရှိသည်။


စပါးရွက်လိပ်အိမ်ပိုး

စပါးပင်ငယ်စဉ် ပိုမိုကျရောက်သည်။

မိုးစပါးနှင့် ရေကြီးနစ်မြှုပ်သောနေရာများတွင်ကျရောက်လေ့ရှိသည်။

စပါးရွက်များကို အလျားလိုက်အလိပ်ပြုလုပ်ပြီး အတွင်းမှ နေ၍ အရွက်အောက်မျက်နှာပြင်ကို ခြစ်စားသည်။

စိုက်ခင်းအတွင်း ရွက်လိပ်ရွက်ပြတ်များကို တွေ့ နိုင်သည်။


စပါးပိုးလောင်မီး

အကောင်ငယ်ဘဝ အရွက်ကို ထွင်း၍ဖျက်ဆီးခြင်းကြောင့် အရွက်များမီးလောင်ထားသကဲ့သို့ ခြောက်နေတတ်သည်။

အကောင်ကြီးဘဝ အပင်အစိတ်အပိုင်းအားလုံးကို ဖျက်ဆီးသည်။

ပိုးကျရောက်မှုများပါက အပင်ခြောက်၍သေနိုင်သည်။


စပါးဖြုတ်ပိုး

အပင်ရည်ကို စုပ်စားသဖြင့် အရွက်များညိုပြီး ခြောက်သွားသည်။

အပင်ကြီးထွားမှုအားနည်းကာ ဗိုင်းရပ်ရောဂါများကို ကူးစက်စေသည်။

အပင်ငယ်စဉ် ဖြုတ်စိမ်း ကျတတ်ပြီး ဖြုတ်ညိုသည် အပင်သက်တမ်းရင့်မှ ကျသည်။


စပါးနှံစုပ်ပိုး

စပါးနှံမပေါ်ခင် အရွက်နုများကို စုပ်စားဖျက်ဆီးသည်။

စပါးနှံစေ့ပေါ်တွင် ညိုနက်ရောင် အစက်များတွေ့ ရမည်။

  """;

  static final List<CommentModel> _comments = <CommentModel>[
    CommentModel(
      comment:
      "Thank you",
      user: users[0],
      time: DateTime(2022, 11, 28),
    ),
    CommentModel(
      comment: "ကျေးဇူးပါ။ ",
      user: users[1],
      time: DateTime(2022, 11, 28),
    ),
    CommentModel(
      comment: "ကျေးဇူးတင်ပါတယ်။ ",
      user: users[0],
      time: DateTime(2022, 11, 28),
    ),

    CommentModel(
      comment: "ကျေးဇူးပါခင်ဗျာ။ ",
      user: users[1],
      time: DateTime(2022, 11, 29),
    ),
    CommentModel(
      comment: "ကျေးဇူးပါ။ ",
      user: users[2],
      time: DateTime(2022, 11, 29),
    ),
    CommentModel(
      comment: "ကျေးဇူးတင်ပါတယ်။ ",
      user: users[1],
      time: DateTime(2022, 11, 29),
    ),

  ];

  static final List<PostModel> posts = [
    PostModel(
      id: "1",
      author: users[0],
      title: "Diseases",
      summary: """စပါးပင်ပေါ်က အညိုရောင်အစက်... """,
      body: """
      ရောဂါလက္ခဏာများ
• ပင်ပွားထွက်ချိန်မှ စ၍ စပါးရွက်များပေါ်တွင် ရေစိုနာကွက်များကို တွေ့ရတတ်ပါသည်။
• အစပိုင်းတွင် သေးငယ်သော အညိုရောင် အပြောက် အပြောက်များကို တွေ့ရတတ်ပြီး မှိုမှ ထွက်သော အဆိပ်ကြောင့် ထိုအပြောက်လေးများသည် တစ တစ ကြီးမားလာတတ်ပါသည်။
• ခံနိုင်ရည်မဲ့သော မျိုးများတွင် အစက်အပြောက်များသည် ၅-၁၄ မီလီမီတာထိ ရှိတတ်ပြီး တဖြေးဖြေး ခြောက်သွေ့သွားတတ်ပါသည်။
• ခံနိုင်ရည်ရှိသော မျိုးများတွင်မူ အညိုရောင် အစက်အပြောက်လေးများကို အပ်ပေါက်ရာ ပမာဏခန့်သာ တွေ့ရတတ်ပါသည်။

စပါးရွက်ညိုပြောက် ရောဂါကို ဘယ်လို ကာကွယ်နှိမ်နှင်းမလဲ?

ရွက်ညိုပြောက်ရောဂါ ကာကွယ်နှိမ်နှင်းခြင်း နည်းလမ်းများရွက်ညိုပြောက် ရောဂါမှ ကာကွယ်ရန် ဖော်ပြပါ နည်းလမ်းများ အတိုင်း လုပ်ဆောင်နိုင်ပါသည်။
• ခံနိုင်ရည် ရှိသော မျိုးများကို အသုံးပြုပါ။
• မျိုးမချမီ ရောဂါကင်းအောင် မျိုးစေ့လူးနယ်ဆေးကို အသုံးပြုပါ။
• ထိရောက်သော မှိုသတ်ဆေးများကို အသုံးပြုပါ။
• မြေဆီလွှာ အာဟာရဓာတ်ကို ပုံမှန် စစ်ဆေးပြီး လိုအပ်သော မြေသြဇာကို ပေါင်းထည့်ပေးပါ။
      စပါးပင်များအား ရွက်ညိုပြောက်ရောဂါမှ ကာကွယ်ရန် မှိုသတ်ဆေးများကို စနစ်တကျ သုံးစွဲပေးရပါမည်။
  ဖော်ပြပါ ဆေးများကိုလည်း အသုံးပြုနိုင်ပါသည်။
  ၁။ ရေ ၄ ဂါလံဝင် ဆေးဖြန်းပုံးတစ်ပုံးလျှင် အဇိုဇီစတိုဗင် (၂၀%) + ဒိုင်ဖန်နိုကိုနားဇိုး (၁၂.၅%) အက်စီ၊ စားပွဲတင်ဇွန်း (၂) ဇွန်း
  ၂။ ရေ ၄ ဂါလံဝင် ဆေးဖြန်းပုံးတစ်ပုံးလျှင် ပရိုပီကိုနားဇိုး (၂၅၀%) အီးစီ၊ စားပွဲတင်ဇွန်း (၂) ဇွန်း
  ၃။ ရေ ၄ ဂါလံဝင် ဆေးဖြန်းပုံးတစ်ပုံးလျှင် ဟက်ဆာကိုနားဇိုး(၅%) အက်စီ ၊ စားပွဲတင်ဇွန်း (၆-၈) ဇွန်းသို့မဟုတ် ဈေးကွက်အတွင်း ဝယ်ယူရရှိနိုင်သာ မှိုသတ်ဆေးထုတ်များတွင် ပါရှိသည့် အညွှန်းအတိုင်း အသုံးပြုနိုင်ပါသည်။ (ဆေးညွှန်းကို သေချာဖတ်ပြီး လိုက်နာဆောင်ရွက်ပါ)""",

      imageURL: "assets/images/p5.jpg",
      postTime: DateTime(2022, 11, 25),
      reacts: 13,
      views: 45,
      comments: _comments,
    ),
    PostModel(
      id: "2",
      author: users[1],
      title: "Diseases",
      summary: """စပါးမှိုသီးရောဂါလက္ခဏာများ...""",
      body: """ စပါးစိုက်တောင်သူဦးကြီးတို့ရဲ့ စိုက်ခင်းထဲက စပါးနှံတွေပေါ်မှာ မှိုသီးလေးတွေတည်နေတာကို ကြုံဖူးကြမှာပါ။
စပါးမှိုသီးရောဂါဟာ စပါးအထွက်နှုန်းကို ဘယ်လိုလျော့ကျစေနိုင်မလဲဆိုတဲ့အကြောင်း အနည်းငယ်မျှဝေပေးလိုက်ပါတယ်။
      
      ရောဂါလက္ခဏာများ

- စပါးမှိုနှံသီး ရောဂါဖြစ်ပွားပါက စပါးစေ့များအား အရောင်အသွေး မှေးမှိန်စေကာ အရည်အသွေးကျဆင်းစေပါသည်။ ထို့အပြင် မျိုးညှောက်ပေါက်နှုန်းကိုလည်း လျှော့ကျစေပါသည်။
- စပါးမှိုနှံသီး ရောဂါ ဖြစ်ပွားထားသော အပင်များရှိ စပါးစေ့များသည် မှိုလုံးလေးများအဖြစ် ပြောင်းလဲသွားပါသည်။ ထိုအလုံးလေများသည် တဖြေးဖြေး လိမ္မော်ရောင် အဖြစ်ပြောင်းလာကာ နောက်ဆုံးတွင် အနက်ရောင်ဖြစ်သွားပါသည်။
- အများအားဖြင့် စပါးနှံတစ်ခုလုံးတွင် ရောဂါကျရောက်လေ့မရှိသော်လည်း မှိုသီးများနှင့် နီးကပ်နေသော စပါးစေ့များတွင်မူ အဖျင်းများ နေတတ်ပါသည်။

စပါးမှိုသီး ရောဂါကို ဘယ်လို ကာကွယ်နှိမ်နှင်းမလဲ?
      စပါးမှိုသီးရောဂါအား ကာကွယ်နှိမ်နှင်းခြင်းစပါးမှိုနှံသီးရောဂါအား ကာကွယ်ရန် ဖော်ပြပါ လမ်းညွှန်ချက်များကို လိုက်နာသင့်ပါသည်။
- လယ်ကွင်းအား သန့်ရှင်းအောင် ထားပါ။
- ရောဂါဖြစ်နေသော မျိုးစေ့များ၊စပါးနှံများနှင့် ပင်ကြွင်းပင်ကျန်များအား ရိတ်သိမ်းပြီးနောက် ဖယ်ရှားပစ်ပါ။
- နိုက်ထရိုဂျင်မြေသြဇာကို လိုအပ်သလောက်သာ အသုံးပြုပါ။
- ထိရောက်သော မှိုသတ်ဆေးများကို အနှံမထွက်ခင် အချိန်တွင် ကြိုတင်ကာကွယ် အသုံးပြုပါ။
- စပါးပင်များအား စပါးမှိုနှံသီးရောဂါမှ ကာကွယ်ရန်
၁။ ရေ ၄ ဂါလံဝင် ဆေးဖြန်းပုံးတစ်ပုံးလျှင် အဇိုဇီစတိုဗင် (၂၀%) + ဒိုင်ဖန်နိုကိုနားဇိုး (၁၂.၅%) အက်စီ၊ စားပွဲတင်ဇွန်း (၂) ဇွန်း
၂။ ရေ ၄ ဂါလံဝင် ဆေးဖြန်းပုံးတစ်ပုံးလျှင် ဟတ်ဇာကိုနာဇိုး ၅% အက်စီ စားပွဲတင်ဇွန်း (၆-၈) ဇွန်း ကို အသုံးပြုပေးပါ။ 

သို့မဟုတ် 

ဈေးကွက်အတွင်း ဝယ်ယူရရှိနိုင်သာ မှိုသတ်ဆေးထုတ်များတွင် ပါရှိသည့် အညွှန်းအတိုင်း အသုံးပြုနိုင်ပါသည်။ 
(ဆေးညွှန်းကို သေချာဖတ်ပြီး လိုက်နာဆောင်ရွက်ပါ)""",
      imageURL: "assets/images/p6.jpg",
      postTime: DateTime(2022, 11, 25),
      reacts: 30,
      views: 65,
      comments: _comments,
    ),
    PostModel(
      id: "3",
      author: users[2],
      title: "Crops news",
      summary: """စပါးဖျက်ပိုးများ ...
     """,
      body: _body,
      imageURL: "assets/images/p4.jpg",
      postTime: DateTime(2022, 11, 24),
      reacts: 23,
      views: 54,
      comments: _comments,
    ),
  ];
}

