import 'package:flutter/material.dart';
import 'package:chatapp_firebase/farming/post_data/view/widgets/post_card.dart';
import 'package:chatapp_firebase/farming/post_data/model/comment_model.dart';
import 'package:chatapp_firebase/farming/post_data/model/post_model.dart';
import 'package:chatapp_firebase/farming/post_data/model/user_model.dart';
import 'package:url_launcher/url_launcher.dart';

import '../../../weather/weather_main.dart';

const String _url = 'http://103.47.184.69:81/post-categories/207';

void _launchURL() async {
  if (!await launch(_url)) throw 'Could not launch $_url';
}


class Weather1 extends StatelessWidget {
  const Weather1({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        leading: IconButton(

          onPressed: () {
            Navigator.push(context, MaterialPageRoute(builder: (context) {
              return  MyWeather();
            }));
          },
          icon: Icon(Icons.arrow_back_ios_new),
        ),
        title: const Text("နေ့စဉ် မိုးလေဝသသတင်း"),

      ),
      body: ListView.builder(
        itemCount: DemoValues.posts.length,
        itemBuilder: (BuildContext context, int index) {
          return PostCard(postData: DemoValues.posts[index]);
        },
      ),
      floatingActionButton: const FloatingActionButton.extended(
        backgroundColor: Colors.blue,
        foregroundColor: Colors.white,
        onPressed: _launchURL,
        label: Text('See More'),
      ),
      floatingActionButtonLocation: FloatingActionButtonLocation.centerFloat,
    );
  }
}

class DemoValues {
  static final List<UserModel> users = [
    UserModel(
      id: "1",
      name: "မိုးဇလ",
      //email: "ishfar@gmail.com",
      email: "moezala.gov.mm",
      image: "assets/images/cus1.jpg",
      followers: 123,
      joined: DateTime(2022, 12, 17),
      posts: 12,
    ),
    UserModel(
      id: "2",
      name: "မိုးဇလ",
      //email: "ishfar@gmail.com",
      email: "moezala.gov.mm",
      image: "assets/images/cus1.jpg",
      followers: 123,
      joined: DateTime(2022, 12, 17),
      posts: 11,
    ),
    UserModel(
      id: "3",
      name: "မိုးဇလ",
      //email: "ishfar@gmail.com",
      email: "moezala.gov.mm",
      image: "assets/images/cus1.jpg",
      followers: 123,
      joined: DateTime(2022, 12, 17),
      posts: 10,
    ),
    UserModel(
      id: "4",
      name: "ကိုကျော်စိုး",
      //email: "shakleen@gmail.com",
      email: "ပိတောက်ခြံ",
      image: "assets/images/cus4.jpg",
      followers: 789,
      joined: DateTime(2022, 11, 24),
      posts: 14,
    ),
    UserModel(
      id: "5",
      name: "ဦးလွင်ကို",
      //email: "shakleen@gmail.com",
      email: "ကြံခင်း",
      image: "assets/images/cus5.jpg",
      followers: 789,
      joined: DateTime(2022, 11, 24),
      posts: 14,
    ),
    UserModel(
      id: "6",
      name: "မမေသူ",
      //email: "shakleen@gmail.com",
      email: "အိမ်မဲ",
      image: "assets/images/cus6.jpg",
      followers: 789,
      joined: DateTime(2022, 11, 24),
      posts: 14,
    ),
    UserModel(
      id: "7",
      name: "ကိုသန်းနိုင်",
      //email: "shakleen@gmail.com",
      email: "ပြည်တော်သာ",
      image: "assets/images/cus1.jpg",
      followers: 789,
      joined: DateTime(2022, 11, 24),
      posts: 14,
    ),
  ];

  static final List<CommentModel> _comments = <CommentModel>[
    CommentModel(
      comment:
      "Thank you",
      user: users[3],
      time: DateTime(2022, 11, 28),
    ),
    CommentModel(
      comment: "ကျေးဇူးပါ။ ",
      user: users[4],
      time: DateTime(2022, 11, 28),
    ),



    CommentModel(
      comment: "ကျေးဇူးပါ။ ",
      user: users[5],
      time: DateTime(2022, 11, 29),
    ),
    CommentModel(
      comment: "ကျေးဇူးတင်ပါတယ်ရှင့်။ ",
      user: users[6],
      time: DateTime(2022, 11, 29),
    ),

  ];

  static final List<PostModel> posts = [
    PostModel(
      id: "1",
      author: users[0],
      title: "မိုးလေဝသ",
      summary: """29.12.2022 7:00 AM """,
      body: """     (၂၀၂၂ ခုနှစ်၊ ဒီဇင်ဘာလ (၂၉)ရက်နေ့ နံနက်(၇:၀၀)နာရီအချိန် ထုတ်ပြန်ချက်)

ဘင်္ဂလားပင်လယ်အော်အ‌ခြေအနေ။ ကပ္ပလီပင်လယ်ပြင်တောင်ပိုင်းနှင့် ဘင်္ဂလားပင်လယ်အော်တောင်ပိုင်းတို့တွင် တိမ်အသင့်အတင့် ဖြစ်ထွန်းနေပြီး၊ ကပ္ပလီပင်လယ်ပြင်မြောက်ပိုင်းနှင့် ကျန်ဘင်္ဂလားပင်လယ်အော်တို့တွင်တိမ်အနည်းငယ်  ဖြစ်ထွန်းနေပါသည်။

ယနေ့ညနေအထိခန့်မှန်းချက်။ စစ်ကိုင်းတိုင်းဒေသကြီး၊ ကချင်ပြည်နယ်၊ ရှမ်းပြည်နယ်(မြောက်ပိုင်းနှင့် အရှေ့ပိုင်း)၊ချင်းပြည်နယ်၊ ရခိုင်ပြည်နယ်နှင့် မွန်ပြည်နယ်တို့တွင် နေရာကွက်ကျားမိုးထစ်ချုန်းရွာနိုင်ပါသည်။ ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။ ကျန်တိုင်းဒေသကြီးနှင့် ပြည်နယ်တို့တွင် တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မြန်မာ့ပင်လယ်ပြင်။လှိုင်းအနည်းငယ်မှ လှိုင်းအသင့်အတင့်ရှိမည်။ လှိုင်းအမြင့်မှာမြန်မာ့ကမ်းရိုးတန်းတစ်​လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် (၄)ပေမှ (၆)ပေခန့် ရှိနိုင်ပါသည်။

နောက်(၂)ရက်အတွက်ခန့်မှန်းချက်။ စစ်ကိုင်းတိုင်းဒေသကြီးအထက်ပိုင်း၊ တနင်္သာရီတိုင်းဒေသကြီး၊ ကချင်ပြည်နယ်၊ ရှမ်းပြည်နယ်(မြောက်ပိုင်းနှင့် အရှေ့ပိုင်း)၊ ချင်းပြည်နယ်၊ ရခိုင်ပြည်နယ်နှင့် မွန်ပြည်နယ်တို့တွင် နေရာကွက်ကျားမိုးထစ်ချုန်းရွာနိုင်ပါသည်။

နေပြည်တော်နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။       တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

ရန်ကုန်မြို့နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။           တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မန္တလေးမြို့နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။ တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။
        """,

      imageURL: "assets/weather/w5.png",
      postTime: DateTime(2022, 12, 29),
      reacts:317,
      views: 396,
      comments: _comments,
    ),
    PostModel(
      id: "1",
      author: users[0],
      title: "မိုးလေဝသ",
      summary: """28.12.2022 7:00 PM """,
      body: """   (၂၀၂၂ ခုနှစ်၊ ဒီဇင်ဘာလ (၂၈)ရက်နေ့ ည(၇:၀၀)နာရီအချိန် ထုတ်ပြန်ချက်)

ဘင်္ဂလားပင်လယ်အော်အ‌ခြေအနေ။ ဘင်္ဂလားပင်လယ်အော်မြောက်ပိုင်းတွင် တိမ်အနည်းငယ်  ဖြစ်ထွန်းနေပြီး၊ကပ္ပလီပင်လယ်ပြင်နှင့် ကျန်ဘင်္ဂလားပင်လယ်အော်တို့တွင် တိမ်အသင့်အတင့် ဖြစ်ထွန်းနေပါသည်။

မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။ နေပြည်တော်၊ စစ်ကိုင်းတိုင်းဒေသကြီး၊ မန္တလေးတိုင်းဒေသကြီး၊မကွေးတိုင်းဒေသကြီး၊ ပဲခူးတိုင်းဒေသကြီး၊ တနင်္သာရီတိုင်းဒေသကြီး၊ကချင်ပြည်နယ်၊ ရှမ်းပြည်နယ်၊ ချင်းပြည်နယ်၊ ရခိုင်ပြည်နယ်နှင့် မွန်ပြည်နယ်တို့တွင် နေရာကွက်ကျားမိုးထစ်ချုန်းရွာနိုင်ပါသည်။ ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။ ကျန်တိုင်းဒေသကြီးနှင့် ပြည်နယ်တို့တွင် တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မြန်မာ့ပင်လယ်ပြင်။လှိုင်းအသင့်အတင့်ရှိမည်။ လှိုင်းအမြင့်မှာမြန်မာ့ကမ်းရိုးတန်းတစ်လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် (၅)ပေမှ (၇)ပေခန့် ရှိနိုင်ပါသည်။

နောက်(၂)ရက်အတွက်ခန့်မှန်းချက်။ စစ်ကိုင်းတိုင်းဒေသကြီးအထက်ပိုင်း၊ တနင်္သာရီတိုင်းဒေသကြီး၊ ကချင်ပြည်နယ်၊ ရှမ်းပြည်နယ်(မြောက်ပိုင်းနှင့် အရှေ့ပိုင်း)၊ ချင်းပြည်နယ်၊ ရခိုင်ပြည်နယ်နှင့် မွန်ပြည်နယ်တို့တွင် နေရာကွက်ကျားမိုးထစ်ချုန်းရွာနိုင်ပါသည်။

နေပြည်တော်နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။ နေရာကွက်ကျားမိုးအနည်းငယ် ထစ်ချုန်းရွာနိုင်ပါသည်။ ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။

ရန်ကုန်မြို့နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။       တိမ်အသင့်အတင့်ဖြစ်ထွန်းမည်။

မန္တလေးမြို့နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။နေရာကွက်ကျားမိုးအနည်းငယ် ထစ်ချုန်းရွာနိုင်ပါသည်။ ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။   """,

      imageURL: "assets/weather/w5.png",
      postTime: DateTime(2022, 12, 28),
      reacts: 321,
      views: 379,
      comments: _comments,
    ),
    PostModel(
      id: "1",
      author: users[0],
      title: "မိုးလေဝသ",
      summary: """27.12.2022 7:00 AM """,
      body: """  (၂၀၂၂ ခုနှစ်၊ ဒီဇင်ဘာလ (၂၇)ရက်နေ့ နံနက်(၇:၀၀)နာရီအချိန် ထုတ်ပြန်ချက်)

ဘင်္ဂလားပင်လယ်အော်အ‌ခြေအနေ။ဘင်္ဂလားပင်လယ်အော်မြောက်ပိုင်းတွင် အများအားဖြင့် သာယာနေပြီး၊ ကပ္ပလီပင်လယ်ပြင်နှင့် ကျန်ဘင်္ဂလားပင်လယ်အော်တို့တွင် တိမ်အနည်းငယ်မှ တိမ်အသင့်အတင့် ဖြစ်ထွန်းနေပါသည်။

ယနေ့ညနေအထိခန့်မှန်းချက်။စစ်ကိုင်းတိုင်းဒေသကြီးအထက်ပိုင်းနှင့် ကချင်ပြည်နယ်တို့တွင် နေရာကျဲကျဲနှင့် ရှမ်းပြည်နယ်(မြောက်ပိုင်း)နှင့် ချင်းပြည်နယ်တို့တွင် နေရာကွက်ကျားမိုးထစ်ချုန်းရွာနိုင်ပါသည်။ ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။ ကျန်တိုင်းဒေသကြီးနှင့် ပြည်နယ်တို့တွင် တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မြန်မာ့ပင်လယ်ပြင်။လှိုင်းအသင့်အတင့်ရှိမည်။ လှိုင်းအမြင့်မှာမြန်မာ့ကမ်းရိုးတန်းတစ်လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် (၅)ပေမှ (၇)ပေခန့် ရှိနိုင်ပါသည်။

နောက်(၂)ရက်အတွက်ခန့်မှန်းချက်။ ရှမ်းပြည်နယ်နှင့် ကယားပြည်နယ်တို့တွင် ညအပူချိန်များအနည်းငယ်လျော့နည်းနိုင်ပါသည်။

နေပြည်တော်နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။       တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

ရန်ကုန်မြို့နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။           တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မန္တလေးမြို့နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။ တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။   """,

      imageURL: "assets/weather/w5.png",
      postTime: DateTime(2022, 12, 27),
      reacts: 321,
      views: 378,
      comments: _comments,
    ),
    PostModel(
      id: "1",
      author: users[0],
      title: "မိုးလေဝသ",
      summary: """26.12.2022 7:00 PM """,
      body: """  (၂၀၂၂ ခုနှစ်၊ ဒီဇင်ဘာလ (၂၆)ရက်နေ့ ည(၇:၀၀)နာရီအချိန် ထုတ်ပြန်ချက်)

ဘင်္ဂလားပင်လယ်အော်အ‌ခြေအနေ။ဘင်္ဂလားပင်လယ်အော်မြောက်ပိုင်းတွင် အများအားဖြင့် သာယာနေပြီး၊ ကပ္ပလီပင်လယ်ပြင်နှင့် ကျန်ဘင်္ဂလားပင်လယ်အော်တို့တွင် တိမ်အနည်းငယ်မှ တိမ်အသင့်အတင့် ဖြစ်ထွန်းနေပါသည်။

မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။ကချင်ပြည်နယ်တွင် နေရာကျဲကျဲနှင့် စစ်ကိုင်းတိုင်းဒေသကြီးအထက်ပိုင်း၊ရန်ကုန်တိုင်းဒေသကြီး၊ ဧရာဝတီတိုင်းဒေသကြီး၊ တနင်္သာရီတိုင်းဒေသကြီးနှင့် ရှမ်းပြည်နယ်(အရှေ့ပိုင်း)တို့တွင်နေရာကွက်ကျားမိုးအနည်းငယ် ထစ်ချုန်းရွာနိုင်ပါသည်။ ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။ စစ်ကိုင်းတိုင်းဒေသကြီးအောက်ပိုင်းနှင့် ချင်းပြည်နယ်တို့တွင် အများအားဖြင့် သာယာပြီး၊ ကျန်တိုင်းဒေသကြီးနှင့် ပြည်နယ်တို့တွင် တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မြန်မာ့ပင်လယ်ပြင်။လှိုင်းအသင့်အတင့်ရှိမည်။ လှိုင်းအမြင့်မှာမြန်မာ့ကမ်းရိုးတန်းတစ်လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် (၅)ပေမှ (၇)ပေခန့် ရှိနိုင်ပါသည်။

နောက်(၂)ရက်အတွက်ခန့်မှန်းချက်။ ရှမ်းပြည်နယ်နှင့် ကယားပြည်နယ်တို့တွင် ညအပူချိန်များအနည်းငယ်လျော့နည်းနိုင်ပါသည်။

နေပြည်တော်နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။ တိမ်အသင့်အတင့်ဖြစ်ထွန်းမည်။

ရန်ကုန်မြို့နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။       နေရာကွက်ကျားမိုးအနည်းငယ် ထစ်ချုန်းရွာနိုင်ပါသည်။ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။

မန္တလေးမြို့နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။တိမ်အသင့်အတင့်ဖြစ်ထွန်းမည်။   """,

      imageURL: "assets/weather/w5.png",
      postTime: DateTime(2022, 12, 26),
      reacts: 280,
      views: 345,
      comments: _comments,
    ),
    PostModel(
      id: "1",
      author: users[0],
      title: "မိုးလေဝသ",
      summary: """26.12.2022 7:00 AM """,
      body: """   (၂၀၂၂ ခုနှစ်၊ ဒီဇင်ဘာလ (၂၆)ရက်နေ့ နံနက်(၇:၀၀)နာရီအချိန် ထုတ်ပြန်ချက်)

ဘင်္ဂလားပင်လယ်အော်အ‌ခြေအနေ။ဘင်္ဂလားပင်လယ်အော်မြောက်ပိုင်းတွင် တိမ်အနည်းငယ် ဖြစ်ထွန်းနေပြီး၊ ကပ္ပလီပင်လယ်ပြင်နှင့် ကျန်ဘင်္ဂလားပင်လယ်အော်တို့တွင် တိမ်အသင့်အတင့်ဖြစ်ထွန်းနေပါသည်။

ယနေ့ညနေအထိခန့်မှန်းချက်။စစ်ကိုင်းတိုင်းဒေသကြီးအထက်ပိုင်း၊ ပဲခူးတိုင်းဒေသကြီး၊ ရန်ကုန်တိုင်းဒေသကြီး၊ ဧရာဝတီတိုင်းဒေသကြီးနှင့် ကချင်ပြည်နယ်တို့တွင် နေရာကွက်ကျား မိုးအနည်းငယ်ထစ်ချုန်းရွာနိုင်ပါသည်။ ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။ စစ်ကိုင်းတိုင်းဒေသကြီးအောက်ပိုင်း၊ မကွေးတိုင်းဒေသကြီးနှင့် ချင်းပြည်နယ်တို့တွင် အများအားဖြင့် သာယာပြီး၊ ကျန်တိုင်းဒေသကြီးနှင့်ပြည်နယ်တို့တွင် တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မြန်မာ့ပင်လယ်ပြင်။လှိုင်းအသင့်အတင့်ရှိမည်။ လှိုင်းအမြင့်မှာမြန်မာ့ကမ်းရိုးတန်းတစ်လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် (၅)ပေမှ (၇)ပေခန့် ရှိနိုင်ပါသည်။

နောက်(၂)ရက်အတွက်ခန့်မှန်းချက်။ စစ်ကိုင်းတိုင်းဒေသကြီးအထက်ပိုင်းနှင့် ကချင်ပြည်နယ်တို့တွင် နေရာကွက်ကျားမှ နေရာကျဲကျဲမိုးထစ်ချုန်းရွာနိုင်ပါသည်။

နေပြည်တော်နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။       တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

ရန်ကုန်မြို့နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။           နေရာကွက်ကျားမိုးအနည်းငယ် ထစ်ချုန်းရွာနိုင်ပါသည်။ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။

မန္တလေးမြို့နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။ တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။   """,

      imageURL: "assets/weather/w5.png",
      postTime: DateTime(2022, 12, 26),
      reacts: 340,
      views: 416,
      comments: _comments,
    ),
    PostModel(
      id: "1",
      author: users[0],
      title: "မိုးလေဝသ",
      summary: """25.12.2022 7:00 PM """,
      body: """  (၂၀၂၂ ခုနှစ်၊ ဒီဇင်ဘာလ (၂၅)ရက်နေ့ ည(၇:၀၀)နာရီအချိန် ထုတ်ပြန်ချက်)

ဘင်္ဂလားပင်လယ်အော်အ‌ခြေအနေ။ ယနေ့မြန်မာစံတော်ချိန် (၁၇:၃၀)နာရီအချိန်တိုင်းထွာချက်များအရသီရိလင်္ကာနိုင်ငံကိုထရီကိုမာလီမြို့(Trincomalee)အနီးမှ ဖြတ်ကျော် ဝင်ရောက်ခဲ့သော မုန်တိုင်းငယ်(Depression)သည် အနောက်-အနောက်တောင်ဘက်သို့ ရွေ့လျားခဲ့ပြီး၊ အားကောင်းသောလေဖိအားနည်းရပ်ဝန်း(Well Marked Low Pressure Area)အဖြစ်သို့ အားလျော့သွားခဲ့ပါသည်။ အဆိုပါ အားကောင်းသောလေဖိအားနည်းရပ်ဝန်း(Well Marked Low Pressure Area)သည်အနောက်-အနောက်တောင်ဘက်သို့ ဆက်လက်ရွေ့လျားနိုင်ပြီး၊ နောက်(၁၂)နာရီအတွင်း ကိုမိုရင်းဧရိယာနှင့် အနီးတစ်ဝိုက်သို့ ရောက်ရှိနိုင်သည်ဟုခန့်မှန်းရပါသည်။ဘင်္ဂလားပင်လယ်အော်မြောက်ပိုင်းတွင် တိမ်အနည်းငယ် ဖြစ်ထွန်းနေပြီး၊ ကပ္ပလီပင်လယ်ပြင်နှင့် ကျန်ဘင်္ဂလားပင်လယ်အော်တို့တွင် တိမ်အသင့်အတင့်မှ တိမ်ထူထပ်နေပါသည်။

မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။နေပြည်တော်၊ စစ်ကိုင်းတိုင်းဒေသကြီးအထက်ပိုင်း၊ ပဲခူးတိုင်းဒေသကြီး၊ရန်ကုန်တိုင်းဒေသကြီး၊ ဧရာဝတီတိုင်းဒေသကြီး၊ ကချင် ပြည်နယ်နှင့် ရှမ်းပြည်နယ်(တောင်ပိုင်းနှင့် အရှေ့ပိုင်း)တို့တွင် နေရာကွက်ကျားမိုးအနည်းငယ်ထစ်ချုန်းရွာနိုင်ပါသည်။ ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။ စစ်ကိုင်းတိုင်းဒေသကြီး အောက်ပိုင်း၊ မကွေးတိုင်းဒေသကြီးနှင့် ချင်းပြည်နယ်တို့တွင် အများအားဖြင့် သာယာပြီး၊ ကျန်တိုင်းဒေသကြီးနှင့် ပြည်နယ်တို့တွင် တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မြန်မာ့ပင်လယ်ပြင်။လှိုင်းအသင့်အတင့်ရှိမည်။ လှိုင်းအမြင့်မှာမြန်မာ့ကမ်းရိုးတန်းတစ်လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် (၅)ပေမှ (၇)ပေခန့် ရှိနိုင်ပါသည်။

နောက်(၂)ရက်အတွက်ခန့်မှန်းချက်။ စစ်ကိုင်းတိုင်းဒေသကြီးအထက်ပိုင်းနှင့် ကချင်ပြည်နယ်တို့တွင် နေရာကွက်ကျားမှ နေရာကျဲကျဲမိုးထစ်ချုန်းရွာနိုင်ပါသည်။

နေပြည်တော်နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။ နေရာကွက်ကျားမိုးအနည်းငယ် ထစ်ချုန်းရွာနိုင်ပါသည်။ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။

ရန်ကုန်မြို့နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။       နေရာကွက်ကျားမိုးအနည်းငယ် ထစ်ချုန်းရွာနိုင်ပါသည်။ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။

မန္တလေးမြို့နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။တိမ်အသင့်အတင့်ဖြစ်ထွန်းမည်။   """,

      imageURL: "assets/weather/w5.png",
      postTime: DateTime(2022, 12, 25),
      reacts: 370,
      views: 450,
      comments: _comments,
    ),
    PostModel(
      id: "1",
      author: users[0],
      title: "မိုးလေဝသ",
      summary: """25.12.2022 7:00 AM """,
      body: """  (၂၀၂၂ ခုနှစ်၊ ဒီဇင်ဘာလ (၂၅)ရက်နေ့ နံနက်(၇:၀၀)နာရီအချိန် ထုတ်ပြန်ချက်)

ဘင်္ဂလားပင်လယ်အော်အ‌ခြေအနေ။ယနေ့မြန်မာစံတော်ချိန်(၀၅:၃၀)နာရီအချိန်တိုင်းထွာချက်များအရဘင်္ဂလားပင်လယ်အော်အနောက်တောင်ပိုင်းတွင် ဖြစ်ပေါ်နေသောမုန်တိုင်းငယ် (Depression)သည် အနောက်-အနောက် တောင်ဘက်သို့ ရွေ့လျားခဲ့ပြီး၊ မြန်မာနိုင်ငံ၊ ကိုကိုးကျွန်းမြို့(Coco Island)၏ အနောက်တောင်ဘက် ရေမိုင်(၇၂၀)မိုင်ခန့်၊ ဟိုင်းကြီးကျွန်းမြို့ (Hainggyikyun)၏ အနောက်တောင်ဘက် ရေမိုင်(၈၂၀)မိုင်ခန့်၊ သီရိလင်္ကာနိုင်ငံ၊ ထရီကို မာလီမြို့(Trincomalee)၏ အရှေ့-အရှေ့မြောက်ဘက် ရေမိုင်(၇၀)မိုင်ခန့်၊ ဂျက်ဖ်နာမြို့(Jaffna)၏ အရှေ့-အရှေ့တောင်ဘက် ရေမိုင်(၁၄၀)မိုင်ခန့်၊ အိန္ဒိယနိုင်ငံ၊ နာဂါပတ္တနမ်မြို့(Nagappattinam)၏ အရှေ့တောင်ဘက် ရေမိုင်(၁၈၀)မိုင်ခန့်နှင့် ချင်းနိုင်မြို့(Chennai)၏ တောင်-အရှေ့တောင်ဘက် ရေမိုင်(၂၇၅)မိုင်ခန့်အကွာ ပင်လယ်ပြင်ကိုဗဟိုပြုနေပါသည်။ဘင်္ဂလားပင်လယ်အော်အနောက်တောင်ပိုင်းတွင် တိမ်ထူထပ်နေပြီး၊ ကပ္ပလီပင်လယ်ပြင်နှင့် ကျန်ဘင်္ဂလားပင်လယ်အော်တို့တွင် တိမ်အနည်းငယ်မှ တိမ်အသင့်အတင့်မှ ဖြစ်ထွန်းနေပါသည်။

ယနေ့ညနေအထိခန့်မှန်းချက်။နေပြည်တော်၊ မန္တလေးတိုင်းဒေသကြီး၊ မကွေးတိုင်းဒေသကြီး၊ ပဲခူးတိုင်းဒေသကြီး၊ ရန်ကုန်တိုင်းဒေသကြီး၊ ဧရာဝတီတိုင်းဒေသကြီး၊ ရှမ်းပြည်နယ်(တောင်ပိုင်းနှင့် အရှေ့ပိုင်း)နှင့် ရခိုင်ပြည်နယ်တို့တွင် နေရာကွက်ကျားမိုးထစ်ချုန်းရွာနိုင်ပါသည်။ ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။ ကျန်တိုင်းဒေသကြီးနှင့် ပြည်နယ်တို့တွင်တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မြန်မာ့ပင်လယ်ပြင်။မြန်မာ့ကမ်းရိုးတန်းတစ်လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် တစ်ခါတစ်ရံမိုးသက်လေပြင်းများကျရောက်ပြီးလှိုင်းအသင့်အတင့်မှ လှိုင်းကြီးနိုင်ပါသည်။မိုးသက်လေပြင်းကျစဉ် ရေပြင်/မြေပြင်လေသည် တစ်နာရီလျှင် မိုင်(၃၀)မှ (၃၅)မိုင်အထိတိုက်ခတ်နိုင်ပါသည်။ လှိုင်းအမြင့်မှာမြန်မာ့ကမ်းရိုးတန်းတစ်​လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် (၆)ပေမှ (၉)ပေခန့် ရှိနိုင်ပါသည်။

နောက်(၂)ရက်အတွက်ခန့်မှန်းချက်။ စစ်ကိုင်းတိုင်းဒေသကြီးအထက်ပိုင်း၊ ကချင်ပြည်နယ်နှင့် ရှမ်းပြည်နယ်(မြောက်ပိုင်းနှင့် အရှေ့ပိုင်း)တို့တွင် နေရာကွက်ကျားမိုးထစ်ချုန်းရွာနိုင်ပါသည်။

နေပြည်တော်နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။       နေရာကွက်ကျားမိုးအနည်းငယ် ထစ်ချုန်းရွာနိုင်ပါသည်။ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။

ရန်ကုန်မြို့နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။           နေရာကွက်ကျားမိုးအနည်းငယ် ထစ်ချုန်းရွာနိုင်ပါသည်။ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။

မန္တလေးမြို့နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။ တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။     """,

      imageURL: "assets/weather/w5.png",
      postTime: DateTime(2022, 12, 25),
      reacts: 361,
      views: 415,
      comments: _comments,
    ),
    PostModel(
      id: "1",
      author: users[0],
      title: "မိုးလေဝသ",
      summary: """24.12.2022 7:00 AM """,
      body: """  (၂၀၂၂ ခုနှစ်၊ ဒီဇင်ဘာလ (၂၄)ရက်နေ့ နံနက်(၇:၀၀)နာရီအချိန် ထုတ်ပြန်ချက်)

ဘင်္ဂလားပင်လယ်အော်အ‌ခြေအနေ။ယနေ့မြန်မာစံတော်ချိန် (၀၅:၃၀)နာရီအချိန် တိုင်းထွာချက်များအရဘင်္ဂလားပင်လယ်အော်အနောက်တောင်ပိုင်းတွင် ဖြစ်ပေါ်နေသောမုန်တိုင်းငယ်(Depression)သည် ကွင်းဆက်ပုံသဏ္ဍာန်ရွေ့လျားပြီး၊ မြန်မာနိုင်ငံ၊ ကိုကိုးကျွန်းမြို့(Coco Island)၏  အနောက်-အနောက်တောင်ဘက် ရေမိုင်(၆၀၅)မိုင်ခန့်၊ ဟိုင်းကြီးကျွန်းမြို့(Hainggyikyun)၏ အနောက်-အနောက်တောင်ဘက် ရေမိုင်(၇၀၅) မိုင်ခန့်၊ သီရိလင်္ကာနိုင်ငံ၊ ထရီကိုမာလီမြို့(Trincomalee)၏ အရှေ့-အရှေ့ မြောက်ဘက် ရေမိုင်(၁၉၀)မိုင်ခန့်၊ အိန္ဒိယနိုင်ငံ၊ နာဂါပတ္တနမ်မြို့(Nagappattinam) ၏ အရှေ့-အရှေ့တောင်ဘက် ရေမိုင်(၂၃၅)မိုင်ခန့်နှင့် ချင်းနိုင်မြို့(Chennai) ၏ အရှေ့-အရှေ့တောင်ဘက် ရေမိုင်(၂၇၀)မိုင်ခန့်အကွာ ပင်လယ်ပြင်ကို ဗဟိုပြုနေပါသည်။ကပ္ပလီပင်လယ်ပြင်တွင် တိမ်အနည်းငယ် ဖြစ်ထွန်းနေပြီး၊ ဘင်္ဂလားပင်လယ်အော်တွင် တိမ်အသင့်အတင့်မှ တိမ်ထူထပ်နေပါသည်။

ယနေ့ညနေအထိခန့်မှန်းချက်။ နေပြည်တော်၊ မန္တလေးတိုင်းဒေသကြီး၊ မကွေးတိုင်းဒေသကြီး၊ ပဲခူးတိုင်းဒေသကြီး၊ရန်ကုန်တိုင်းဒေသကြီး၊ ဧရာဝတီတိုင်းဒေသကြီး၊ ရှမ်းပြည်နယ်(တောင်ပိုင်းနှင့် အရှေ့ပိုင်း)နှင့် ရခိုင်ပြည်နယ်တို့တွင် နေရာကွက်ကျားမိုးအနည်းငယ် ထစ်ချုန်းရွာနိုင်ပါသည်။ ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။ ကျန်တိုင်းဒေသကြီးနှင့် ပြည်နယ်တို့တွင်တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မြန်မာ့ပင်လယ်ပြင်။မြန်မာ့ကမ်းရိုးတန်းတစ်လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် တစ်ခါတစ်ရံမိုးသက်လေပြင်းများကျရောက်ပြီးလှိုင်းအသင့်အတင့်မှ လှိုင်းကြီးနိုင်ပါသည်။မိုးသက်လေပြင်းကျစဉ် ရေပြင်/မြေပြင်လေသည် တစ်နာရီလျှင် မိုင်(၃၀)မှ (၃၅)မိုင်အထိတိုက်ခတ်နိုင်ပါသည်။ လှိုင်းအမြင့်မှာမြန်မာ့ကမ်းရိုးတန်းတစ်​လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် (၆)ပေမှ (၉)ပေခန့် ရှိနိုင်ပါသည်။

နောက်(၂)ရက်အတွက်ခန့်မှန်းချက်။ နေပြည်တော်၊ စစ်ကိုင်းတိုင်းဒေသကြီးအထက်ပိုင်း၊ မန္တလေးတိုင်းဒေသကြီး၊ပဲခူးတိုင်းဒေသကြီး၊ ရန်ကုန်တိုင်းဒေသကြီး၊ ဧရာဝတီတိုင်းဒေသကြီး၊ ကချင်ပြည်နယ်၊ ရှမ်းပြည်နယ်(တောင်ပိုင်းနှင့် အရှေ့ပိုင်း)၊ ကယားပြည်နယ်၊ ကရင်ပြည်နယ်နှင့် မွန်ပြည်နယ်တို့တွင် နေရာကွက်ကျားမိုးထစ်ချုန်းရွာနိုင်ပါသည်။

နေပြည်တော်နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။       နေရာကွက်ကျားမိုးအနည်းငယ် ထစ်ချုန်းရွာနိုင်ပါသည်။ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။

ရန်ကုန်မြို့နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။           တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မန္တလေးမြို့နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။ တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။     """,

      imageURL: "assets/weather/w5.png",
      postTime: DateTime(2022, 12, 24),
      reacts: 261,
      views: 384,
      comments: _comments,
    ),
    PostModel(
      id: "1",
      author: users[0],
      title: "မိုးလေဝသ",
      summary: """23.12.2022 7:00 AM """,
      body: """ (၂၀၂၂ ခုနှစ်၊ ဒီဇင်ဘာလ (၂၃)ရက်နေ့ နံနက်(၇:၀၀)နာရီအချိန် ထုတ်ပြန်ချက်)

ဘင်္ဂလားပင်လယ်အော်အ‌ခြေအနေ။ ယနေ့မြန်မာစံတော်ချိန် (၀၅:၃၀)နာရီအချိန်တိုင်းထွာချက်များအရ ဘင်္ဂလားပင်လယ်အော်အနောက်တောင်ပိုင်းတွင် ဖြစ်ပေါ်နေသော မုန်တိုင်းငယ်(Depression) သည် အနောက်မြောက်ဘက်သို့ ရွေ့လျားခဲ့ပြီး၊ မြန်မာနိုင်ငံ၊ ကိုကိုးကျွန်းမြို့ (Coco Island)၏  အနောက်-အနောက်တောင်ဘက် ရေမိုင်(၅၉၅) မိုင်ခန့်၊ ဟိုင်းကြီးကျွန်းမြို့(Hainggyikyun)၏ အနောက်-အနောက်တောင်ဘက် ရေမိုင်(၆၉၅)မိုင်ခန့်၊ သီရိလင်္ကာနိုင်ငံ၊ ထရီကိုမာလီမြို့(Trincomalee)၏ အရှေ့-အရှေ့မြောက်ဘက် ရေမိုင် (၁၉၅)မိုင်ခန့်၊ အိန္ဒိယနိုင်ငံ၊နာဂါပတ္တနမ်မြို့(Nagappattinam)၏ အရှေ့-အရှေ့တောင်ဘက် ရေမိုင် (၂၅၀)မိုင်ခန့်နှင့် ချင်းနိုင်မြို့ (Chennai)၏ အရှေ့-အရှေ့တောင်ဘက် ရေမိုင် (၂၇၅)မိုင်ခန့်အကွာ ပင်လယ်ပြင်ကို ဗဟိုပြုနေပါသည်။ကပ္ပလီပင်လယ်ပြင်နှင့်ဘင်္ဂလားပင်လယ်အော်မြောက်ပိုင်းတို့တွင် တိမ်အနည်းငယ် ဖြစ်ထွန်းနေပြီး၊ ကျန်ဘင်္ဂလားပင်လယ်အော်တွင် တိမ်အသင့်အတင့်မှ တိမ်ထူထပ်နေပါသည်။

ယနေ့ညနေအထိခန့်မှန်းချက်။ မကွေးတိုင်းဒေသကြီး၊ ဧရာဝတီတိုင်းဒေသကြီးနှင့် ရခိုင်ပြည်နယ်တို့တွင် နေရာကွက်ကျားမိုးအနည်းငယ်ထစ်ချုန်းရွာနိုင်ပါသည်။ ရွာရန် ရာနှုန်း(၆၀)  ဖြစ်ပါသည်။ ကျန်တိုင်းဒေသကြီးနှင့် ပြည်နယ်တို့တွင် တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မြန်မာ့ပင်လယ်ပြင်။မြန်မာ့ကမ်းရိုးတန်းတစ်လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် တစ်ခါတစ်ရံမိုးသက်လေပြင်းများကျရောက်ပြီး လှိုင်းအသင့်အတင့်မှ လှိုင်းကြီး နိုင်ပါသည်။ မိုးသက်လေပြင်းကျစဉ် ရေပြင်/မြေပြင်လေသည် တစ်နာရီလျှင် မိုင်(၃၀)မှ (၃၅)မိုင်အထိတိုက်ခတ်နိုင်ပါသည်။ လှိုင်းအမြင့်မှာမြန်မာ့ကမ်းရိုးတန်းတစ်​လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် (၆)ပေမှ (၉)ပေခန့် ရှိနိုင်ပါသည်။

နောက်(၂)ရက်အတွက်ခန့်မှန်းချက်။ နေပြည်တော်၊ မန္တလေးတိုင်းဒေသကြီး၊ မကွေးတိုင်းဒေသကြီး၊ ပဲခူးတိုင်းဒေသကြီး၊ ရန်ကုန်တိုင်းဒေသကြီး၊ ဧရာဝတီတိုင်းဒေသကြီး၊ ရှမ်းပြည်နယ်(တောင်ပိုင်းနှင့် အရှေ့ပိုင်း)၊ ရခိုင်ပြည်နယ်၊ ကယားပြည်နယ်၊ ကရင်ပြည်နယ်နှင့် မွန်ပြည်နယ်တို့တွင် နေရာကွက်ကျားမိုးထစ်ချုန်းရွာနိုင်ပါသည်။

နေပြည်တော်နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။       တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

ရန်ကုန်မြို့နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။           တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မန္တလေးမြို့နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။ တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။     """,

      imageURL: "assets/weather/w5.png",
      postTime: DateTime(2022, 12, 23),
      reacts: 175,
      views: 286,
      comments: _comments,
    ),
    PostModel(
      id: "1",
      author: users[0],
      title: "မိုးလေဝသ",
      summary: """22.12.2022 7:00 PM """,
      body: """(၂၀၂၂ ခုနှစ်၊ ဒီဇင်ဘာလ (၂၂)ရက်နေ့ ည(၇:၀၀)နာရီအချိန် ထုတ်ပြန်ချက်)

ဘင်္ဂလားပင်လယ်အော်အ‌ခြေအနေ။ ယနေ့မြန်မာစံတော်ချိန် (၁၇:၃၀)နာရီအချိန် တိုင်းထွာချက်များအရဘင်္ဂလားပင်လယ်အော်အနောက်တောင်ပိုင်းတွင် ဖြစ်ပေါ်နေသော မုန်တိုင်းငယ်(Depression)သည် မြောက်-အနောက်မြောက်ဘက်သို့ ရွေ့လျားခဲ့ပြီး၊ မြန်မာနိုင်ငံ၊ ကိုကိုးကျွန်းမြို့(Coco Island)၏  အနောက်-အနောက်တောင် ဘက်ရေမိုင်(၅၈၀)မိုင်ခန့်၊ ဟိုင်းကြီးကျွန်းမြို့(Hainggyikyun)၏ အနောက်-အနောက်တောင်ဘက် ရေမိုင်(၆၈၅)မိုင်ခန့်၊ သီရိလင်္ကာနိုင်ငံ၊ ထရီကိုမာလီမြို့ (Trincomalee)၏ အရှေ့-အရှေ့မြောက်ဘက် ရေမိုင် (၂၁၀)မိုင်ခန့်၊ အိန္ဒိယနိုင်ငံ၊ နာဂါပတ္တနမ်မြို့(Nagappattinam)၏ အရှေ့-အရှေ့တောင်ဘက် ရေမိုင် (၂၈၅)မိုင်ခန့် နှင့် ချင်းနိုင်မြို့(Chennai)၏ အရှေ့-အရှေ့တောင်ဘက် ရေမိုင် (၃၂၅)မိုင်ခန့်အကွာ ပင်လယ်ပြင်ကို ဗဟိုပြုနေပါသည်။ ကပ္ပလီပင်လယ်ပြင်၊ ဘင်္ဂလားပင်လယ်အော် မြောက်ပိုင်းနှင့် အရှေ့အလယ်ပိုင်းတို့တွင် တိမ်အနည်းငယ်မှ တိမ်အသင့်အတင့် ဖြစ်ထွန်းနေပြီး၊ ကျန်ဘင်္ဂလားပင်လယ်အော်တွင် တိမ်ထူထပ်နေပါသည်။

မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။ စစ်ကိုင်းတိုင်းဒေသကြီးအထက်ပိုင်း၊ မကွေးတိုင်းဒေသကြီး၊ ပဲခူးတိုင်းဒေသကြီး၊ ရန်ကုန်တိုင်းဒေသကြီး၊ ဧရာဝတီတိုင်းဒေသကြီး၊ ကချင်ပြည်နယ်၊ ချင်းပြည်နယ်နှင့် ရခိုင်ပြည်နယ်တို့တွင် နေရာကွက်ကျားမိုးထစ်ချုန်းရွာနိုင်ပါသည်။ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။ ကျန်တိုင်းဒေသကြီးနှင့် ပြည်နယ်တို့တွင် တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မြန်မာ့ပင်လယ်ပြင်။မြန်မာ့ကမ်းရိုးတန်းတစ်လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် တစ်ခါတစ်ရံမိုးသက်လေပြင်းများကျရောက်ပြီးလှိုင်းအသင့်အတင့်မှ လှိုင်းကြီး နိုင်ပါသည်။ မိုးသက်လေပြင်းကျစဉ် ရေပြင်/မြေပြင်လေသည် တစ်နာရီလျှင် မိုင်(၃၀)မှ (၃၅)မိုင်အထိတိုက်ခတ်နိုင်ပါသည်။ လှိုင်းအမြင့်မှာမြန်မာ့ကမ်းရိုးတန်းတစ်​လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် (၆)ပေမှ (၉)ပေခန့် ရှိနိုင်ပါသည်။

နောက်(၂)ရက်အတွက်ခန့်မှန်းချက်။ နေပြည်တော်၊ မန္တလေးတိုင်းဒေသကြီး၊ မကွေးတိုင်းဒေသကြီး၊ ပဲခူးတိုင်းဒေသကြီး၊ ရန်ကုန်တိုင်းဒေသကြီး၊ ဧရာဝတီတိုင်းဒေသကြီး၊ ရှမ်းပြည်နယ်(တောင်ပိုင်းနှင့် အရှေ့ပိုင်း)၊ ချင်းပြည်နယ်၊ ရခိုင်ပြည်နယ်၊ ကယားပြည်နယ်၊ ကရင်ပြည်နယ်နှင့် မွန်ပြည်နယ်တို့တွင် နေရာကွက်ကျားမိုးထစ်ချုန်းရွာနိုင်ပါသည်။

နေပြည်တော်နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။တိမ်အသင့်အတင့်ဖြစ်ထွန်းမည်။

ရန်ကုန်မြို့နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။       နေရာကွက်ကျားမိုးအနည်းငယ် ထစ်ချုန်းရွာနိုင်ပါသည်။ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။

မန္တလေးမြို့နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။တိမ်အသင့်အတင့်ဖြစ်ထွန်းမည်။
      """,

      imageURL: "assets/weather/w5.png",
      postTime: DateTime(2022, 12, 22),
      reacts: 205,
      views: 196,
      comments: _comments,
    ),
    PostModel(
      id: "1",
      author: users[0],
      title: "မိုးလေဝသ",
      summary: """21.12.2022 7:00 AM """,
      body: """(၂၀၂၂ ခုနှစ်၊ ဒီဇင်ဘာလ (၂၁)ရက်နေ့ နံနက်(၇:၀၀)နာရီအချိန် ထုတ်ပြန်ချက်)

ဘင်္ဂလားပင်လယ်အော်အ‌ခြေအနေ။ယနေ့မြန်မာစံတော်ချိန်(၀၅:၃၀)နာရီအချိန် တိုင်းထွာချက်များအရဘင်္ဂလားပင်လယ်အော်တောင်ပိုင်းနှင့် ယင်းနှင့်ဆက်စပ်လျက်ရှိသောအီကွေတာအနီးအိန္ဒိယသမုဒ္ဒရာအရှေ့ပိုင်းတို့တွင် ဖြစ်ပေါ်နေသောလေဖိအားနည်းရပ်ဝန်း(Low Pressure Area)သည် ဆက်လက်တည်ရှိနေပါသည်။ ကပ္ပလီပင်လယ်ပြင်မြောက်ပိုင်းနှင့် ဘင်္ဂလားပင်လယ်အော်မြောက်ပိုင်းတို့တွင် တိမ်အနည်းငယ် ဖြစ်ထွန်းနေပြီး၊ ကပ္ပလီပင်လယ်ပြင်တောင်ပိုင်းနှင့် ကျန်ဘင်္ဂလားပင်လယ်အော်တို့တွင် တိမ်အသင့်အတင့်မှ တိမ်ထူထပ်နေပါသည်။

ယနေ့ညနေအထိခန့်မှန်းချက်။ မကွေးတိုင်းဒေသကြီး၊ ရှမ်းပြည်နယ်(တောင်ပိုင်း)နှင့် ရခိုင်ပြည်နယ်တို့တွင် နေရာကွက်ကျားမိုးထစ်ချုန်းရွာနိုင်ပါသည်။ ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။ ကျန်တိုင်းဒေသကြီးနှင့် ပြည်နယ်တို့တွင်တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မြန်မာ့ပင်လယ်ပြင်။လှိုင်းအသင့်အတင့်ရှိမည်။ လှိုင်းအမြင့်မှာမြန်မာ့ကမ်းရိုးတန်းတစ်​လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် (၅)ပေမှ (၇)ပေခန့် ရှိနိုင်ပါသည်။

နောက်(၂)ရက်အတွက်ခန့်မှန်းချက်။ စစ်ကိုင်းတိုင်းဒေသကြီး၊ မန္တလေးတိုင်းဒေသကြီး၊ မကွေးတိုင်းဒေသကြီး၊ ရှမ်းပြည်နယ်နှင့် ချင်းပြည်နယ်တို့တွင် ညအပူချိန်များအနည်းငယ် လျော့နည်းနိုင်ပါသည်။

နေပြည်တော်နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။       တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

ရန်ကုန်မြို့နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။           တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မန္တလေးမြို့နှင့်အနီးတစ်ဝိုက်အတွက်ယနေ့ညနေအထိခန့်မှန်းချက်။ တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။
      """,

      imageURL: "assets/weather/w5.png",
      postTime: DateTime(2022, 12, 21),
      reacts: 156,
      views: 179,
      comments: _comments,
    ),
    PostModel(
      id: "2",
      author: users[0],
      title: "မိုးလေဝသ",
      summary: """20.12.2022 7:00 PM """,
      body: """(၂၀၂၂ ခုနှစ်၊ ဒီဇင်ဘာလ (၂၀)ရက်နေ့ ည(၇:၀၀)နာရီအချိန် ထုတ်ပြန်ချက်)

ဘင်္ဂလားပင်လယ်အော်အ‌ခြေအနေ။ယနေ့မြန်မာစံတော်ချိန်(၁၇:၃၀)နာရီအချိန်တိုင်းထွာချက်များအရဘင်္ဂလားပင်လယ်အော်တောင်ပိုင်းနှင့် ယင်းနှင့်ဆက်စပ်လျက်ရှိသောအီကွေတာအနီးအိန္ဒိယသမုဒ္ဒရာအရှေ့ပိုင်းတို့တွင် ဖြစ်ပေါ်နေသောလေဖိအားနည်းရပ်ဝန်း(Low Pressure Area)သည် ဆက်လက်တည်ရှိနေပါသည်။ ဘင်္ဂလားပင်လယ်အော်တောင်ပိုင်းတွင် တိမ်ထူထပ်နေပြီး၊ကပ္ပလီပင်လယ်ပြင်တောင်ပိုင်းနှင့် ဘင်္ဂလားပင်လယ်အော်အလယ်ပိုင်းတို့တွင် တိမ်အသင့်အတင့် ဖြစ်ထွန်းနေကာ၊ ကပ္ပလီပင်လယ်ပြင်မြောက်ပိုင်းနှင့် ကျန်ဘင်္ဂလားပင်လယ်အော်တို့တွင် တိမ်အနည်းငယ် ဖြစ်ထွန်းနေပါသည်။

မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။ ရှမ်းပြည်နယ်(တောင်ပိုင်း)တွင် နေရာကျဲကျဲနှင့်စစ်ကိုင်းတိုင်းဒေသကြီးအထက်ပိုင်း၊ မန္တလေးတိုင်းဒေသကြီး၊ ကချင်ပြည်နယ်၊ ရှမ်းပြည်နယ်(မြောက်ပိုင်းနှင့် အရှေ့ပိုင်း)နှင့်ရခိုင်ပြည်နယ်တို့တွင် နေရာကွက်ကျားမိုးထစ်ချုန်းရွာနိုင်ပါသည်။ ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။ ကျန်တိုင်းဒေသကြီးနှင့် ပြည်နယ်တို့တွင် တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မြန်မာ့ပင်လယ်ပြင်။မြစ်ဝကျွန်းပေါ်၊ မုတ္တမကွေ့၊ မွန်-တနင်္သာရီကမ်းရိုးတန်းတစ်လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် တစ်ခါတစ်ရံအရှေ့ဘက်မှလေပြင်းများတိုက်ခတ်ပြီးလှိုင်းအသင့်အတင့်မှ လှိုင်းကြီးနိုင်ပါသည်။ အရှေ့ဘက်မှ လေပြင်းများတိုက်ခတ်စဉ်ရေပြင်/မြေပြင်လေသည် တစ်နာရီလျှင် မိုင်(၃၀)မှ (၃၅)မိုင်အထိတိုက်ခတ်နိုင်ပါသည်။ ကျန်မြန်မာ့ပင်လယ်ပြင်တွင် လှိုင်းအနည်းငယ်မှ လှိုင်းအသင့်အတင့်ရှိမည်။လှိုင်းအမြင့်မှာမြစ်ဝကျွန်းပေါ်၊မုတ္တမကွေ့၊ မွန်-တနင်္သာရီကမ်းရိုးတန်းတစ်လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင်(၇)ပေမှ (၉)ပေခန့်နှင့် ရခိုင်ကမ်းရိုးတန်းတစ်​လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် (၄)ပေမှ (၆)ပေခန့် ရှိနိုင်ပါသည်။

နောက်(၂)ရက်အတွက်ခန့်မှန်းချက်။ စစ်ကိုင်းတိုင်းဒေသကြီး၊ မန္တလေးတိုင်းဒေသကြီး၊ မကွေးတိုင်းဒေသကြီး၊ ရှမ်းပြည်နယ်နှင့် ချင်းပြည်နယ်တို့တွင် ညအပူချိန်များအနည်းငယ် လျော့နည်းနိုင်ပါသည်။

နေပြည်တော်နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။တိမ်အသင့်အတင့်ဖြစ်ထွန်းမည်။

ရန်ကုန်မြို့နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။       တိမ်အသင့်အတင့်ဖြစ်ထွန်းမည်။

မန္တလေးမြို့နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်မွန်းတည့်ချိန်အထိခန့်မှန်းချက်။တိမ်အသင့်အတင့်ဖြစ်ထွန်းမည်။
      """,
      imageURL: "assets/weather/w5.png",
      postTime: DateTime(2022, 12, 20),
      reacts: 181,
      views: 263,
      comments: _comments,
    ),
    PostModel(
      id: "2",
      author: users[0],
      title: "မိုးလေဝသ",
  summary: """17.12.2022 9:30 AM """,
  body: """ ယနေ့နံနက်(၀၉:၃၀)နာရီအချိန်ထိမိုးလေဝသတိုင်းထွာချက်အကျဉ်းချုပ်။
      လွန်ခဲ့သော(၂၄)နာရီအတွင်းက တစ်ပြည်လုံးတွင်တိမ်အသင့်အတင့် ဖြစ်ထွန်းခဲ့ပါသည်။ ညအပူချိန်များမှာချင်းပြည်နယ်တွင် ဒီဇင်ဘာလ၏ ပျမ်းမျှအပူချိန်အောက် (၃)ဒီဂရီစင်တီဂရိတ်နှင့် ရန်ကုန်တိုင်းဒေသကြီးတွင် ဒီဇင်ဘာလ၏ပျမ်းမျှအပူချိန်အောက် (၂)ဒီဂရီစင်တီဂရိတ်လျော့နည်းခဲ့ပြီး၊ စစ်ကိုင်းတိုင်းဒေသကြီးအောက်ပိုင်း၊ ဧရာဝတီတိုင်းဒေသကြီးနှင့် ရှမ်းပြည်နယ်(မြောက်ပိုင်းနှင့် အရှေ့ပိုင်း)တို့တွင် ဒီဇင်ဘာလ၏ပျမ်းမျှအပူချိန်တို့ထက် (၂)ဒီဂရီစင်တီဂရိတ်၊ မန္တလေးတိုင်းဒေသကြီးနှင့် ရှမ်းပြည်နယ်(တောင်ပိုင်း)တို့တွင် ဒီဇင်ဘာလ၏ပျမ်းမျှအပူချိန်တို့ထက် (၃)ဒီဂရီစင်တီဂရိတ်မှ (၄)ဒီဂရီစင်တီဂရိတ်အထိနှင့် နေပြည်တော်တွင်ဒီဇင်ဘာလ၏ပျမ်းမျှအပူချိန်ထက် (၅)ဒီဂရီစင်တီဂရိတ်ပိုခဲ့ကာ၊ကျန်တိုင်းဒေသကြီးနှင့် ပြည်နယ်တို့တွင် ဒီဇင်ဘာလ၏ပျမ်းမျှအပူချိန်ခန့်သာရှိခဲ့ပါသည်။ ထူးခြားသည့် ညအပူချိန်များမှာဟားခါးမြို့တွင် (-၄)ဒီဂရီစင်တီဂရိတ်၊ တီးတိန်မြို့တွင် (၃)ဒီဂရီစင်တီဂရိတ်နှင့် ပူတာအိုမြို့၊ နမ့်စန်မြို့၊ ဖလမ်းမြို့၊ တွန်းဇံမြို့နှင့် ဟုမ္မလင်းမြို့တို့တွင် (၈)ဒီဂရီစင်တီဂရိတ်စီတို့ ဖြစ်ကြပါသည်။

ဘင်္ဂလားပင်လယ်အော်အ‌ခြေအနေ။ယနေ့မြန်မာစံတော်ချိန် (၁၃:၃၀)နာရီအချိန် တိုင်းထွာချက်များအရဘင်္ဂလားပင်လယ်အော်အရှေ့တောင်ပိုင်းနှင့် ယင်းနှင့်ဆက်စပ်လျက်ရှိသောအီကွေတာအနီးအိန္ဒိယသမုဒ္ဒရာအရှေ့ပိုင်းတို့တွင် ဖြစ်ပေါ်နေသောလေဖိအားနည်းရပ်ဝန်း(Low Pressure Area)သည် ဆက်လက် တည်ရှိနေပါသည်။ အဆိုပါ လေဖိအားနည်းရပ်ဝန်း(Low Pressure Area)သည် နောက်(၄၈)နာရီအတွင်းအနောက်ဘက်သို့ ဖြည်းညင်းစွာရွေ့လျားနိုင်ပြီးဘင်္ဂလားပင်လယ်အော်တောင်ပိုင်းသို့ ရောက်ရှိနိုင်သည်ဟုခန့်မှန်းရပါသည်။ ဘင်္ဂလားပင်လယ်အော်တောင်ပိုင်းတွင် တိမ်ထူထပ်နေပြီး၊ ကပ္ပလီပင်လယ်ပြင်နှင့် ကျန်ဘင်္ဂလားပင်လယ်အော်တို့တွင် တိမ်အနည်းငယ်မှ တိမ်အသင့်အတင့် ဖြစ်ထွန်းနေပါသည်။

မနက်ဖြန်နံနက်အထိခန့်မှန်းချက်။ မန္တလေးတိုင်းဒေသကြီး၊ ကချင်ပြည်နယ်နှင့် ရှမ်းပြည်နယ်တို့တွင် နေရာကွက်ကျားမိုးအနည်းငယ် ထစ်ချုန်းရွာနိုင်ပါသည်။ ရွာရန်ရာနှုန်း(၆၀) ဖြစ်ပါသည်။ ချင်းပြည်နယ်၊ ရခိုင်ပြည်နယ်နှင့် ကရင်ပြည်နယ်တို့တွင် အများအားဖြင့် သာယာပြီး၊ ကျန်တိုင်းဒေသကြီးနှင့် ပြည်နယ်တို့တွင်တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မြန်မာ့ပင်လယ်ပြင်။မြစ်ဝကျွန်းပေါ်၊ မုတ္တမကွေ့၊ မွန်-တနင်္သာရီကမ်းရိုးတန်းတစ်လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင်တစ်ခါတစ်ရံအရှေ့ဘက်မှလေပြင်းများတိုက်ခတ်ပြီးလှိုင်းကြီးနိုင်ပါသည်။အရှေ့ဘက်မှ လေပြင်းများတိုက်ခတ်စဉ်ရေပြင်/မြေပြင်လေသည် တစ်နာရီလျှင်  (၃၅)မိုင်မှ မိုင်(၄၀)အထိတိုက်ခတ် နိုင်ပါသည်။ ကျန်မြန်မာ့ပင်လယ်ပြင်တွင် လှိုင်းအသင့်အတင့်ရှိမည်။ လှိုင်းအမြင့်မှာမြစ်ဝကျွန်းပေါ်၊ မုတ္တမကွေ့၊ မွန်-တနင်္သာရီကမ်းရိုးတန်းတစ်လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် (၈)ပေမှ (၁၀)ပေခန့်နှင့် ရခိုင်ကမ်းရိုးတန်းတစ်​လျှောက်နှင့် ကမ်းလွန်ပင်လယ်ပြင်တို့တွင် (၄)ပေမှ (၇)ပေခန့်ရှိနိုင်ပါသည်။

နောက်(၂)ရက်အတွက်ခန့်မှန်းချက်။ ပဲခူးတိုင်းဒေသကြီး၊ရန်ကုန်တိုင်းဒေသကြီး၊ ဧရာဝတီတိုင်းဒေသကြီး၊ တနင်္သာရီတိုင်းဒေသကြီး၊ ရှမ်းပြည်နယ်၊ ကယားပြည်နယ်၊ ကရင်ပြည်နယ်နှင့် မွန်ပြည်နယ်တို့တွင် ညအပူချိန်များလျော့နည်းနိုင်ပါသည်။

နေပြည်တော်နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်နံနက်အထိခန့်မှန်းချက်။                  
တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

ရန်ကုန်မြို့နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်နံနက်အထိခန့်မှန်းချက်။                      
တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။

မန္တလေးမြို့နှင့်အနီးတစ်ဝိုက်အတွက်မနက်ဖြန်နံနက်အထိခန့်မှန်းချက်။     
တိမ်အသင့်အတင့် ဖြစ်ထွန်းမည်။
""",
      imageURL: "assets/weather/w5.png",
      postTime: DateTime(2022, 12, 17),
      reacts: 170,
      views: 289,
      comments: _comments,
    ),


  ];

}

