import 'package:flutter/material.dart';

import 'cal_unit_converter.dart';

void main() => runApp(MyApp());


class MyApp extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
        debugShowCheckedModeBanner: false,
        title: 'Unit Converter',
        theme: ThemeData(
          primarySwatch: Colors.blue,
        ),
        home: Scaffold(
          appBar: AppBar(
            centerTitle: true,
            title: Text(
              'အကွာအဝေး တွက်ချက်ရန်',
            ),
            leading: IconButton(
              onPressed: () {
                Navigator.push(context, MaterialPageRoute(builder: (context) {
                  return  MyHomePage2(title: 'တွက်ချက်ရန်',);
                }));


              },
              icon: Icon(Icons.arrow_back_ios_new),
            ),
          ),
          body: HomeScreen(),
        ));
  }
}

class HomeScreen  extends StatefulWidget{
  @override
  _HomeScreenState createState() => _HomeScreenState();
}

class _HomeScreenState extends State<HomeScreen> {
  final TextStyle labelStyle = TextStyle(
    fontSize: 25.0,
  );
  final TextStyle resultStyle = TextStyle(
    color: Colors.teal,
    fontSize: 15.0,
    fontWeight: FontWeight.w600,
  );
  final List<String> measures = [
    'ဆံခြည်',
    'နှမ်း',
    'မုယော',
    'လက်သစ်',
    'မိုက်',
    'ထွာ',
    'တောင်',
    'လံ',
    'တာ',
    'ဥသဘ',
    'ကောသ',
    'ဂါဝုတ်',
    'ယူဇနာ',
    'မီလီမီတာ',
    'စင်တီမီတာ',
    'မီတာ',
    'ကီလိုမီတာ',
    'လက်မ',
    'ပေ',
    'ကိုက်',
    'မိုင်'
  ];
  late double _value;
  String _fromMeasures = 'ကီလိုမီတာ';
  String _toMeasures = 'မိုင်';
  String _results = "";

  final Map<String, int> _measuresMap = {
    'ဆံခြည်': 0,
    'နှမ်း': 1,
    'မုယော': 2,
    'လက်သစ်': 3,
    'မိုက်': 4,
    'ထွာ': 5,
    'တောင်': 6,
    'လံ': 7,
    'တာ': 8,
    'ဥသဘ': 9,
    'ကောသ': 10,
    'ဂါဝုတ်': 11,
    'ယူဇနာ': 12,
    'မီလီမီတာ': 13,
    'စင်တီမီတာ':14,
    'မီတာ': 15,
    'ကီလိုမီတာ': 16,
    'လက်မ': 17,
    'ပေ': 18,
    'ကိုက်': 19,
    'မိုင်': 20,

  };

  dynamic _formulas = {
    '0': [1, 0.1, 0.016666666667, 0.004166666667, 0.000520833333,0.000347222222, 0.0001736111111, 0.000043402778,0.000024801587,0.000001240079,0.00000062004,0.000000015501,0.000000003875,0.079374969738,0.007937500124,0.000079375,0.000000079375,0.003125,0.000260416667,0.000086805556,0.000000049321],
    '1': [10, 1, 0.16666666667, 0.04166666667, 0.00520833333, 0.00347222222, 0.001736111111, 0.00043402778,0.00024801587,0.00001240079,0.0000062004,0.00000015501,0.00000003875,0.79374969738,0.07937500124,0.00079375,0.00000079375,0.03125,0.00260416667,0.00086805556,0.00000049321],
    '2': [0.01666666667, 0.1666666667, 1, 0.25, 0.03125,0.02083333333, 0.01041666667, 0.002604166667,0.001488095238,0.000074404762,0.000003720238,0.00000093006,0.000000232515,47625,0.476249440407,0.00476249440407,0.00000476249440407,0.187501171882,0.015625,0.005208333333,0.000002959282],
    '3': [240, 24, 4, 1, 0.125,0.08333333333, 0.04166666667, 0.01041666667,0.005952380952,0.000297619048,0.000014880952,0.000003720238,0.00000093006,19.05,1.9,0.01904999939,0.00001904999939,0.750019750469,0.0625,0.02083333333,0.00001183712798],
    '4': [1920, 192, 32, 8, 1, 0.666666667, 0.3333333333, 0.08333333333,0.047619047619,0.002380952381,0.00011904761905,0.000029761904762,0.0000744047609048,152.4,15.24,0.1524,0.0001524,6,0.5,0.1666666667,0.000094697023771],
    '5': [2880, 288, 48, 12, 2, 1, 0.5, 0.125,0.07142857143,0.0035714285714,0.0001785714286,0.000044642857,0.00001116071429,228.6,22.86,0.2286001669,0.0002286001669,9,0.750018750469,0.25,0.000142045536],
    '6': [5760, 576, 96, 24, 4, 2, 1, 0.25,0.14285714286,0.0071428571429,0.0003571428571,0.00008928571429,0.00002232142857,457.2,45.72,0.4572,0.0004572,18,1.5,0.2,0.0002840910713],
    '7': [23040, 2304, 384, 96, 12,8, 4, 1,0.5714285714,0.0285714285714,0.00142857142857,0.000357142857142857,0.000892857142857,1828.8,182.88,1.8288,0.0018288,72,6,0.5,0.00113636428203],
    '8': [40320, 4032, 672, 168, 21,14, 7, 1.75,1,0.05,0.0025,0.000625,0.00015625,3200.4,320.04,3.2004,0.0032004,126,10.5,3.5,0.001988637482245],
    '9': [806400, 80640, 13440, 3360, 420,280, 140, 35,20,1,0.05,0.00125,0.003125,64008,6400.8,64.008,0.064008,2520,210,70,0.03977275439],
    '10': [16128000, 1612800, 268800, 67200, 8400,5600, 2800, 700,400,20,1,0.25,0.0625,1280160,128016,1280.16,1.28016,50400.05,4200,1400,0.7954563533],
    '11': [64512000, 6451200, 1075200, 268800, 33600,22400, 11200, 2800,1600,80,4,1,0.25,5120640,512064,5120.64,5.12064,201600.2,16800.01,5600,3.18182],
    '12': [258048000, 25804800, 4300800, 1075200, 134400,89600, 44800, 11200,6400,320,16,4,1,20482600,2048260,20482.6,20.4826,806402.05,67200.14,22400.05,12.7273],
    '13': [12.59843, 1.25984, 4.7625, 0.05249343832, 0.00656167979,0.0043744531934, 0.0021872265966, 0.00054680664923,0.00031246094238,0.00001562304712,0.00000781152356,0.000000195288089,0.0000000488219269,1,0.1,0.001,0.000001,0.039370079,0.0032808399,0.001093613298,0.0000006213715473],
    '14': [125.9843, 12.5984, 2.09974, 0.5249343832, 0.0656167979,0.043744531934, 0.0218722659667, 0.0054680664923,0.003124609424,0.0001562304712,0.00000781152356,0.00000195288089,0.000000488219269,10,1,0.01,0.00001,0.39370079,0.032808399,0.01093613298,0.00006213715473],
    '15': [12598.43,1259.84, 209.974, 52.49343832, 6.56167979,4.3744531934, 2.18722659667, 0.54680664923,0.3124609424,0.01562304712,0.000781152356,0.000195288089,0.0000488219269,1000,100,1,0.001,39.370079,3.2808399,1.093613298,0.006213715473],
    '16': [12598425.2, 1259842.52, 209973.75, 52493.44, 6561.68,4374.45, 2187.23, 546.81,312.46,15.62,0.78,0.2,0.05,1000000,100000,1000,1,39370.12,3280.84,1093.61,0.62],
    '17': [320, 32, 5.333333333, 1.333333333, 0.166666667,0.111111111, 0.05555552469, 0.013888883102,0.007936504787,0.0003968252378,0.00001984125057,0.000004960312642,0.000001240076212,25.4,2.54,0.0254,0.0000254,1,0.0833333333,0.02777777778,0.00001578282197],
    '18': [3840, 384, 64, 16, 2,1.333333333, 0.666666667, 0.166666667,0.09523809524,0.004761904762,0.000238095102,0.00005952377551,0.00001488092049,304.8,30.48,0.3048,0.0003048,12,1,0.333333333,0.0001893939394],
    '19': [11520, 1152, 192, 48, 6,4, 2, 0.5,0.2857142857,0.014285714,0.0007142853061,0.0001785713265,0.00004464276148,914.4,91.44,0.9144,0.0009144,36,3,1,0.0005681818182],
    '20': [20275188.41, 2027518.84, 337919.81, 84479.95,10559.99 ,7040, 3520, 880,502.86,25.14284,1.257148,0.3142855347,0.0785712602,1609343.08,160934.31,1609.3431,1.60934,63360.03,5280,1760,1],

  };


  @override
  Widget build(BuildContext context) {
    return SingleChildScrollView(
      child: Padding(
        padding: const EdgeInsets.all(40.0),
        child: Column(
          children: [
            TextField(
              decoration: InputDecoration(
                labelText: 'တန်ဖိုး ရိုက်ထည့်ရန်',
              ),

              onChanged: (value) {
                setState(() {
                  _value = double.parse(value);
                });
              },

            ),
            SizedBox(height: 60.0),
            Column(
              mainAxisAlignment: MainAxisAlignment.start,
              children: [
                Row(
                  crossAxisAlignment: CrossAxisAlignment.start,
                  children: [
                    Text(
                      'From',
                      style: labelStyle,
                    ),
                    SizedBox(width: 60.0),
                    DropdownButton(
                      items: measures.map((String value) => DropdownMenuItem<String>(
                        child: Text(value),
                        value: value,
                      ))
                          .toList(),
                      onChanged: (value) {
                        setState(() {
                          _fromMeasures = value!;
                        });
                      },
                      value: _fromMeasures,
                    )
                  ],
                ),
                SizedBox(height: 60.0),
                Row(
                  crossAxisAlignment: CrossAxisAlignment.start,
                  children: [
                    Text( 'To',
                        style: labelStyle),
                    SizedBox(width: 90.0),
                    DropdownButton(
                      items: measures.map((String value) => DropdownMenuItem<String>(
                        child: Text(value),
                        value: value,
                      ))
                          .toList(),
                      onChanged: (value) {
                        setState(() {
                          _toMeasures = value!;
                        });
                      },
                      value: _toMeasures,
                    )
                  ],
                ),
              ],
            ),
            SizedBox(height: 80.0),
            MaterialButton(
              minWidth: double.infinity,
              onPressed: _convert,
              child: Text(
                'ပြောင်းရန် နှိပ်ပါ',
                style: TextStyle(color: Colors.white),
              ),
              color: Theme
                  .of(context)
                  .primaryColor,
            ),
            SizedBox(height: 80.0),
            Text(
              _results,
              style: resultStyle,
              textAlign: TextAlign.center,
            ),

          ],
        ),
      ),
    );
  }

  void _convert() {
    print("Clicked");
    print(_value);
    if (_value != 0 && _fromMeasures.isNotEmpty && _toMeasures.isNotEmpty) {
      int? from = _measuresMap[_fromMeasures];
      int? to = _measuresMap[_toMeasures];

      var multiplier = _formulas[from.toString()][to];

      setState(() {
        _results  = "$_value $_fromMeasures  =  ${(_value)*(multiplier)} $_toMeasures";
      });
    }else {
      setState(() {
        _results = " Please enter a non zero value";
      });
    }
  }
}