import 'dart:ui';

class Item {

  String title;
  String description;
  Color color;
  String imageUrl;


  Item(this.title, this.description, this.color, this.imageUrl);

}

List<Item> getGridItems(){
  return <Item>[
    Item(
      'စပါးဆစ်ပိုး           ',
  '''စပါးရွက်အောက်မျက်နှာပြင် ရွက်ဖုံးပေါ်နှင့် ရွက်ဖုံးကြားအစုလိုက် ဥဥလေ့ရှိသည်။

ပိုးလောက်ကောင်ဘဝ ပင်စည်အတွင်း ဝင်ရောက်ဖျက်ဆီးသည်။ 

အပင်ငယ်စဉ် ကျပါက ပင်စည်အူပုပ်ခြင်းနှင့် ခေါင်ညွန့်သေ လက္ခဏာများကို တွေ့ရမည်။

စပါးနှံထွက်ချိန် ကျပါက ထောင်မတ်နေသော အဖြူရောင်စပါးနှံများ ခွေကျသွားသည်ကို တွေ့ရမည်။

အသုံးပြုရမည့်ဆေး- ဗိုက်တာဖျူရမ်၊ ဗိုက်တာဂရို၊ ဘီနီဖစ်၊ဗိုက်တာရှီး။
'''
  ,
      Color(0xFFFCE4EC),
      'assets/dodont/t1.png',
    ),
    Item(
      'စပါးကြက်သွန်မြိတ်ပိုး',
     '''စပါးရွက်အောက်မျက်နှာပြင်၊ ရွက်ဖုံးပေါ်နှင့် ရွက်ဖုံးကြားအစုလိုက် ဥဥလေ့ရှိသည်။

ပိုးလောက်ကောင်ဘဝ ပင်စည်အတွင်း ဝင်ရောက်ဖျက်ဆီးသည်။

အပင်ငယ်စဉ်ကျပါက ပင်စည်အူပုပ်ခြင်းနှင့် ခေါင်ညွန့်သေ လက္ခဏာများကို တွေ့ရမည်။

စပါးနှံထွက်ချိန်ကျပါက ထောင်မတ်နေသော အဖြူရောင်စပါးနှံခြောက်များကို တွေ့ရမည်။

အသုံးပြုရမည့်ဆေး- ဂိမ်း၊ ဗိုက်တာဘရာ၊ ကွန်ဖီးဒင့်၊ စတား။
''',
      Color(0xFFFF80AB),
      'assets/dodont/t2.png',
    ),
    Item(
      'ငမြှောင်တောင်ပိုး',
      '''အကောင်ငယ်စဉ် အရွက်၏ အစိမ်းရောင်အသားကိုခြစ်စားသဖြင့် အဖြူရောင်ကွက်များ တွေ့ ရမည်။

အကောင်ကြီးဘဝ-ညနေပိုင်းနှင့် မနက်အစောပိုင်းတွင် အရွက်များ၊ အနှံများကို ကိုက်ဖြတ်စားသည်။

အစုလိုက် အပြုံလိုက် ဆိုးရွားစွာ ကျရောက်လေ့ရှိသည်။

အသုံးပြုရမည့်ဆေး- အယ်လ်ဖာ၊ ဗေးလစ်၊ ဗိုက်တာမီသရင်၊ ဗိုက်တာရှီး၊ကွန်ဒီးဒင့်။
''',
      Color(0xFFE57373),
      'assets/dodont/t3.png',
    ),
    Item(
      'စပါးရွက်လိပ်အိမ်ပိုး',
      '''စပါးပင်ငယ်စဉ် ပိုမိုကျရောက်သည်။

မိုးစပါးနှင့် ရေကြီးနစ်မြှုပ်သောနေရာများတွင်ကျရောက်လေ့ရှိသည်။

စပါးရွက်များကို အလျားလိုက်အလိပ်ပြုလုပ်ပြီး အတွင်းမှ နေ၍ အရွက်အောက်မျက်နှာပြင်ကို ခြစ်စားသည်။

စိုက်ခင်းအတွင်း ရွက်လိပ်ရွက်ပြတ်များကို တွေ့ နိုင်သည်။

အသုံးပြုရမည့်ဆေး- ဗိုက်တာရှီး၊ ပရီဆိုက်၊ ဆလက်ပလပ်၊ ကွန်ဖီးဒင့်၊ အော်တီမာ။
''',
      Color(0xFFFFD180),
      'assets/dodont/t4.png',
    ),
    Item(
      'စပါးပိုးလောင်မီး',
      ''''အကောင်ငယ်ဘဝ အရွက်ကို ထွင်း၍ဖျက်ဆီးခြင်းကြောင့် အရွက်များမီးလောင်ထားသကဲ့သို့ ခြောက်နေတတ်သည်။

အကောင်ကြီးဘဝ အပင်အစိတ်အပိုင်းအားလုံးကို ဖျက်ဆီးသည်။

ပိုးကျရောက်မှုများပါက အပင်ခြောက်၍သေနိုင်သည်။

အသုံးပြုရမည့်ဆေး- ဗိုက်တာမီသရင်၊ ဗိုက်တာရှီး၊ ဗေးလစ်၊ ဗိုက်တာဘရာ၊ ဆလက်ပလပ်။
''',
      Color(0xFFFFAB91),
      'assets/dodont/t5.png',
    ),
    Item(
      'စပါးဖြုတ်ပိုး ',
      '''အပင်ရည်ကို စုပ်စားသဖြင့် အရွက်များညိုပြီး ခြောက်သွားသည်။

အပင်ကြီးထွားမှုအားနည်းကာ ဗိုင်းရပ်ရောဂါများကို ကူးစက်စေသည်။

အပင်ငယ်စဉ် ဖြုတ်စိမ်း ကျတတ်ပြီး ဖြုတ်ညိုသည် အပင်သက်တမ်းရင့်မှ ကျသည်။

အသုံးပြုရမည့်ဆေး- ဗိုက်တာဂရို၊ မာလာနွန်၊ ကွန်ဖီးဒင့်။
''',
      Color(0xFFEEFF41),
        'assets/dodont/t6.png'
    ),
    Item(
      'ဖောင်စီးဂဏန်း',
      '''ဇူလိုင်လလယ်လောက်တွင် မြန်မာနိုင်ငံအောက်ပိုင်းဒေသများ၊ ဒီရေ၀င်သော လယ်ကွင်းများတွင်တွေ့ ရတတ်သည်။

ပင်လယ်ဒီရေနှင့်အတူပါလာသော ဂဏန်းများသည် အစုလိုက်ဥဥပြီး အကောင်ပေါက်များသည်စပါးပင်ငယ်များနှင့် ပျိုးပင်ပင်စည်းများကို ကိုက်ဖြတ် ပျက်ဆီးသဖြင့် စပါးအထွက်နှုန်းကိုကျဆင်းစေသည်။

အသုံးပြုရမည့်ဆေး- ဗိုက်တာရှိး၊ ဗိုက်တာဘရာ။
''',
      Color(0xFFEEFF41),
        'assets/dodont/t8.png'
    ),
    Item(
      'စပါးနှံစုပ်ပိုး ',
     '''စပါးနှံမပေါ်ခင် အရွက်နုများကို စုပ်စားဖျက်ဆီးသည်။

စပါးနှံစေ့ပေါ်တွင် ညိုနက်ရောင် အစက်များတွေ့ ရမည်။

အသုံးပြုရမည့်ဆေး- ဂိမ်းဗိုက်တာဂရှိ၊ ဗိုက်တိုအိတ်၊ ဗိုက်စန်၊ ဆလက်ပလပ်၊ ကွန်ဖီးဒင့်။
''',
      Color(0xFFFFD180),
        'assets/dodont/t9.png'
    ),
    Item(
      'စပါးလောင်မီးရောဂါ',
      '''နီမတုတ်ကြောင့်ဖြစ်သည်။

အရွက်အခြေတွင် အဖြူရောင်အစက်များ၊ အစင်းများအကွက်များနှင့် စတင်ပြီးနောက် အညိုရောင်/ညိုမဲရောင်သို့ပြောင်းသွားသည်။

အရွက်များတွန် လိမ်ကောက်ကွေးခြင်း၊ရွက်ဖုံးများပုံမမှန်ခြင်း၊ ပင်ခြေအဆစ်များဖောင်းကားပြီးပုံမမှန်သောပင်ပွားထွက်ခြင်းများကို တွေ့ ရသည်။

အနှံများမအောင်ဘဲ တရင်းလုံးမီးလောင်ကျွမ်းသကဲ့သို့ ခြောက်သွေ့ သွားသည်။

အသုံးပြုရမည့်ဆေး- ဗိုက်တာဖျူရမ်၊ ဘီနီဖစ်။
''',
      Color(0xFFFFE082),
        'assets/dodont/t10.png'
    ),
    Item(
      'စပါးရွက်ဖျားဖြူရောဂါ',
      '''မျိုးစေ့ဆောင် နီမတုတ်ရောဂါဖြစ်သည်။

အရွက်၏ထိပ်ဖျား(၃-၅ စင်တီမီတာ)ခန့် ဖြူပြီး လိမ်ကောက်ခြောက်သွေ့ နေသော်လည်း ကျန်အစိတ်အပိုင်းများမှာ ပုံမှန်အစိမ်းရောင်အတိုင်းရှိသည်။

အလံရွက် ရှုံ့တွ၍ အနှံများမထွက်နိုင်ဖြစ်တတ်သည်။

အနှံထွက်ပါကလည်း အစေ့အဆန်မတည်သည်ကို တွေ့ရမည်။

အသုံးပြုရမည့်ဆေး-ဗိုက်တာဖျူရမ်။ ဘီနီဖစ်၊ ဗိုက်တာမိုင်း။ အင်ဗွိုင်း။
''',
        Color(0xFFE57373),
        'assets/dodont/t11.png'
        ),
    Item(
    'စပါးမြစ်ဖုရောဂါ',
      '''စပါးမြစ်ဖုရောဂါသည် နီမတုတ်ကြောင့်ဖြစ်သည်။

ရောဂါကျရောက်လျှင် စပါးပင်၏ အမြစ်များတွင် အဖုအလုံးများဖြစ်ပေါ်သည်။

အရွက်များဝါခြင်း၊ ပင်ပွားအထွက်နည်းခြင်း၊အရပ်ပုခြင်းနှင့် အနှံမအောင်ခြင်းများကို တွေ့ ရမည်။

အသုံးပြုရမည့်ဆေး-ဗိုက်တာဖျူရမ်။ ဘီနီဖစ်။
''',
        Color(0xFFC5E1A5),
        'assets/dodont/t12.png'
    ),
    Item(
    'စပါးဂုတ်ကျိုးရောဂါ',
        '''နွေစပါးတွင် ပိုမိုကျရောက်သည်။

    စပါးရွက်ပေါ်၌အလယ်တွင်မီးခိုရောင်နှင့်လွန်းပုံသဏ္ဍာန်အကွက် ဖြစ်ပေါ်သည်။

    ရောဂါကွက်တစ်ခုနဲ့တစ်ခုဆက် သွားပါက စပါးရွက်ခြောက်သွားသည်။

    အနှံတွင်ရောဂါကျပါက ဂုတ်တွင် အညိုရောင်ကွက်များဖြစ်ပေါ်ပြီး ကျိုးကျတတ်သည်။

    နို့ရည်မတည်ခင်ရောဂါကျပါက နို့ရည်ဆက်မတည်ဘဲရှိသည်။

    အသုံးပြုရမည့်ဆေး- အဂရီးသိမ်း၊ ဗိုက်တာမိုင်း၊ ခရူဇာ၊ စကုပ်၊ အင်ဗွိုင်း။''',
        Color(0xFFFFFF8D),
        'assets/dodont/t13.png'
        ),
    Item(
    'စပါးပင်ခြေပုပ်ရောဂါ',
        '''စပါးပင်ခြေပုပ်ရောဂါသည် ပင်ပွားအများဆုံးထွက်ချိန်တွင်တွေ့ရသည်။

    ရောဂါလက္ခဏာမှာ အရွက်များအဝါရောင်ပြောင်းခြင်းနှင့် ပင်ပွားများ အညိုရင့်ရောင်ပုပ်ဆွေးသွားခြင်းဖြစ်သည်။

    ရောဂါသည် ရွက်လျှာမှ စတင်ပြီးနောက် ရွက်ပြား၊ အဆစ်များပင်စည်အူတိုင်များ၊ ပင်စည်အခြေပိုင်းနှင့် အမြစ်များ ထိ ကူးစက်ပျံ့နှံ့ပြီးအမဲ ရောင်ပုပ်ဆွေးသွား၍ ပင်ပွားများမှာ အလွယ်တကူဆွဲနုတ်ယူနိုင်သည်။

    ဆိုးရွားသောအနံ့ ရှိသည်။

    အသုံးပြုရမည့်ဆေး- အောက်ဆီ။''',
        Color(0xFFE6EE9C),
        'assets/dodont/t14.png'
    ),
    Item('ရွက်ဖုံးခြောက်ရောဂါ',
    '''ရေမျက်နှာပြင် အထက်ရှိ ရွက်ဖုံးများတွင် ညိုနက်ရောင်အနားသတ်ရှိ မီးခိုရောင်အနာကွက်ဖြစ်ပေါ်သည်။

အနာကွက်ပေါ်တွင် အဖြူ/မည်း မှိုလုံးများကိုတွေ့ရကာ ရွက်ဖုံးတစ်ခုလုံးခြောက်သွားမည်။

အရွက်နှင့်ပင်စည်ကိုကူးကာ အစေ့အဆံအဖျင်းများဖြစ်စေသည်။

အသုံးပြုရမည့်ဆေး- အဂရီးသိမ်း၊ အဂရီးမီးလ်၊ ဗိုက်တာမိုင်း၊ အင်ဗွိုင်း၊ အင်နာဂျီ၊ ဂရေ့စ်။
''',
        Color(0xFFEEFF41),
        'assets/dodont/t15.png'
    ),
    Item(
      'စပါးရွက်ညိုပျောက်ရောဂါ',
       '''အရွက်နှင့်အစေ့ခွံပေါ်တွင် နှမ်းစေ့အရွယ် အညိုရောင်အစက်အပြောက်များတွေ့ ရသည်။

    အစက်တစ်ခုနှင့်တစ်ခုဆက်သွားပြီး အညိုရောင်အနားရစ်နှင့် မီးခိုရောင်ဗဟိုရှိသော အကွက်များဖြစ်လာပြီး အရွက် များခြောက်သေသွားသည်။

    အနှံခက်၏ အဆစ်များကြားတွင်ဖြစ်ပါက အစေ့အဆန်တည်မှု နည်းသည်။

    စပါးစေ့တွန့်လိမ်၍ အရောင်ပျက်စေသည်။

    အသုံးပြုရမည့်ဆေး-ဗိုက်တာမိုင်း၊ အင်ဗွိုင်း၊ ဂရေ့စ်။''',
        Color(0xFFC5E1A5),
        'assets/dodont/t17.png'
    ),
    Item('ဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ',
    '''စပါးပင်သက်တမ်းတစ်လျှောက် ရောဂါဝင်ရောက်နိုင်သည်။

ရောဂါလက္ခဏာသည် စပါးပင် အောက်ရွက်ဖျား/ရွက်နားများတွင် ရေစိုနာကွက်များနှင့် စတင်သည်။ ၎င်းနောက် ကာက်ရိုးခြောက်ရောင် မှ အဖြူရောင်သို့ပြောင်းသွားသည်။

ရောဂါကွက်နားများမှာ မညီမညာ လှိုင်းတွန် ပုံရှိနေတတ်သည်။ ပျိုးခင်းအဆင့်တွင် ရောဂါကျပါက အပင်ညှိုး၍ သေစေသည်။

နံနက်စောစော နှင်းကျပြီး ရောဂါရအပိုင်းမှ ဘတ်တီးရီးယား စိမ့်ထွက်ရည်များထွက်၍ နေ့ခင်းပိုင်းတွင် ပယင်းရောင် အလုံးကလေးများအဖြစ်မြင်ရသည်။

အသုံးပြုရမည့်ဆေး- အောက်စီး။
''',
        Color(0xFFB2FF59),
        'assets/dodont/t18.png'
    ),
    Item(
      'ဂျုံတွင် ဖြစ်ပွားတတ်သော ရောဂါများ',
      '''ဂျုံများတွင် အဓိကဖြစ်ပွားသောရောဂါ (၂) မျိုးမှာ နနွင်းရောဂါနှင့် ဂျုံလောင်မီးရောဂါတို့ဖြစ်ကြသည်။

မှိုကြောင့်ဖြစ်သောရောဂါဖြစ်သည်။ ဂျုံပင်၏ပင်စည်၊ အရွက်အစိတ်အပိုင်းကို ဝင်ရောက်စားသောက်ကြသည်။

ထိုအခါအရွက်များ၊ အပင်များပေါ်တွင် အဝါစက်၊ အဝါပြောက်ကျားဖြစ်နေသည်။ 
နနွင်းရောဂါဖြစ်ပွားပါက အသီးညံ့ဖျင်း၍ မအောင်မြင်ခြင်း၊ အထွက်နည်းခြင်းများ ဖြစ်တတ်ပြီး ဆိုးရွားစွာကျရောက်ပါက မျိုးပြန်မရသည်အထိအခြေအနေဆိုးနိုင်သည်။

ကာကွယ်ရန်မှာ ရောဂါဒဏ်ခံနိုင်သောမျိုးကို စိုက်ပျိုးရမည်။ဂျုံလောင်မီးရောဂါသည် ဂျုံစေ့ဖြစ်မည့်နေရာတွင် မည်းနက်သောမှိုစေ့အခဲများဖြစ်ပေါ်လာပြီး ဆိုးရွားစွာဖြစ်ပေါ်ပါက 
ဂျုံစေ့လုံးဝပြန်မရတော့ပေ။

ကာကွယ်ရန်မှာ ရောဂါဒဏ်ခံနိုင်သောမျိုးကို ရွေးစိုက်ရမည်။

ဂျုံလောင်မီးရောဂါသည် ဂျုံနီများတွင် ပိုမိုကျရောက်ပြီး ဂျုံဖြူများတွင်ကျရောက်မှုမရှိသလောက်ပင်ဖြစ်သည်။ 
ဂျုံသီးနှံများကို ဖျက်ဆီးတတ်သောပိုးမွှားများမှာ ဖြုတ်စိမ်း၊ ငမြှောင်တောင်ပိုင်းနှင့် ခြများ ဖြစ်ကြသည်။ဖြုတ်စိမ်းပိုးသည် အရွက်များ၊
 အနှံများတွင် တွယ်ကပ်၍ အရည်ကိုစုပ်ယူတတ်ကြသည်။ အထူးသဖြင့် မိုးအုံ့ပျပျတွင် ပို၍ကျရောက်ဖျက်ဆီးတတ်သည်။ 
 ကာကွယ်ရန်မှာ အင်ဒရင်းဆေးရည် (၁၉.၅%) ကို ဆေးနှင့်ရေအချိုး ဆေး (၁) ဆ ရေ (၇၅၀) ဆ ကို ပက်ဖျန်းနှိမ်နင်းနိုင်သည်။

ငမြှောင်တောင်ပိုးမှာ အောက်တိုဘာ၊ နိုဝင်ဘာလအတွင်းကျသည်။ ဂျုံပင်များကို အောက်ခြေမှနေ၍ ဖြတ်တောက်ဖျက်ဆီးတတ်သည်။ 
ကာကွယ်ရန်မှာ ဂျုံမစိုက်မီ ဂျုံစေ့တစ်တင်းလျှင် (၂.၅%)အော်ဒရင်းဆေးမှုန့်တစ်ပေါင်ရော၍ နယ်ပြီးစိုက်ရမည်။ အော်ဒရင်အစား (၅%) ဒီဒီတီဆေးမှုန့်ကိုလည်း အသုံးပြုနိုင်သည်။

ခြများ၏ရန်မှ ကာကွယ်ရန်မစိုက်ပျိုးမီမြေကို (၂.၅%) အော်ဒရင်းဆေးမှုန့်တစ်ဧကလျှင် ပေါင်(၄၀)နှုန်းချ၍ ထွန်မွှေပေးရမည်။ ထိုသို့ထွန်မွှေပြီးမှသာ မျိုးစေ့ချစိုက်ရမည်။


''',
        Color(0xFFA5D6A7),
        'assets/dodont/g1.png'
    ),
    Item(
      'မတ်ပဲတွင်ဖြစ်ပွားတတ်သောရောဂါများ',
      '''ပင်ညှိုးရောဂါကျရောက်ပါကသိသာထင်ရှားစေသောလက္ခဏာများမှာ အပင်ပုခြင်း၊ အရွက်များ အဝါရောင်ပြောင်းကာ ညှိုးခြင်းနှင့် အပင်အား အမြစ်ပါအောင်ဆွဲနှုတ်ကြည့်ပါက မတ်ပဲပင်၏ ရေသောက်မြစ်သည် ပုပ်နေခြင်း သို့ အညိုရောင်ပြောင်းနေခြင်းများ ဖြစ်နေသည်။

၎င်းမှိုစပိုးများအား ပျံ့နှံ့မှုဖြစ်စေသော အရာများမှာ ပင်ကြွင်းပင်ကျန်များ၊ လယ်ယာသုံးပစ္စည်းများ၊ လူ၊ ကျွဲနွားတိရစ္ဆာန်များနှင့် ရေသွင်းရေထုတ်ပြုလုပ်မှုများမှလည်း ပျံ့နှံ့နေကြပါသည်။

ကာကွယ်နှိမ်နင်းခြင်းနည်းလမ်များမှာ - 

မတ်ပဲခင်းတွင် Fusarium ပင်ညှိုးရောဂါကျရောက်ခဲ့ပါက ထိုအခင်းတွင် နောက်၅ နှစ်ကြာသည်အထိ မတ်ပဲ စိုက်ပျိုးခြင်းမှ ရှောင်ကျဉ်ခြင်း။

မတ်ပဲခင်းအား ပေါင်းရှင်းခြင်း၊ ဆေးဖြန်းခြင်းများပြုလုပ်ရာတွင် တစ်ခင်းအား ဆေးဖျန်းပြီးပါက အသုံးပြုပြီသော လယ်ယာသုံးစက်ပစ္စည်းများ၊ လူနှင့် အခြားသောအရာများတွင် ယခင်အခင်း၏ အပင်ကြွင်းကျန်များ ကပ်ငြိပါလာခြင်းအား သေချာစွာဖယ်ရှားပြီးမှ နောက်အခင်းသို့ဝင်ရန်။

မတ်ပဲခင်း၏ ပန်းပွင့်မှုပမာဏ သိပ်သည်းများပြားမှုသည် ရောဂါဖြစ်ပွားမှုအား အားပေးသောကြောင့် ပန်းပွင့်မှုအား လက်ဖြင့်အနည်းငယ်ခူးချွေကာ ထိန်းသိမ်းကာကွယ်ခြင်း။
''',
        Color(0xFFB2DFDB),
        'assets/dodont/g2.jpg'

    ),
    Item(
      'ပဲတီစိမ်းတွင်ကျရောက်တတ်သောမက်ခရိုဖိုမီနာ ရွက်ခြောက်ရောဂါ',

      '''ရောဂါလက္ခဏာများသည် ပင်စည်၏အောက်ခြေတွင် ဖောင်းကြွနေသော အဖြူရောင်သစ်ပုပ်နာများအဖြစ် (၄) ပတ်သား ပဲပင်များတွင် ပေါ်လာကြသည်။

ပဲပင်များ ပုသွားကြကာ အရွက်များသည် အစိမ်းရင့်ရောင်ဖြစ်ကာ ပြောက်ကြားဖြစ်လာပြီး အရွယ်သေးသွားကြသည်။

ပန်းပွင့်ခြင်းနှင့်ပဲသီးတောင့်သီးခြင်းကိုအကြီးအကျယ်အလျာ့နည်းစေသည်။

ရောဂါကျပဲပင်များကိုပင်စည်မြစ်ဆက်နေရာမှအောက်သို့
    ဒေါင်လိုက်ခွဲကြည့်ပါက အတွင်းပိုင်းတစ်ရှူးများ အနီရောင် ပျက်သွားခြင်းကိုမြင်တွေ့နိုင်ပြီးအတွင်းပိုင်းအမြစ်တစ်ရှူးများ
အဖြူရောင်ဖြစ်လာကြသည်။

အသုံးပြုရမည့်ဆေး- ကာဘင်ဒါဇင် ၊ သိုင်ရမ် ။
''',
        Color(0xFFA7FFEB),
        'assets/dodont/p01.jpg'
    ),
    Item(
      'အဝါရောင်မိုစိတ်ရောဂါလက္ခဏာများ',
      '''ကနဦးတွင် အရွယ်ငယ်များတွင် ပြန့်ကျဲနေသောအဝါရောင်အစက်များ ပေါ်လာကြသည်။ 

အစက်များသည် တဖြည်း ဖြည်းအရွယ်အစားကြီးမားလာကြကာ အချို့အရွက်များ လုံး၀ဝါသွားကြသည်။

ရောဂါကျအရွက်များတွင်လည်းဆဲလ်သေလက္ခဏာများကို
   တွေ့ရသည်။

ရောဂါကျအပင်များ ပုသွားကြကာ ရင့်မှည့်မှုနောက်ကျကာ ပန်းနှင့်ပဲသီးတောင့်အနည်းငယ်သာ ထုတ်လုပ်သည်။

ရောဂါကျပဲပင်များ၏ ပဲသီးတောင့်များအရွယ်အစားသေးသွားကြကာ အဝါရောင်ပြောင်းသွားကြသည်။

အသုံးပြုရမည့်ဆေး- ဒိုင်မီသိုအိတ် ၊ အင်မီဒါကလိုပရစ်ဒ် ၊ တမာဆီ။
''',
        Color(0xFFB2EBF2),
        'assets/dodont/p02.jpg'
    ),
    Item(
      'ဖားဥမှိုရောဂါလက္ခဏာများ',
      '''ပဲပင်၏မည်သည့်အရွယ်တွင်မဆိုရောဂါကျရောက်သည်။

သေးငယ်သောအဖြူရောင်ပေါင်ဒါအကွက်ကလေးများအရွက်များပေါ်တွင်ပထမဦးစွာပေါ်လာသည်။

ရောဂါကျရောက်နေသောအရွက်များသည်ခရမ်းရောင်သို့ပြောင်းသွားပြီးနောင်တွင်သေသွားသည်။

ရောဂါကျရောက်မှုပြင်းထန်ပါကပင်စည်များ၊ ရွက်နုများနှင့်ပဲသီးတောင့်များတွင်အဖြူရောင်ပေါင်ဒါမှုန့်ဖြင့်ဖုံးအုပ်ထားသည်။

အသုံးပြုရမည့်ဆေး- ကာဘင်ဒါဇင် ၊ တမာစေ့ခွံစစ်ကျရည် ၊ ယူကလစ်ရွက်စစ်ကျရည် ။
''',
        Color(0xFFE8EAF6),
        'assets/dodont/p03.png'
    ),
    Item(
      'မြစ်ပုပ်နှင့်ရွက်ခြောက်ရောဂါလက္ခဏာများ',
      '''ရောဂါလက္ခဏာများသည် ပုံသဏ္ဍာန်အမျိုးမျိုးဖြင့်သေးငယ်ပြီး ရေစိုနာကွက်ရှိကာ စိမ်းဖျော့ရောင်ရှိသောဒဏ်ရာများကို ပဲရွက်များပေါ်တွင်ဖြစ်ပေါ်လာသည်။

မှိုမျှင်များကြောင့်ဖြစ်ပေါ်လာသော ပန်းရောင်ပင့်ကူအိမ်တွင် မြောက်မြားစွာသော အဖြူရောင်ဖျော့တော့ခြင်းကို တွေ့ရသည်။

တိုက်ခိုက်ခံရသောပဲရွက်များ ကြွေကျသွားသည်။

 ပဲကိုင်းအရေအတွက်နည်းလာသည့် အကျိုးရလဒ်အဖြစ် ပဲအထွက် သိသိသာသာ ကျဆင်းသွားသည်။

အသုံးပြုရမည့်ဆေး- ကာဘင်ဒါဇင်။
''',
        Color(0xFFE1BEE7),
        'assets/dodont/p04.png'
    ),
    Item(
      'သံချေးမှိုရောဂါ လက္ခဏာများ',
      '''ရောဂါလက္ခဏာသည် အများအားဖြင့် အရွက်၏အောက်ဖက်မျက်နှာပြင်ဖက်တွင် နီညိုရောင်စက်ဝိုင်းကွက်များ အဖြစ် ပေါ်လာပြီး ပဲသီးတောင့်များတွင် အကျနည်းပြီး ပင်စည်များတွင်ပြန့်ကျဲကျဲရှိသည်။

အရွက်များတွင် ဆိုးရွားစွာကျပါက ပဲရွက်၏မျက်နှာပြင်နှစ်ဖက်စလုံးတွင် သံချေးမှိုစုများဖြင့် အပြည့်ဖုံးထားသည်။

အရွက်များတွန့်ရှုံ့ပြီး အရွက်များကြွေကျခြင်းကြောင့် အထွက်လျော့နည်းစေသည်။
''',
        Color(0xFFB0BEC5),
        'assets/dodont/p05.jpg'
    ),
    Item(
      'ဘက်တီးရီးယား ပင်ညှိုးရောဂါလက္ခဏာများ',
        '''ပျိုးခင်းမှ ခူးဆွတ်ချိန်အထိကျရောက်သည်။
 
ရေဝပ်၍ မြေအစိုဓာတ်များပါက ပိုမိုဆိုးရွာသည်။

ရောဂါကျစ၌ အရွက်နုများ၊ အညွန့်များညှိုးလာသည်။

ရောဂါပြင်းထန်ပါက (၂-၃)ရက်အတွင်း တစ်ပင်လုံးညှိုးသွားသည်။

ပင်စည်ညိုမည်း၍ အပင်သေသွားသည်။ ရောဂါရ ပင်စည်အား ဖြတ်၍ ရေတွင်စိမ်ကြည့်ပါက နို့နှစ်ရောင် ဘက်တီးရီးယား စိမ့်ထုတ်ရည်များစီးထွက်သည်ကိုတွေ့ရသည်။

အသုံးပြုရမည့်ဆေး- ကာစင်၊ ကျူပရိုမက်စ်။
''',
        Color(0xFFB2FF59),
        'assets/dodont/g2.jpg'
    ),
    Item(
      'မှဲ့ပြောက်စွန်းနှင့် ကိုင်းဖျားခြောက်ရောဂါလက္ခဏာများ',
        '''အရွက်၊ အကိုင်းနှင့် အသီးပေါ်တွင်ကျရောက်သည်။ ငရုတ်ပွင့်တွင် ကျပါက အပွင့်ညှိုး၍ ငိုက်ကျလာပြီး တဖြည်းဖြည်းခြောက်ကာ ကြွေကျသွားသည်။

အပွင့်မှပွင့်ညှာကို ဖြတ်၍ ကိုင်းအထိကူးစက်ပါက ကိုင်းဖျားခြောက်ရောဂါဖြစ်စေသည်။

ကိုင်းဖျားမှကိုင်းခွအထိခြောက်ကာ ကိုင်းတစ်ခြမ်း (သို့) တစ်ကိုင်းလုံးခြောက်သွားနိုင်သည်။

 ရင့်မှည့်သည့် အသီးပေါ်တွင် ဦးစွာရေစိုနာ အကွက်ဖြစ်၍ တဖြည်း ဖြည်းကျယ်ပြန့်လာကာနီညိုရောင်ပြောင်းသွားသည်။ရောဂါပြင်းထန်ပါက အသီးအတွင်းပိုင်း တွန့်ရှုံ့နေမည်။

အသုံးပြုရမည့်ဆေး- ဒိုင်ဇီ၊ ဇိုလာ၊ ကာဗာ။
''',
        Color(0xFFE6EE9C),
        'assets/dodont/g2.jpg'
    ),
    Item(
      'ဂေါ်ဖီထုပ်ရောဂါလက္ခဏာများ-အင်းဆက်-ပိုးမွှား',
        '''ပိုးမွှားပကတိမျက်စိဖြင့် အရွက်များတွင် ကောင်းစွာမြင်နိုင်သည်။ ၎င်းတို့သည် သေးငယ်သော အစိမ်းဖျော့ဖျော့ သို့မဟုတ် အလင်းဝင်သော ဘဲဥပုံပုံသဏ္ဍာန်ရှိသော အင်းဆက်များဖြစ်ပြီး အရွယ်အစား 5 မီလီမီတာအထိ အပင်များ၏ အစိတ်အပိုင်းများစွာတွင် နေထိုင်ကြပြီး ၎င်းတို့ထံမှ ဖျော်ရည်များကို စုပ်ယူကြသည်။

ပင့်ကူ miteစာရွက်၏ နောက်ဘက်ခြမ်းတွင် သေးငယ်သော၊ မမြင်နိုင်လောက်သော ပင့်ကူမျှင်များ၊ စေးကပ်နေသော လျှို့ ဝှက်များနှင့် အနက်ရောင်အစက်များဖြင့် တွေ့ရပြီး စာရွက်၏ မျက်နှာပြင်တစ်ခုလုံးသည် အလင်းအစက်အစက်ကလေးများဖြင့် အစက်အပြောက်များ ရှိနေသကဲ့သို့၊ ဂေါ်ဖီရွက်သည် မကြာမီ အဝါရောင်ပြောင်းကာ ကြွေကျသွားသည်။

''',
        Color(0xFFC5E1A5),
        'assets/dodont/c1.jpg'
    ),
    Item(
      'ဂေါ်ဖီထုပ်ရောဂါများ',
        '''ဂေါ်ဖီထုပ်တွင် ရောဂါအနည်းငယ်ရှိသော်လည်း ပျိုးခင်းအဆင့်တွင် အဖြစ်အများဆုံးမှာ အနက်ရောင်ခြေထောက်နှင့် fusarium ဖြစ်သည်။

 ဂေါ်ဖီထုပ်ရောဂါများ တတ်နိုင်သမျှ ကာကွယ်ရန်အတွက် မျိုးစေ့မှ ကူးစက်တတ်သောကြောင့် မျိုးစေ့မကြဲမီ အထူးကုသမှုခံယူရန် လိုအပ်ပါသည်။ 

အပင်ပေါက်ပြီးနောက် phytosporin ၏အဖြေဖြင့် ရေလောင်းသည်။

 ၎င်းသည် ဂေါ်ဖီထုပ်အနာအားလုံးကို ကောင်းစွာဖြေရှင်းနိုင်သော သဘာဝဇီဝမှိုသတ်ဆေးဖြစ်သည်။ ဒါပေမယ့် ကြိုတင်ကာကွယ်မှုအနေနဲ့ကတော့ အထူးကောင်းပါတယ်။ 

ရောဂါသည် သူ့အလိုလိုထင်ရှားနေပြီဆိုလျှင်၊ ပိုမိုအားကောင်းသောနည်းလမ်းများကို အများဆုံးလိုအပ်ပါသည်။ သို့သော် ရောဂါရှိသောအပင်များကို ဖျက်ဆီးရန်မှာ အလွယ်ဆုံးဖြစ်ပြီး ကျန်အပင်များကို ကူးစက်ရန် အချိန်မရှိပါ။
''',
        Color(0xFFB2DFDB),
        'assets/dodont/c2.jpg'
    ),
    Item(
      'ဂေါ်ဖီထုပ်ပင်ကိုမြေတွင် အစားထိုး စိုက်ခြင်း',
        '''ဂေါ်ဖီပျိုးပင်၏အောက်ပိုင်းအရွက်များ အဝါရောင်ပြောင်းလာသောအခါတွင် အခြေအနေတစ်ခုရှိသည်။

ပွင့်လင်းမြေ၌အပင်များကိုစိုက်ပျိုးပြီးနောက်၎င်းသည်ဖြစ်ပျက်သည်။ အစားထိုးစိုက်ပျိုးသောအခါတွင် အမြစ်တစ်စိတ်တစ်ပိုင်း ပျက်စီးသွားသောကြောင့် အရွက်များ အဝါရောင်ထွက်ခြင်းကို ရှောင်လွှဲ၍မရပါ။

 စိုးရိမ်စရာမရှိပါ၊ အရွက်များကိုဂရုတစိုက်ဖြတ်ရန်၊ ဖြတ်ရမည်၊ ပျိုးပင်များကြွယ်ဝစွာသွန်းလောင်းသင့်သည်။ 5-6 ရက်အကြာတွင်၎င်းသည်အသစ်သောနေရာ၌အမြစ်တွယ်ပြီးစိမ်းလန်းသောအရွက်သစ်များဖြစ်ပေါ်လာသည်။
''',
        Color(0xFFB2EBF2),
        'assets/dodont/c3.jpg'
    ),
    Item(
      'မြေပဲပင်စည်ပုပ်ရောဂါလက္ခဏာများ',
         '''နက်မှောင် ပုပ်ရိနေသော အမြစ်များသည် အမြစ်ပုပ်ရောဂါ၏ လက္ခဏာများ ဖြစ်ပါသည်။ ဤရောဂါကျရောက်ပါက အပင် တစ်ပင်လုံးသည် အစိမ်းနုရောင် သို့မဟုတ် အဝါရောင်အဖြစ် ပြောင်းလဲကာ ညှိုးရော် သေဆုံးသွားတတ်ပါသည်။

 အမြစ်မွှာများသည် တဖြေးဖြေးခြင်း ခြောက်သွေ့ သေဆုံးသွားသည်ကိုလည်း တွေ့ရတတ်ပါသည်။ အထူးသဖြင့် စိုစွတ်သော ရာသီဥတုတွင် အုတ်ခဲရောင် ပင်အပ်ခေါင်းအရွယ် မှိုလုံးလေးများကိုလည်း အမြစ်ထိပ်ဖျားများ၊ ပင်စည်အောက်ပိုင်း နှင့် မြေပဲတောင့်များတွင် တွေ့ရတတ်ပါသည်။

မြေပဲပင်များကို အမြစ်ပုပ်ရောဂါမှ ကာကွယ်ရန် ဖော်ပြပါ ပိုးသတ်ဆေးများအား အသုံးပြုနိုင်ပါသည်။
၁။ ရေ ၄ ဂါလံဝင် ဆေးဖြန်းပုံးတစ်ပုံးလျှင် သီယိုဖီနိတ်-မီသိုင်း ၇၀% ဒဗလျူပီ ၂၀-၃၀ ဂရမ်နှုန်း
၂။ ရေ ၄ ဂါလံဝင် ဆေးဖြန်းပုံးတစ်ပုံးလျှင် အိုင်ပရိုဒိုင်း ၅၀% အက်စ်စီ ၃၀-၄၀ စီစီ နှုန်း
''',
        Color(0xFFFFCC80),
        'assets/dodont/c4.jpg'
    ),
    Item(
      'နှမ်းဘက်တီးရီးယား အပင်နာရောဂါများ',
        '''ဘက်တီးရီးယားရောဂါဟာ နေပူတလှည့်၊ မိုးရွာတလှည့်၊ ပူလိုက်အေးလိုက်ရာသီဥတု စိုစွတ်ချိန်မျိုးတွေမှာ ပွားများတတ်ပါတယ်။

မှိုရောဂါကဲ့သို့ အပင်တစ်ရှူးအတွင်း တိုက်ရိုက် မဝင်ရောက်နိုင်လို့ စတ်ိုမာတာ အပေါက်များမှလည်းကောင်း၊ ပိုးကိုက်ဒဏ်ရာ၊ ထိခိုက်ဒဏ်ရာများမှတဆင့်လည်းကောင်း ဝင်ရောက်နိုင်ပါတယ်။

မိုးသက် လေ၊ သွင်းရေ၊ မိုးစက်၊ မိုးပေါက်များကတဆင့်လည်း ကူးစက်ပျံ့နှံ့နိုင်ပါတယ်။အပင်တစ်ရှူးအတွင်း ရောက်ရှိပြီးပါက အစာကြော၊ ရေကြောတလျှောက် ယက်မွေးကိုအသုံးပြုပြီး တနေရာမှ တနေရာ ကူးစက်မြန်ပါတယ်။

ဒါကြောင့် ဘက်တီးရီးယားရောဂါဟာ ကုသချိန်နည်းတာမို့ မကျရောက်အောင် ကာကွယ်ခြင်းကသာ အထိရောက်ဆုံးဖြစ်ပါတယ်။
''',
        Color(0xFFFFE082),
        'assets/dodont/c5.jpg'
    ),
    Item(
      'နေကြာသီးနှံတွင် ကျရောက်သောပိုးမွှားများ',
        '''ဖျက်ပိုးဆိုသည်မှာ သီးနှံများ၏ အရည်အသွေး၊ အထွက်နှုန်းနှင့် မျိုးစေ့အပင်ပေါက်နိုင်စွမ်းတို့ကို ထိခိုက်ပျက်စီးစေပါသည်။ ဖျက်ပိုးတွင် ပိုးမွှား၊ ရောဂါ၊ ပေါင်း၊ ကြွက်၊ ခရု စသည်တို့ ပါဝင်ပါသည်။

ပိုးမွှားဆိုသည်မှာ အပင်နှင့် အပင်ထွက်ပစ္စည်းများကို စားသောက်၊ ဖျက်ဆီးသည့်အပြင် ရောဂါများကိုပါ သယ်ဆောင် ပြန့်ပွားနိုင်သည့် သက်ရှိများ ဖြစ်ပါသည်။
''',
        Color(0xFFFF5252),
        'assets/dodont/c6.jpg'
    ),
    Item(
      'နေကြာသီးနှံတွင် ကျရောက်သောရောဂါများ',
        '''အပင်ရောဂါဆိုသည်မှာ အပင်၏ မူမှန်အခြေအနေမှ မူမမှန်အခြေအနေသို့ အကြောင်းတစ်ရပ်ရပ်ကြောင့် ပြောင်းလဲခြင်းကို ခေါ်ပါသည်။ မျက်မြင်အားဖြင့် မမြင်နိုင်သည့် အဏုဇီဝ သက်ရှိများဖြစ်သော မှို၊ ဗက်တီးရီးယား၊ ဗိုင်းရပ်စ်၊ နီမတုတ်တို့ကြောင့် ဖြစ်နိုင်သကဲ့သို့ အာဟာရချို့တဲ့မှုနှင့် ပတ်ဝန်းကျင်အခြေ အနေပြောင်းလဲမှုကြောင့်လည်း မူမမှန်‌ပြောင်းလဲခြင်းများ ဖြစ်တတ်ပါသည်။

သားရဲကောင်ဆိုသည်မှာ ဖျက်ပိုးများကိုရှာဖွေစားသောက်သည့်အကောင်များ ဖြစ်သည်။သားရဲကောင် မျိုးစိတ်များသည် ဖျက်ပိုးများ၏လောက်ကောင်ငယ်ဘဝနှင့်အကောင်ကြီးဘဝနှစ်မျိုလုံကို စားသောက်လေ့ရှိသည်။သားရဲကောင်များတွင်ပိုးတောင်မာကျိုင်း၊ ပုစဉ်း၊ လင်ကောင်ပိုး၊ ပင့်ကူ၊ ပုရစ်၊ နှံကောင်မျိုးရင်းတို့ ပါဝင်ပါသည်။
''',
        Color(0xFFFF80AB),
        'assets/dodont/c6.jpg'
    ),
    Item(
      'နေကြာသီးနှံတွင် ကျရောက်သော နေကြာပွင့်စားပိုး',
        '''နေကြာပင်ငယ်စဉ်တွင် ပိုးလောက်ကောင်သည် အရွက်များကို စားသောက်ဖျက်ဆီးတတ်ပါသည်။ 

အပင်ကြီးအဆင့်တွင် နေကြာပွင့်အတွင်းသို့ ထိုးဖောက်ဝင်ရောက်သွားပြီး အစေ့နုများကို စားသောက်ဖျက်ဆီး တတ်ပါသည်။ 

နေကြာပွင့်စားပိုး စားသောက်ဖျက်ဆီးသည့် ဒဏ်ရာမှတစ်ဆင့် မှိုများ ဝင်ရောက်ပေါက်ပွားလာပြီး နေကြာပွင့်မှာ ပုပ်၍ပျက်စီးသွားပါသည်။

အသုံးပြုရမည့်ဆေး- ဆိုက်ပါမီသရင် ။
''',
        Color(0xFFFFE57F),
        'assets/dodont/n1.jpg'
    ),
    Item(
  'နေကြာသီးနှံတွင် ကျရောက်သော ရွက်စုံစားခူမွေးရှည်',
        ''''ပိုးလောက်ကောင်ငယ်များသည် အရွက်အောက် မျက်နှာပြင်မှခြစ်၍ စားသောက် ဖျက်ဆီးတတ်ပါသည်။ 

ဖျက်ဆီးပါက အရွက်တွင် ဆန်ခါပေါက်များအဖြစ် တွေ့မြင်ရပြီး ပြင်းထန်စွာကျရောက်ပါက အရွက်ရိုးတံများသာ ကျန်နေသည်ကို တွေ့ရမည်ဖြစ်ပါသည်။

အသုံးပြုရမည့်ဆေး- ဒိုင်မီသိုအိတ်၊ အက်ဆီဖိတ်။
''',
        Color(0xFFE6EE9C),
        'assets/dodont/n2.jpg'
    ),
    Item(
      'နေကြာသီးနှံတွင် ကျရောက်သော ပိုးနဂါး',
        '''
ပိုးလောက်ကောင်သည် ငယ်စဉ်တွင် အရွက်နုများ၊ အရွက်များပေါ်၌ အစုလိုက်၊ အပြုံလိုက်ကျရောက်၍ စားသောက်ဖျက်ဆီးတတ်ပါသည်။

စားသောက်ဖျက်ဆီးမှုပြင်းထန်ပါက အရွက်တွင် အဖြူရောင်အမြှေးပါးများသာ ကျန်ရှိသည်ကို တွေ့မြင်ရပါမည်။

ပိုးလောက်ကောင်ကြီးများသည် နေကြာစေ့ အနုများကိုလည်း စားသောက်ဖျက်ဆီးတတ်ပါသည်။

အသုံးပြုရမည့်ဆေး- ဒိုင်မီသိုအိတ် ။
''',
        Color(0xFFFCE4EC),
        'assets/dodont/n3.jpg'
    ),
    Item(
      'နေကြာသီးနှံတွင်ကျရောက်သော ဖြုတ်စိမ်း',
        '''ဖြုတ်စိမ်းများကျရောက်ပါက ပင်ရည်ကို စုပ်သောကြောင့် အရွက်များ အဝါဖျော့ရောင် ပြောင်းသွားပါသည်။

 ပြင်းထန်စွာကျရောက်ပါက အရွက်များကုပ်နေသည်ကို တွေ့ရမည် ဖြစ်ပါသည်။

အသုံးပြုရမည့်ဆေး- အလန်း ၁၅ ဒဗလျူပီ၊ သန်းဒါး ၂၅၀ အီးစီ။
''',
        Color(0xFFFFD180),
        'assets/dodont/n4.jpg'
    ),
    Item(
      'နေကြာသီးနှံတွင် ကျရောက်သော ပျပိုး',
        '''ပျပိုးအကောင်ငယ်နှင့် အကောင်ကြီးအဆင့်များ ကျရောက်ပါက ပင်စည်များနှင့် ပွင့်ချပ်များမှ ပင်ရည်ကိုစုပ်ယူ၍ စားသောက်ဖျက်ဆီးတတ်ပါသည်။

 အရွက်များ အောက်ဘက်သို့ ကုပ်သွားပြီး အနီရောင်သို့ ပြောင်းသွားတတ်သလို ကျပ်ခိုးမှိုကျရောက်နိုင်ပြီး အရွက်များမည်းသွားနိုင်ပါသည်။

အသုံးပြုရမည့်ဆေး- ပင်လုံးပျံ့ပိုးသတ်ဆေး။
''',
        Color(0xFFFFAB91),
        'assets/dodont/n5.png'
    ),
    Item(
      'နေကြာသီးနှံတွင် ကျရောက်သော ကြွက်',
        '''ကြွက်များသည် နေကြာမျိုးစေ့ချပြီးနှင့် အစေ့အဆန်တည်ချိန်တွင် စားသောက် ဖျက်ဆီးတတ်ပါသည်။
ကြွက်များ အဖွဲ့လိုက်၊ အစုလိုက် အပင်များပေါ်သို့တက်၍ နေကြာစေ့များကို စားသောက် ဖျက်ဆီးတတ်ပါသည်။ နေကြာတစ်ခင်းလုံးကို လျင်မြန်စွာ ဆုံးရှုံးပျက်စီးစေနိုင်ပါသည်။

ကာကွယ်နှိမ်နင်းနည်း- ကြွက်များကို ထောင်ချောက်များဖြင့် ကာကွယ်နိုင်ပါသည်။ ကြွက်များကို စားသောက်တတ်သော သားရဲကောင်များ (ဥပမာ−ခွေး၊ ကြောင်၊ လင်ကောင်ပိုး) ဖြင့်လည်း ကာကွယ် နိုင်ပါသည်။ 
လူအင်အားဖြင့်လည်း ဖမ်းဆီးနှိမ်နင်းနိုင်ပါသည်။ ကြွက်သတ်ဆေးတစ်မျိုးမျိုး (ဥပမာ−ဟက်ပီးကြွက်သတ်ဆေး)၊ ကြွက် မကြိုက်သော အနံ့အမျိုးမျိုးပေး၍ ကာကွယ်နိုင်ပါသည်။
''',
        Color(0xFFFFE082),
        'assets/dodont/n8.png'
    ),
    Item(
      'နေကြာသီးနှံတွင် ကျရောက်သော ငှက်များ(ကြက်တူရွေး)',
        '''ငှက်များ(ကြက်တူရွေး)သည် အစေ့စတည်ချိန်မှ ရိတ်သိမ်းချိန်အထိ စားသောက် ဖျက်ဆီးတတ်ပါသည်။

ကာကွယ်နှိမ်နင်းနည်း- ငှက်များ (ကြက်တူရွေး)ကို လူအင်အားဖြင့် ငှက်များအား ခြောက်လှန့်ခြင်း၊ ငှက်ဖမ်းပိုက်များ သုံးခြင်းဖြင့်လည်း ကာကွယ်ပေးနိုင်ပါသည်။
''',
        Color(0xFFFFFF8D),
        'assets/dodont/n9.png'
    ),
    Item(
      'နေကြာပင်ခြေပုပ်ရောဂါ',
        '''စိုက်ခင်းအတွင်းတွင် ညှိုးနေသောအပင်များကို စတင်တွေ့ရှိရပါမည်။ ၎င်းအပင်များကို စစ်ဆေးပါက အပင်ခြေတွင် ညိုပုပ်သည့် ရောဂါလက္ခဏာအား တွေ့ရှိနိုင်ပါသည်။ 

အပင်ခြေတွင် အဖြူရောင် မှိုမျှင်များကိုလည်း မျက်စေ့ဖြင့်ပင် မြင်တွေ့နိုင်ပါသည်။ ရောဂါပြင်းထန်လာပါက တစ်ပင်လုံးညှိုး၍ သေဆုံးနေသည်ကို တွေ့ရှိ ရပါမည်။

 ပင်ခြေပုပ်ရောဂါသည် ပူနွေးပြီးစိုထိုင်းဆများလာသည့် အချိန်တွင် လျင်မြန်စွာပျံ့နှံ့နိုင်ပါသည်။

အသုံးပြုရမည့်ဆေး- ဟိုမိုင်း၊ တော့ပ်စင်၊ မက်တယ်လဇီ။
''',
        Color(0xFFEEFF41),
        'assets/dodont/n6.jpg'
    ),
    Item(
      'နေကြာရွက်ခြောက်ရောဂါ',
        '''အရွက်ပေါ်တွင် အညိုရင့်ရောင် အနာကွက်များကို စတင်တွေ့နိုင်ပါသည်။ နောက်ပိုင်းတွင် ရွက်ညှာများပေါ်အထိ ပျံ့နှံ့သွား ပြီး ပင်စည်ပေါ်သို့ ကူးစက်သွားနိုင်ပါသည်။ 

အရွက်တစ်ခုလုံးခြောက်ခြင်း၊ ပင်စည်နှင့် ပန်းပွင့်တစ်ခုလုံးပုပ်ခြင်းများကို ဖြစ်စေနိုင်ပါသည်။

ရောဂါပြင်းထန်လာပါက အရွက်များ လျင်မြန်စွာခြောက်သွေ့ပြီး သေဆုံးနိုင်ပါသည်။

အသုံးပြုရမည့်ဆေး- မန်ကိုဇက်။
''',
        Color(0xFFFFCC80),
        'assets/dodont/n7.jpg'
    ),
    Item(
        'ငှက်ပျောပင်တွင် ကျရောက်သော ပနားမားညှိုးသေရောဂါ',
        '''မြေကြီးထဲမှာ ခိုအောင်းရှိနေတဲ့ Fusarium မှိုက ငှက်ပျောပင်ရဲ့ အမြစ်များမှ တစ်ဆင့် ပင်စည်နှင့် အရွက်များသို့ ရေသယ်ပို့ရာမှ ပါသွားပြီး ဂျယ်လီနှင့် အစေးများထုတ်သဖြင့် တစ်ပင်လုံးကို ရေနှင့် အာဟာရများ စီးဆင်းခြင်းကို ဖြတ်တောက်လိုက်သည့်အတွက်ကြောင့် ထွက်ပေါ်လာသည့် အရွက်များ အရောင်ဖြော့တော့ကာ အရွက်အစာချက်စေသည့် လုပ်ငန်းစဉ်လည်း ပျက်စီသွားစေပြီး အရွက်များ အညိုရောင်ပြောင်းကာ ရွက်ရိုးတံမှ ခါးကျိုးကျကာ အရွက်၏ လုပ်ငန်း စဉ်များ ဆုံးရှုံးလာပြီး အပင်အတွင်ပိုင်း အူတိုင်မှာလည်း တစ်ဖြေးဖြေးပုပ်ဆွေးသွားသဖြင့် အပင်ညိုးသေတာ ဖြစ်ပါတယ်။

Carbendazim2% ဆေးရည် ကို ငှက်ပျောခေါင်းတစ်ခုလျှင် (၃) စီစီ ထိုးသွင်းပေးပါ။ ငှက်ပျောခင်းအား ရေလွှမ်းပေးခြင်း၊ သီးလှည့် စိုက်ပျိုးခြင်းဖြင့် ပြုလုပ်ပါ။ 
''',
        Color(0xFFFFAB91),
        'assets/dodont/b1.jpg'
    ),
    Item(
        'ငှက်ပျောပင်တွင် ကျရောက်သော ရွက်ပျောက်ရောဂါ',
        '''အရွက်များမရင့်မီ ရွက်နားများ၊ မျက်နှာပြင်များခြောက်လာသည်။

ရောဂါပြင်းထန်ပါက အသီးများ ကြီးထွားရင့်မှည့်ခြင်း မရှိတော့ချေ။

ရောဂါမပြင်းထန်ပါက အခိုင်၊အဖီးများ ငယ်သွား၍ အသီးမရင့်ဘဲ မှည့်သွားတတ်သည်။ 

Dithane M45, Calixin သို့မဟုတ် Meneb ပက်ဖျန်းပေးပါ။
''',
        Color(0xFFFFE57F),
        'assets/dodont/b2.jpg'
    ),
    Item(
        'ငှက်ပျောပင်တွင် ကျရောက်သော ငှက်ပျောထိပ်စုရောဂါ',
        '''ငှက်ပျောရွက်များပေါ်တွင် အစိမ်းရောင်အစင်းများ ဖြစ်ပေါ်၍ ကျွတ်တတ်သည်။

 အရွက်များသေးငယ်လာပြီး စုထောင်နေတတ်သည်။ ပျပိုးမှ ဆစ်ဆင့် ဗိုင်းရပ်(စ်)ရောဂါ ဖြစ်စေခြင်း ဖြစ်သည်။
 
ပျပိုးများကို Decis ကဲ့သို့သော ပိုးသတ်ဆေးမျိုးဖြင့် ပက်ဖျန်း ကာကွယ်နှိမ်နင်းပါ။ ရောဂါရ အပင်များအား တူးထုတ်ပေးပါ။
''',
        Color(0xFFFF9E80),
        'assets/dodont/b4.jpg'
    ),
    Item(
        'ငှက်ပျောပင်တွင် ကျရောက်သော ငှက်ပျောအမြစ်ထိုးပိုး',
        '''ငှက်ပျောခေါင်းနှင့် ပင်စည်ယောင်တွင်းသို့ ထိုးဖောက်ကာ ဥများကိုဥထားကြပြီး ပိုးလောက်ကောင်ဘဝမှာ ပင်စည်ထဲမှာ စားသောက်ခြင်းဖြင့် ငှက်ပျောပင်စည် ဒဏ်ရာ ရရှိကာ ၎င်းဒဏ်ရာကြောင့် ပင်စည်ပုပ်ရိပြီး ကျိုးကျခြင်းဖြစ်သည်။

နွားချေးမြေဆွေး ကောင်းစွာမဆွေးမြေ့ဘဲ ထည့်သွင်းခြင်း တစ်ချို့သောခြံများတွင် ငှက်ပျောပင် အရင်းမှ မြေဖုံးပေးသောကြောင့် ကျရောက်မှု့ ပိုမို ဖြစ်ပွားသည်။ပိုးကျသည့် သားတက်များ ညှိုနွမ်းနေပြီး ကြီးထွားမှုမရှိတော့ပါ။ လေပြင်းတိုက်ပါက ဖြစ်သင့်သည်ထက် အပင်များကျိုးကျကုန်သည်။
 ပင်စည်ခြေရင်းတွင်ပိုးလောက်ကောင်၊ကျိုင်းကောင်ကြီးများကိုရှာဖွေနှိမ်နင်းပါ။အပင်ခြေတွင် ပေါင်းမြက်အမှိုက်ကင်းစင်ပါစေ။ Furadam ဖြူရာဒမ် ဆေးကိုစတင်စိုက်ပျိုးချိန်တွင် ထည့်ပေးပါ။
''',
        Color(0xFFFFE57F),
        'assets/dodont/b3.jpg'
    ),

        Item(
        'ဂန္ဓမာအရွက်အစက်အပြောက်ရောဂါများ-',
  '''မိုးရာသီအတွင်း အစက်အပြောက်ရောဂါကျရောက်လေ့ရှိသည်။
    မိုးဆက်များမှ တစ်ဆင့်ကူးဆက်သဖြင့် အောက်ဆုံးအရွက်မှစတင်၍ ဖြစ်ပေါ်တတ်သည်။

ရောဂါပြင်းထန်ပါက အရွက်များညှိုးနွမ်းသွားပြီး အပင်တွင် ကြာရှည်တွဲလဲရှိနေတတ်သည်။ပန်းပွင့်များကိုပါ ကူူးဆက်၍ အပွင့်များပုပ်စေသည်။

ရောဂါရပင်ကြွင်းပင်ကျန်များကို ဖယ်ရှားပါ။ရေအလွန်အကျွံသွင်းခြင်း ရှောင်ကြဉ်ပါ။

ရောဂါပြင်းထန်ပါက မန်ကိုဇက်၊ ဒိုင်ဖီနိုကိုနာဇိုးလ်၊ ပရိုပီကိုနာဇိုးလ်၊ သိုင်အိုဖာနိတ်မီသိုင်း၊ ကလိုရိုသာလိုနေး ဆေးတစ်မျိုးမျိုးဖြင့် ကာကွယ်ပါ။
''',
  Color(0xFFFFD180),
  'assets/dodont/b5.jpg'
  ),

  Item(
  'ငရုပ်ပင်တွင်ကျရောက်သောဖြူစေရီယမ်ပင်ညှိုးရောဂါ',
  '''ဖြူစေရီယမ်မိကြောင့်ဖြစ်သည်။အပင်ငယ်စဉ်တွင် အပင်ပုခြင်း၊ အရွက်များဝါ၍ အောက်သို ကုပ်ခြင်း၊
  
   ပင်စည်အတွင်း အစာရေကြောစည်းများညိုခြင်းများဖြစ်ကာ နောက်ဆုံးတွင် အပင်ညှိုး၍ သေသွားသည်။
   
အသုံးပြုရမည့်ဆေး- အောက်စီ၊ ပရော့စပါး၊ အင်ဗွိုင်း၊ ခရူဇာ။(ရောဂါကူးစက်မှုမှ ကာကွယ်ရန် ပင်ခြေဖျန်းပါ)
''',
  Color(0xFFC5E1A5),
  'assets/dodont/s4.png'
  ),
  Item(
  'ငရုပ်ပင်တွင်ကျရောက်သော ဘက်တီးရီးယားပင်ညှိုးရောဂါ',
  '''ရောဂါရအပင်သည် အစိမ်းရောင်ဖျော့လာကာ အညွန် ၊ အရွက်များအောက်သို့ ငိုက်ကျပြီး ညှိုးသွားသည်။

ရောဂါရကိုင်း၊ အသီးမှ ဘက်တီးရီးယားစိမ့်ထွက်ရည်များတွေ့ ရသည်။

ပင်စည်ကိုထက်ခြမ်းခွဲကြည့်ပါက အညိုစင်းကိုတွေ့ ရသည်။

အသုံးပြုရမည့်ဆေး- အောက်စီ။
''',
  Color(0xFFA5D6A7),
  'assets/dodont/s3.png'
  ),
  Item(
  'ငရုပ်ပင်တွင်ကျရောက်တတ်သောရောဂါများ-ပင်နာကျရောဂါ',
  '''မှိုကြောင့်ဖြစ်သည်။အပင်ရင်းတွင် ပုပ်နေတတ်သည်။
အပင်ငယ်စဉ်ကျပါက အပင်လဲကျသေဆုံးပြီး အပင်ကြီးတွင်ကျရောက်ပါက အရွက်များအဝါရောင်ပြောင်း၍ တစ်ပင် လုံးသေသွားသည်
အသုံးပြုရမည့်ဆေး- ပရော့စပါးအောက်စီအင်ဗွိုင်း၊ ဗိုက်တာရမ်း။
''',
  Color(0xFFA7FFEB),
  'assets/dodont/s2.png'
  ),
  Item(
  'ငရုပ်ပင်တွင်ကျရောက်တတ်သောရောဂါများ-အသီးပုပ်ရောဂါ',
  '''အသီးပုပ်ရောဂါမှိုကြောင့်ဖြစ်သည်။

သီးတောင့်အနုအရင့် နှစ်မျိုးလုံးတွင် ကျရောက်သည်။

ရောဂါကျရောက်ပါက သီးတောင့်ပေါ်၌ ရေစိုနာကွက်များဖြစ်လာပြီး အညိုရောင်ပြောင်းကာ လျင်မြန်စွာ သီးတောင့် ပုပ်သွားသည်။
''',
  Color(0xFFFF9E80),
  'assets/dodont/s1.png'
  ),
  Item(
  'ငရုပ်ပင်တွင်ကျရောက်တတ်သောပိုးမွှားများ-ပျပိုး',
  '''အရွက်အောက်မျက်နှာပြင်တွင် များစွာတွေ့ ရပြီး၊ သစ်ရည်ကို စုပ်ယူစားသောက်သဖြင့် အရွက်များကုပ်ခြင်း၊ ဝါခြင်း ဖစ်သည်။

ဗိုင်းရပ်စ်ရောဂါပိုးများကို သယ်ဆောင်ပေးသည်။

အသုံးပြုရမည့်ဆေး- ဗိုက်တိုအိတ်၊ ဗိုက်တာဂရိ၊ အော်ပတီမာ၊ ဗိုက်စန်၊ ကွန်ဖီးဒင့်။
''',
  Color(0xFFB0BEC5),
  'assets/dodont/s15.jpg'
  ),
  Item(
  'ငရုပ်ပင်တွင်ကျရောက်တတ်သောပိုးမွှားများ-သီးလုံးဖောက်ပိုး',
  '''လောက်ကောင်ငယ်သည် အသီးအညှာအနီးမှ အသီးကို ထိုးဖောက်ဖျက်ဆီးသဖြင့် အသီးများကြွေကျသည်။

အသီးစိမ်းကို ထိုးဖောက်စားသောက်နေသောပိုးကောင်ကို အလွယ်တကူမြင်နိုင်သည်။

အသုံးပြုရမည့်ဆေး- ဆလက်ပလပ်၊ အော်ပတီမာ၊ အယ်လဖာ၊ဗိုက်တာရှီး၊ ကွန်ဖီးဒင့်။
''',
  Color(0xFFFFE57F),
  'assets/dodont/s14.jpg'
  ),
  Item(
  'ငရုပ်ပင်တွင်ကျရောက်တတ်သောပိုးမွှားများ-သီးထိုးယင်',
  '''ယင်မသည် အသီးခွံတွင် ဥများအုထားပြီး ပိုးလောက်ကောင်များသည် အသီးရင်းတွင် ဝင်ရောက်စားသောက်ဖျက်

ဆီးသဖြင့် ရေနာကွက်ဖြစ်ပြီး ညိုပုပ်သည်။

ဘက်တီးရီးယားနှင့်မှိုရောဂါများဖြစ်ပေါ်စေသည်။

အသုံးပြုရမည့်ဆေး- မာလာနွန်၊ အယ်လ်ဖာ၊ ဗိုက်တာမီသရင်၊ ကွန်ဖီးဒင့်။
''',
  Color(0xFFB2DFDB),
  'assets/dodont/s13.png'
  ),
    Item(
        'ငရုပ်ပင်တွင်ကျရောက်တတ်သောပိုးမွှားများ-ယင်ဖြူ',
        '''အရွက်အောက်မျက်နှာပြင်တွင် အစုအဝေးလိုက်နေပြီး သစ်ရည်ကိုစုပ်စားသဖြင့် အရွက်များကုပ်ခြင်း၊ ဝါခြင်း၊ အပင် ပြုခြင်း၊ ကျပ်ခိုးမှိုစွဲခြင်း၊ ဗိုင်းရပ်စ်ကူးစက်ခြင်းဖြစ်စေသည်။

အရွက်တွင် အရောင်မညီကွက်များတွေ့ရသည်။

အသုံးပြုရမည့်ဆေး- ပရိဆိုက်၊ဖေးလစ် ၊ ဗိုက်တိုအိတ်၊ ကွန်ဖီးဒင့်၊ ဆလက်ပလပ်စ်။
''',
        Color(0xFFB2FF59),
        'assets/dodont/s12.jpg'
    ),

    Item(
        'ငရုပ်ပင်တွင်ကျရောက်တတ်သောပိုးမွှားများ-ရွက်လိပ်ပိုး',
        '''အရွက်နှင့် အသီးများကို ပိုးချည်မျှင်များနှင့် ပူးကပ်ချည်နှောင်ပြီး အတွင်းမှနေ၍ အသီးနှင့် အရွက်၏ အစိမ်းရောင် သားများကို ကုတ်ခြစ်စားသောက်သည်။

အသုံးပြုရမည့်ဆေး- ဗိုက်တာရှီး၊ အယ်လ်ဖာ၊ ပရီဆိုက်၊ ကွန်ဖီးဒင့်၊ ဆလက်ဖလက်။
''',
        Color(0xFFEEFF41),
        'assets/dodont/s11.png'
    ),
    Item(
        'ငရုပ်ပင်တွင်ကျရောက်တတ်သောပိုးမွှားများ-လှေးပိုး',
        '''အပင်သက်တမ်းတစ်လျောက်ကျရောက်သည်။

ပိုးကောင်သည် ပင်ရည်ကိုစုပ်ယူစားသောက်သဖြင့် အရွက်များကုပ်သွားသည်။

ဗိုင်းရပ်စ်ရောဂါများကို သယ်ဆောင်လာတတ်သည်။

အသုံးပြုရမည့်ဆေး- ဗိုက်တိုအိတ်၊ ဖိုက်တာဂရို၊ ဗိုက်စန်အော်ပတီမာ၊ ဂိမ်း၊ ကွန်ဖီးဒင့်။
''',
        Color(0xFFFFFF8D),
        'assets/dodont/s10.png'
    ),
    Item(
        'ငရုပ်ပင်တွင်ကျရောက်တတ်သောပိုးမွှားများ-မွှားပင့်ကူနီ',
        '''အရွက်အောက်မျက်နှာပြင်မှ ပင်ရည်များကို စုပ်ယူစားသောက်ပြီး ၎င်းမှ စစ်ထုတ်သောတံတွေးတွင် ပါဝင်သောအထိ ပ်ကြောင့် အရွက်ခြောက်လောင်ကာကြွေကျသည်။

ပူပြင်းသောရာသီတွင်ဆိုးရွားစွာကျရောက်သည်။

အသုံးပြုရမည့်ဆေး- စတား၊ ဆလက်ပလပ်စ်၊ ပံသာ၊ ပရီဆိုက်။
''',
        Color(0xFFFFE57F),
        'assets/dodont/s9.jpg'
    ),
    Item(
        'ငရုပ်ပင်တွင်ကျရောက်တတ်သောရောဂါများ-မှဲ့ ပြောက်စွန်းရောဂါ',
        '''အသီးရင့်များတွင် ရေစိုနာကွက်ဖြစ်ပေါ်ပြီးနောက် ၎င်းအကွက်တွင် အမဲရောင်အဖုငယ်များကိုတွေ့ ရသည်။

ရောဂါကျအပင်သည် ထိပ်ဖျားမှစ၍ ကိုင်းများခြောက်လာသည်။

အသီးတွင်ကျရောက်ပါက အသီးနှံ့ပြီး ပုံပျက်သွားသည်။

အသုံးပြုရမည့်ဆေး- အောက်စီအင်ဗွိုင်းခရူဇာစကုပ်။
''',
        Color(0xFFEEFF41),
        'assets/dodont/s8.png'
    ),
    Item(
        'ငရုပ်ပင်တွင်ကျရောက်တတ်သောရောဂါများ-ခါးရိရောဂါ',
        '''မြေဆောင်ရောဂါဖြစ်သည်။

မျိုးစေ့မှ ပေါက်ခါစ အပင်ငယ်၏ ပင်စည်တွင် ရေစိုနာကွက်များဖြစ်ပေါ်လာသည်။

ရောဂါရပင်၏ အမြစ်များမှာအညိုရောင်ပြောင်းကာပုပ်ဆွေးသွားသည်။

အသုံးပြုရမည့်ဆေး- ပရော့စပါး၊ အောက်စီ၊ အင်ဗွိုင်း၊ ခရူဇာ။
''',
        Color(0xFFFF9E80),
        'assets/dodont/s7.jpg'
    ),
    Item(
        'ငရုပ်ပင်တွင်ကျရောက်တတ်သောရောဂါများ-ဖားဥမှိုရောဂါ',
        '''အရွက်တွင် အဝါကွက်များဖြစ်ပေါ်ပြီး အရွက်အောက်မျက်နှာပြင်တွင် အဖြူရောင်ပေါင်ဒါမှုန် ့ဖြူးထားသကဲ့သို ့ မှိုမျှင်

များ ဖုံးလွှမ်းနေသည်ကိုတွေ့ရသည်။

ရောဂါပြင်းထန်ပါက အရွက်များဝါခြောက်ပြီး ကြွေကျသွားသည်။

အသုံးပြုရမည့်ဆေး- အင်နာဂျီ၊ အင်ဗွိုင်း ခရူဇာ၊ ဗိုက်တာမိုင်း။
''',
        Color(0xFFFF5252),
        'assets/dodont/s6.jpg'
    ),
    Item(
        'ငရုပ်ပင်တွင်ကျရောက်တတ်သောရောဂါများ-ရွက်ပြောက်ရောဂါ',
        '''မှိုကြောင့်ဖြစ်သည်။

အရွက်ပေါ်တွင်ရေနာကွက်အစက် အပြောက်များသည် ပုံသဏ္ဍာန်မမှန်သောအညိုရောင်အနားသတ်နှင့် အဝါရောင်အကွက် များဖြစ်ပေါ်ပြီးနောက် ညိုနက် ရောင်အလယ်ချိုင့်ခွက်သော အကွက်များကို
တွေ့ရသည်။

အသုံးပြုရမည့်ဆေး- အင်နာဂျီအောက်စီ၊ အင်ဗွိုင်း၊ ခရူဇာ၊ စကုတ်။
''',
        Color(0xFFFF80AB),
        'assets/dodont/s5.jpg'
    ),




  ];
}