import 'dart:ui';

class Item {

  String title;
  String description;
  Color color;
  String imageUrl;


  Item(this.title, this.description, this.color, this.imageUrl);

}

List<Item> getGridItems(){
  return <Item>[
    Item(
      'မွေးမြူရေးလုပ်ငန်းအောင်မြင်ရန်',
      '''ကျန်းမာရေးကောင်းမွန်ခြင်း မရှိသောနွားနှင့် ကျန်းမာ‌ရေး‌ကောင်းမွန်‌သောနွားကို ထိတွေ့ခြင်းမဖြစ်အောင် စီစဉ်ထားရှိရမည်။ 

      ဖျားနာနေသော နွားများရှိပါက ကျန်းမာရေးကောင်းမွန်သော နွားများထားရှိရာနေရာသို့ သယ်ဆောင်၊ သွားလာခြင်း မပြုရပါ။
      
      ဖျားနာ‌နေသောနွားများအတွက် လူနှင့်အသုံးအဆောင်ပစ္စည်းများကို သီးသန့်ထားရှိရမည်။ 
      
      ဖျားနာ‌နေသောနွားများ ထားရှိသော ခြံနေရာကို ပိုးသတ်ဆေးဖြင့် စနစ်တကျ ပုံမှန်ပိုးသတ်ပေးရမည်။ 
      
      ခြံတွင် နာတာရှည်ရောဂါဖြစ်ပွားနေသော နွားများရှိပါက ကျန်းမာသောနွားများနှင့် အတူမွေးမြူရန် မသင့်တော်သောကြောင့် ခြံမှထုတ်ပယ်သင့်ပါသည်။
      
      မွေးမြူထားသောနွားများ ရောဂါဖြစ်ပြီး သေဆုံးပါက မြေအောက် ၆- ပေအနက်တွင် မြှုပ်နှံသင့်ပါသည်။ 
      
      ရောဂါဖြစ်သော နွားခြံမှ ပြန်လာသော လူ၊ တိရစ္ဆာန်နှင့်ယာဥ်များ ကျန်းမာသောနွားများထားရှိရာ ခြံအတွင်းသို့ ဝင်ရောက်ခြင်းကို တင်းကြပ်စွာ တားဆီးရပါမည်။
      
      ခြံအတွင်း အသက်အရွယ်နှင့် ထုတ်လုပ်မှု ‌ပေါ်မှုတည်ပြီး တစ်ကောင်အတွက် ထားရှိရမည့် နေရာအကျယ်အဝန်း လုံလောက်ရမည်။
      
      ကျပ်တည်းစွာ ထားရှိခြင်း မပြုရပါ။ 
      
      နွားငယ်၊ မဒန်းငယ်များကို အရွယ်ရောက်ပြီး နွားကြီးများနှင့် နီးကပ်စွာမထားသင့်ပါ။ 
      
      တတ်နိုင်သမျှ ခွဲခြားထားခြင်း (သို့မဟုတ်)သီးခြား‌နေရာပေးပြီး မွေးမြူရမည်။
      
      အသစ်ဝင်ရောက်မည့် နွားများကို ခြံတွင်းရှိနွားများနှင့်မရောပဲ စောင့်ကြည့်နေရာသီးသန့်ထားရှိပြီး တစ်လခန့် အချိန်ယူ စောင့်ကြည့်စစ်ဆေးရပါမည်။

''',
      Color(0xFFD593AA),
      'assets/dodont/gt1.png',
    ),
    Item(
      'ကူးစက်ရောဂါများမှကာကွယ်ရန်',
      '''ရောဂါများကို စောစွာသိရှိပြီး သေချာစွာကုသနိုင်ရန်အတွက် ကျွမ်းကျင်ဆရာဝန်နှင့် ပုံမှန်ပြသစစ်ဆေးရပါမည်။ 

      ကာကွယ်ဆေး၊ သန်ချဆေးကို ပုံမှန်ထိုးနှံပေးရမည်။ ကာကွယ်ဆေးကို ကျန်းမာရေးကောင်းမွန်သော နွားများတွင်သာ ထိုးရမည်။ 
      
      ဖျားနာနေသောနွားများကို မထိုးသင့်ပါ။
      
      ရောဂါဖြစ်ပေါ်လျှင် ဆေးကုသမူ့ကို စနစ်တကျပေးရမည်။ ရောဂါနှင့် ကုသမှုမှတ်တမ်းများအား ထိမ်းသိမ်းထားရှိရမည်။
      
      ကူးစက်ရောဂါဖြစ်ပွားနေခြင်း သံသယရှိပါက တိ-ကု ဆရာဝန်ထံ အမြန်ဆုံး အကြောင်းကြားပြီး အကြံဥာဏ် ရယူရမည်။
      
      မလိုအပ်သော ဆေးဝါးများကို မှားယွင်းသော ဆေးပမာဏတွက်ချက်မှုဖြင့် မိမိဘာသာ ထိုးနှံခြင်း၊ တိုက်‌ကျွေးခြင်မျိုးကို ရှောင်ကြည်ရပါမည်။
''',
      Color(0xFF73C985),
      'assets/dodont/gt2.png',
    ),
    Item(
      'ကပ်ပါးကောင်များမှ ကာကွယ်ရန်',
      '''ခြံအတွင်းနှင့်အပြင်ရှိ အညစ်အကြေးများ၊ နွားခန္ဓာကိုယ်မှ ထွက်သော မစင်၊ ဆီး၊ သွေးနှင့် အခြားအရည်များသည် ရောဂါပိုးများပါရှိရာ အဓိကအရင်းအမြစ်များဖြစ်သည်။

ကပ်ပါးကောင်များ (သန်း၊လှေး၊မွှား) နှိမ်နင်း-ထိမ်းချူပ်ရေးကိုလည်း ပုံမှန်လုပ်ဆောင်ရပါမည်။
      
ဆေးဝါးအကြွင်းအကျန် ကင်းသော၊ ဘေးဥပဒ်ကင်းသော၊ နွား၏ကျန်းမာရေးနှင့်ထုတ်လုပ်မှု မထိခိုက်စေသော အစာများနှင့်သောက်ရေကို လုံလောက်စွာ ထားရှိပေးရမည်။
      
ကျွေးသောအစာပမာဏနှင့် အမျိုးအစားများသည် နွားအတွက်လိုအပ်နေ‌သော အာဟာရများ ပြည့်စုံလုံလောက်စွာ ပေးစွမ်းနိုင်စွမ်းရှိရမည်။      
''',
      Color(0xFFE1BFE3),
      'assets/dodont/gt3.png',
    ),
    Item(
      'နွားမ ကလေး မွေးဖွားရန်',
      '''နွားမ ကလေးမွေးဖွားရခက်နေချိန် ကူညီလုပ်ဆောင်ပေးသူ လုပ်ဆောင်ရမည့်အချက်များ
      
နွားကလေးမွေးခါနီးတွင် အမ တန်ဆာသည် ကျယ်လာပြီး နွားမသည် အားစိုက်ညှစ်လာပါသည်။ 

အားစိုက်ညှစ်ချိန် မိနစ် ၃၀ အတွင်းတွင် နွားကလေးမွေးလာတတ်ပါသည်။
      
သို့သော် မိနစ် ၃၀ ကျော်သော်လည်း နွားကလေးမမွေးလျှင် စစ်ဆေးရန်လိုအပ်ပါသည်။
      
နွားမတမ်းများတွင် မိနစ် ၆၀ ခန့်ကြာပါသည်။
      
နွားမွေးရန် ကူညီလုပ်ကိုင်ပေးမည့်သူသည် နွားကလေး၏ အနေအထားကို စမ်းသပ်ရန်အတွက် လက်ကို သားအိမ်ထဲသို့ မထည့်မီဆပ်ပြာနှင့် သေချာဆေးကြောပြီး သန့်ရှင်းအောင်လုပ်ရန် လိုအပ်ပါသည်။
      
မွေးဖွားရခက်ခဲနေလျှင် ချောဆီအသုံးပြုပြီး နွားကလေးကို ဆွဲထုတ်နိုင်ပါသည်။ 
      
ချောဆီအသုံးပြုသောကြောင့် နွားမ၏ မျိုးပွားလမ်းကြောင်းစုတ်ပြဲခြင်းမှလည်း ကာကွယ်နိုင်ပါသည်။
      
နွားမသည် ရပ်နေမည်ဆိုလျှင် နွားကလေးကို အောက်ဘက်ခေါင်းစိုက်ကျသည့် ပုံစံဖြင့်ဆွဲထုတ်ရန် လိုအပ်ပါသည်။ 
      
နွားမလဲလျောင်းနေမည်ဆိုလျှင် ခန္ဓာကိုယ်နှင့် လိုက်လျောညီထွေသည့် လမ်းကြောင်းအတိုင်းဆွဲထုတ်ရန် လိုအပ်ပါသည်။
      
''',
      Color(0xFF94E7E1),
      'assets/dodont/gt4.png',
    ),
    Item(
      'နို့ဦးရည် တိုက်ကျွေးနည်း',
      '''နွားငယ်လေးတစ်သက်တာ အရေးပါတဲ့ နို့ဦးရည် စနစ်တကျ တိုက်ကျွေးနည်

နွားငယ်လေးမွေးပြီးနောက် မိခင်နွားမကြီးထံက ပထမဆုံးအကြိမ်ရရှိတဲ့နို့ကို နို့ဦးရည်(colostrum) လို့ ခေါ် ပါသည်။
      
နို့ဦးရည်မှာ ပုံမှန်နို့ထက် အာဟာရဓာတ်တွေ ပိုမိုကြွယ်ဝစုံလင်များပြားစွာ ပါဝင်သလို၊ အခြားအရေးကြီးတဲ့ ဓာတ်ပေါင်းတွေလည်း ပါဝင်ပါသည်။
      
နို့ဦးရည်ထဲမှာ ပဋိပစ္စည်းတွေ ပမာဏအများအပြားပါဝင်ပြီး အဲဒါတွေက နွားငယ်လေးကို ရောဂါပိုးမွှားများ ရန်မှ ကာကွယ်ပေးနိုင်ပါသည်။
      
နွားငယ်လေးမွေးဖွားပြီး ၂ နာရီအတွင်း နို့ဦးရည်ကို အနည်းဆုံး ၃ လီတာ တိုက်ကျွေးရပါသည်။ 
      
ဒါမှမဟုတ် နွားငယ်လေး မွေးခါစ ခန္ဓာကိုယ်အလေးချိန်ရဲ့ ၈.၅ ရာခိုင်နှုန်း တိုက်ကျွေးရပါမည်။
      
သတ်မှတ်ချိန်အတွင်း နို့ဦးရည်ကို နွားငယ်လေးက အလုံအလောက် သောက်သုံးနိုင်ဖို့ နို့ဦးရည်ကို ညှစ်ပြီး ဗူးနဲ့ ချိန်တွယ်တိုက်ကျွေးသင့်ပါသည်။
''',
      Color(0xFFE0E0EE),
      'assets/dodont/gt5.png',
    ),
    Item(
      'နွား ခွာနာ လျှာနာ ရောဂါ',
      '''နွား ခွာနာလျှာနာရောဂါလက္ခဏာများ

ထိုင်းမှိုင်းနေတတ်ပြီး ဦးချို၊ ခြေဖျား၊ လက်ဖျားများပူသည်။
      
နာကျင်မှုကြောင့် ခြေထောက်၊ လက်များ မကြာခန လှုပ်နေတတ်သည်။
      
ပါးစပ်ပြင်ပြီး တံတွေးများကာ သွာရည်အမျှင်တန်းများကျတတ်ပြီး အစာစားနှုန်း နည်းသွားတတ်သည်။
      
ပါးစပ်တဝိုက်နှင့် ခွာတဝိုက်တွင် မီးလောင်ဖုသကဲ့သို့ အဖုများပေါက်လာတတ်သည်။

ရောဂါ ဖြစ်ပွားနှုန်းကို လျော့ချရန်နှင့် ကြိုတင်ကာကွယ်ရန်၊

လေဝင်လေထွက်ကောင်းပြီး ခြောက်သွေ့သောခြံ (သို့မဟုတ်) တင်းကုတ်ထဲမှာ ရောဂါဖြစ်သောတိရစ္ဆာန်ကို ခွဲပြီးထားပါ။
      
ခွာကြား၊ ခွာဖနောင့်တို့တွင်ရှိသော အနာများကို စင်ကြယ်စေရန် ရေကြက်သီးနွေးဖြင့် အရင် ဆေးကြောပါ။
      
ရေနွေးဖြင့် ဆေးကြောပြီးပါက ရေတစ်လီတာကို ကျောက်ချဉ်တစ်ကျပ်သားရောစပ်ပြီး ထိုကျောက်ချဉ်ရေဖြင့် ထပ်မံဆေးကြောပေးပါ။
      
လျှာ၊ အာခေါင်၊ ပါးစောင်တို့ကို ကျောက်ချဉ်မှုန့်ဖြင့် တစ်နေ့ နှစ်ကြိမ်ပွတ်ပေးပါ။
      
ပိုးလောက်တွယ်ခြင်းမျိုးရှိခဲ့ပါက ဆေးကတ္တရာလိမ်းပေးခြင်း၊ ပရုတ်နှင့် နှမ်းဆီရောစပ်၍ လိမ်းပေးခြင်းတို့ ပြုလုပ်နိုင်သည်။
      
ဝမ်းချုပ်နေပါက ဆားခါး သို့မဟုတ် အိမ်သုံးဆား ရှစ်ကျပ်သားကို ချင်းစိမ်း၂ ကျပ်သားပြုတ်ရည်ဖြင့် တစ်လီတာဘူးထဲတွင် ရောစပ်ကာ နံနက်၊ ည နှစ်ကြိမ်တိုက်ပေးနိုင်သည်။
      
အစာစားနည်းပါက ထမင်းရည်ထဲကို ထန်းညှက်ရည်နှင့် ဆားထည့်ကာ တိုက်ကျွေးပေးနိုင်ပါသည်။
      
အားဆေးလိုအပ်ပါက ဗီတာမင်စီပါဝင်သော အားဆေးမျိုးကို အသုံးပြုနိုင်ပါသည်။
''',
      Color(0xFFEFE6C7),
      'assets/dodont/gt6.png',
    ),
    Item(
      'နွားငယ်အဆုတ်ရောင်ရောဂါ',
      '''နွားငယ်အဆုတ်ရောင်ရောဂါလက္ခဏာများ

ရောဂါဖြစ်ပွားပါက နွားငယ်သည် အပူချိန်တက်ခြင်း၊ မှိုင်ခြင်း၊ အသက်ရှုပြင်းခြင်း (အဆုတ်ပျက်ဆီးသောကြောင့်) ၊ နှာရည်ကျခြင်း၊ ချောင်းဆိုးခြင်း၊ အစာစားနည်းခြင်း များတွေ့ရမည်။
      
နာတာရှည် အဆုတ်အရောင်သည် ပို၍တွေ့ရများပြီး အစားစားမပျက်ပဲ နှာရည်ကျခြင်း ရှိနေပြီး အသံရှုပြင်းပြီး တခါ တရံ ချောင်းဆိုးခြင်းများ တွေ့ရတတ်ပါသည်။ 

ရောဂါ ဖြစ်ပွားနှုန်းကို လျော့ချရန်နှင့် ကြိုတင်ကာကွယ်ရန်

နို့ဦးတိုက်ခြင်းကို ဂရုတစိုက် လုပ်ဆောင်ပါ။ 
      
သားမခွဲမှီ နွားနို့ တစ်နေ့သုံးပိသာ တိုက်ပါ။
      
တစ်လအောက်နွားငယ်‌လေးများတွင် လုံလောက်သော အနွေးဓာတ်ရအောင် လုပ်ပေးပါ။
      
နွားငယ်လေးများကို စိတ်ဖိစီးမှု အနည်းဆုံး ဖြစ်အောင်ထားပါ။
      
အစာအာဟာရ လုံလောက်စွာ ရရှိရန် စီမံပါ။
      
အစာအာဟာရ လုံလောက်စွာ ရရှိရန် စီမံပါ။
      
နွားငယ်ခြံကို ခြောက်သွေ့ပြီး လေ၀င်လေထွက်ကောင်းအောင် စီမံပါ။
      
လေ၀င် လေထွက်ကောင်းရန်လိုသော်လည်း လေပြင်းတိုက်ခတ်မှုသည် နွားငယ်လေးများ အတွက် မကောင်းပါ။
      
စုံပြုံပြီး မမွေးသင့်ပါ။ လုံလောက်သော နေရာအကျယ်အ၀န်း ပေးပါ။
      
ရောဂါဖြစ်ပွားသော နွားငယ်လေးကို အခြားနွားများနှင့် ခွဲထားသင့်ပါသည်။
''',
      Color(0xFF009688),
      'assets/dodont/gt7.png',
    ),
    Item(
      'နွားမှိုဆိပ်သင့်အန္တရာယ်',
      '''နွားမှိုဆိပ်သင့်သည့်ရောဂါလက္ခဏာများ

ကိုယ်ခံစွမ်းအားကျဆင်းလာပြီး အကြိမ်ကြိမ်နေမကောင်းခြင်း၊ ဝမ်းပျက်ဝမ်းလျှောခြင်း ဖြစ်လာပါမည်။
      
အစာစားနည်းလာပြီး နို့ထွက်နှုန်း၊ မျိုးအောင်နှုန်း ကျလာပါမည်။
      
အာရုံကြောထိခိုက် အားနည်းလာပြီး ခန္ဓာကိုယ်ပြင်ပ အစိတ်အပိုင်းများ တုန်ခြင်း၊ တက်ခြင်းများ ဖြစ်လာပါမည်။
      
ခန္ဓာကိုယ်ပြင်ပ အစွန်အဖျားအစိတ်အပိုင်းများဖြစ်သော နားရွက်၊ အမြီး၊ ခြေထောက်များတွင် အနာများဖြစ်ပေါ်ပျက်စီးခြင်း၊ ပါးစပ်တဝိုက်တွင် အရည်ကြည်ဖုအနာများ ဖြစ်ပေါ်လာတတ်ပါမည်။

ရောဂါဖြစ်ပွားရသည့်အကြောင်းအရင်းမျာ
      
မှိုပေါက်နေသောအစာများကို ကျွေးမွေးခြင်းဖြင့် နွားတွင် မှိုဆိပ်သင့်ရောဂါ ဖြစ်ပွားရသည်။
      
ပတ်ဝန်းကျင် စိုထိုင်းဆမြင့်မားခြင်းနှင့် အစာအတွင်းစိုထိုင်းဆမြင့်မားခြင်းမှ မှိုပေါက်ဖွားနှုန်းကို များစေနိုင်ပါသည်။
      
အစာအတွင်း မှိုပေါက်နေခြင်းကို သာမန်မျက်စိဖြင့်မမြင်နိုင်၊ အနံ့ခံခြင်းဖြင့် မသိနိုင်၊ အရောင်အဆင်းကြည့်ခြင်းဖြင့် မသိနိုင်ပေ။ထိုအစာမျိုးကို မကျွေးဘဲ ပယ်ရပါမည်။
      
မှိုဆိပ်ကင်းစင်တဲ့ အစာကိုသာကျွေးရပါမည်။
''',
      Color(0xFF4CAF50),
      'assets/dodont/gt8.png',
    ),
    Item(
      'နွားကလေးဝမ်းလျောခြင်း',
      '''ဝမ်းပျက်ဝမ်းလျောခြင်း ဖြစ်စေသည့် အကြောင်းအရင်းများ

တိုက်ကျွေးသည့် နို့ဦးရည်ပမာဏ မလုံလောက်ခြင်း
      
နို့ဦးရည် အရည်အသွေးမကောင်းခြင်း/ သန့်ရှင်းမှုမရှိခြင်း
      
မွေးဖွားစဉ် ခက်ခဲခြင်း
      
ပတ်ဝန်းကျင် သန့်ရှင်းမှုအားနည်းခြင်း
      
ရာသီဥတု အေး၍စိုစွတ်ခြင်း
      
နေရာကျဉ်းကျဉ်းတွင် အကောင်ရေများခြင်း
      
ဝမ်းပျက်ဝမ်းလျောခြင်း ဖြစ်စေသည့်ရောဂါလက္ခဏာများ

ဝမ်းလျောခြင်း ( တခါတရံ သွေး၊ အချွဲများပါခြင်း)
      
ရေဓာတ်ဆုံးရှုံးခြင်း
      
အမွေးကြမ်းခြင်း
      
ခန္ဓာကိုယ်အလေးချိန် လျော့ကျခြင်း
      
အဖျားတတ်ခြင်း
      
သေဆုံးခြင်း
''',
      Color(0xFFF48FB1),
      'assets/dodont/gt9.png',
    ),
    Item(
      'ကိုယ်ဝန်ဆောင်ဆိတ်',
      '''ကိုယ်ဝန်ဆောင်ဆိတ်မကြီးကို ကာကွယ်ရမယ့်နည်းလမ်းများ
      
နေ့စဉ်လှုပ်ရှားမှုပြုလုပ်ပေးရပါမယ်။ 

ကိုယ်ဝန်ရင့်လာတာနဲ့ အမျှ စွမ်းအင်နဲ့ အသားဓာတ်ကို ဖြည့်စွက်ကျွေးမွေးရပါမယ်။ 

ဆီလီနီယံ ချို့တဲ့တဲ့ ဧရိယာဖြစ်ပါက ဗီတာမင် အီးနဲ့ ဆီလီနီယံကို ကလေးမဖွေးမွားမီ ရက် ၆၀ အလိုမှာထည့်ကျွေးရပါမယ်။ 

ဆေးအဆမများစေရန်လည်း ဂရုပြုရမှာဖြစ်ပြီးတော့ ရုတ်တရက်သေဆုံးခြင်းနဲ့ အဆိပ်သင့်၍ သေဆုံးခြင်းကို တွေ့ရှိရပါက ကလေးမမွေးမီ ၃ပတ်အလိုမှာ Clostridium Perfriengens C နဲ့ D ကိုထိုးပေးရပါမယ်။

ဆိတ်မကြီးကလေးမွေးပြီးမှ သံချဆေးကျွေးခြင်းသည် ပိုကောင်းပြီး ကလေးမွေးပြီးချိန်သည် သံကောင် အများဆုံး ကာလဖြစ်ပါသည်။

ဆိတ်မကြီးကို သံချပေးခြင်းကြောင့် ဆိတ်ကလေးငယ်ကို ဖျားနာဒဏ်မခံရစေနိုင်ပါ။
''',
      Color(0xFFFFCCBC),
      'assets/dodont/gt10.png',
    ),
    Item(
      'ဆိတ်ငယ်ကာကွယ်ရန်',
      '''တစ်နှစ်ပတ်လုံးစာ လုံလောက်သော ကာကွယ်ဆေးထိုးခြင်းကို လိုက်နာဆောင်ရွက်ရပါမည်။ 

မေးခိုင်ရောဂါ ကာကွယ်ဆေးကို ၀.၅ မီလီမီတာနှုန်းဖြင့် ၄ပတ်ခြားပြီး ၂ကြိမ်ထိုးပေးရပါမည်။
 
ကူးစက်တတ်သော ပါးစပ်နာရောဂါ (ပသက်) ကို အမြီးအောက်ဘက် သို့မဟုတ် တံတောင်ဆစ်ကွေးရဲ့ အောက်ဘက်အရေပြားအောက်တွင် ကာကွယ်ဆေး ထိုးနိုင်ပါသည်။

ဆေးထိုးထားသောနေရာကို ၃ ရက်မြောက်နေ့တွင် အနာဖေးရှိ၊ မရှိ သေသေချာချာ စစ်ဆေးရပါမည်။

အနာဖေးပေါ်လာခြင်းသည် ကာကွယ်ဆေးအောင်မြင်သော လက္ခဏာဖြစ်၍ ရောဂါအဖြစ်များသော နေရာတွင် ၂နှစ်ခြားပြီး နောက်တစ်ကြိမ် ကာကွယ်ဆေးထိုးပေးရပါမည်။

''',
      Color(0xFFCDDC39),
      'assets/dodont/gt11.png',
    ),
    Item(
      'ဆိတ်ပါးသက်နာရောဂါ',
      '''ဆိတ်ငယ်ကလေးများတွင် အဖြစ်များသော ပါးသက်နာရောဂါဖြစ်စေသည့် အကြောင်းအရင်းများမှာ

ခံနိုင်ရည်အလွန်ရှိပြီး ခြံတွင်ကာလကြာရှည်စွာနေနိုင်သော ဗိုင်းရပ်စ်ပိုးတစ်မျိုးကြောင့် ဖြစ်ပွားရပါသည်။
      
ရောဂါ ၁ ကြိမ်ဖြစ်ပွားပြီးပါက ဗိုင်းရပ်စ်ပိုးသည် ခြံတွင်အမြဲတမ်း ရှိနေမည် ဖြစ်ပါသည်။
      
ရောဂါလက္ခဏာများမှာ
      
ဆိတ်ငယ်ကလေးများ၏ ပါးစပ်တွင် အနာဖြစ်နေခြင်းကို တွေ့ရပါမည်။
      
ခွာနာလျှာနာရောဂါနှင့် မှားနိုင်သော်လည်း ပါးသက်နာမှာ ဆိတ်ငယ်လေးများ(အထူးသဖြင့် နို့စို့အရွယ်ဆိတ်ငယ်ကလေးများ)တွင်သာ တွေ့ရတတ်ပြီး ပါးစပ်တွင်သာ ဒဏ်ရာအများဆုံး တွေ့ရပါသည်။
      
ခွာတွင် ဒဏ်ရာများကို တွေ့ရလေ့ မရှိပါ။

ရောဂါကူးစက်ပုံမှာ

ဗိုင်းရပ်စ်ပိုးများကို ဆိတ်ငယ်ကလေးများက စားမိရာမှ စတင်ကူးစက်ပြီး ပါးစပ်တွင်ပြည်ဖုများ စတင်ဖြစ်ပေါ် လာစေပါသည်။
      
ပြည်ဖုများသည် ပေါက်သွားပြီး အနာဖေးအဖြစ် (၁-၂) ပတ်ခန့် ကျန်ရှိနေနိုင်ပါသည်။
      
အနာဖေးဖတ်များ မြေကြီးပေါ်သို့ ကျသွားသည့်အခါ ဗိုင်းရပ်စ်များပါသွားပြီး ၎င်းတို့သည် မြေကြီးပေါ်တွင် နှစ်ပေါက်အောင် ရှင်သန်နေနိုင်ကြပါသည်။
      
ဆိတ်ငယ်ကလေးက နို့စို့သည့်အခါ ဆိတ်မကြီး၏ နို့တိုင်သို့ ရောဂါကူးသွားပြီး အနာဖြစ်ပေါ်လာစေတတ်ပါသည်။
''',
      Color(0xFFFFCCBC),
      'assets/dodont/gt12.png',
    ),
    Item(
      'ဆိတ်ပါးသက်နာရောဂါ',
      '''ဆိတ်ပါးသက်နာရောဂါ ကာကွယ်ခြင်း
      
ပါးသက်နာရောဂါကို ကာကွယ်ရန်အတွက် ပိုးရှင်ကာကွယ်ဆေးရှိပြီး ပေါင်နှင့်လက်ပြင်အတွင်းပိုင်းတွင် ဒဏ်ရာအသေးစားပြုလုပ်၍ ကာကွယ်ဆေးကို လိမ်းပေးရပါသည်။

ဆိတ်ပါးသက်နာရောဂါ ကုသခြင်း

အနာများအား ဘက်တီးရီးယားပိုးများ ဝင်ရောက်လာပါက ပဋိဇီဝလိမ်းဆေးများဖြင့် ကုသနိုင်ပါသည်။
      
ရောဂါဖြစ်နေချိန်အတွင် ဆိတ်ကလေးများ ပုံမှန်နို့စို့နိုင်ရန် စီမံပေးရမည်ဖြစ်ပြီး တခါတရံ ဆိတ်မကြီး၏ နို့အုံတွင် အနာများဖြစ်ပေါ်နေပါက ပုလင်းဖြင့်တိုက်ရပါမည်။
      
တခါတရံတွင် Contagious ecthyma သည် လူသို့ကူးစက်တတ်ပြီး အထူးသဖြင့် လက်ချောင်းများတွင် နာကျင်သော အနာများဖြစ်ပေါ်စေနိုင်ပါသည်။
      
၎င်းအနာများသည် (၁-၄)ပတ်အတွင်း ကျက်သွားမည် ဖြစ်ပါသည်။
      
ထိုသို့ လူကိုကူးစက်ခြင်း မရှိစေရန် ရောဂါဖြစ်နေသော ဆိတ်မကြီးနှင့် ဆိတ်ကလေးများကို ကိုင်တွယ်ပါက ရာဘာ လက်အိတ်စွတ်၍ ကိုင်တွယ်သင့်ပါသည်။

''',
      Color(0xFF4CAF50),
      'assets/dodont/gt13.png',
    ),

    Item(
      'ဆိတ်အဆုတ်ရောင်ရောဂါ',
      '''

ရောဂါဖြစ်စေနိုင်သော အကြောင်းအရင်းများ
      
ဒီရောဂါပိုးက အာသီးမှတဆင့် အဆုတ်ကိုဝင်ရောက်ပြီး အဆုတ်ရောင်ခြင်းကို ဖြစ်စေပါတယ်။
      
အဆုတ်ကနေတဆင့် ရောဂါပိုးက သွေးထဲကိုရောက်လာပြီး သွေးဆိပ်သင့်စေနိုင်ပါတယ်။
      
ရောဂါပိုးက အဆစ်အမြစ်တွေမှာ စုနေတတ်ပြီး ခြေမထောက်နိုင်၊ ယိုင်တာမျိုးလည်း ဖြစ်တတ်ပါတယ်။
      
ရောဂါလက္ခဏာများ

ပထမတမျိုးကဖျားမယ်၊၊ အစာမစားဘူး။ ခြေထောက်မထောက်နိုင်ခြင်း၊ နောက်ယိုင်ခြင်း၊ အခြားဆိတ်များထက် ပိုမောတတ်ခြင်းတို့ ဖြစ်ကြပါမယ်။
      
သေဆုံးမှုမရှိပေမယ့် ကြီးထွားနှုန်း ရပ်တန့်သွားပါမယ်။
      
acute type လို့ခေါတဲ့ ပိုပြီးပြင်းထန်တဲ့ အခြေအနေဖြစ်ပါတယ်။ အဖျားကြီးခြင်း၊ အစာမစားခြင်း၊ အသက်ရှုမဝခြင်း စတဲ့ လက္ခဏာတွေပြပြီး ရုတ်တရက် သေတတ်ပါတယ်။ 

ကာကွယ်ကုသနည်း
      
မိုးတွင်းနဲ့ ဆောင်းရာသီမှာ ဒီရောဂါက ပိုအဖြစ်များပါတယ်။ မိုးများတဲ့ဒေသတွေနဲ့ အအေးပိုတဲ့ရာသီတွေမှာ ဒီရောဂါအတွက် ကာကွယ်ဆေး ထိုးထားသင့်ပါတယ်။
      
ဆိတ် အသက် ၂လ (သို့) ၃လ အရွယ်မှစပြီး အဆုတ်ရောင်ရောဂါကာကွယ်ဆေး ထိုးပေးထားခြင်းဖြင့် ကာကွယ်ပေးနိုင်မှာဖြစ်ပါတယ်။
''',
      Color(0xFF8BC34A),
      'assets/dodont/gt14.png',
    ),
    Item(
      'ဆိတ် ဝဲစွဲရောဂါ',
      '''ဆိတ်များတွင် အဖြစ်များသော ဝဲစွဲခြင်းရောဂါဖြစ်ရသည့် အကြောင်းရင်းများ
      
ဝဲမှာ မွှားအငယ်လေးများကြောင့် ဖြစ်ရပါသည်။
      
စားမြုံပြန်သောတိရစ္ဆာန်အားလုံးတွင် ဖြစ်တတ်သော်လည်း ဆိတ်များတွင် အဖြစ်များပါသည်။
      
တိရစ္ဆာန်တစ်ကောင်မှ အခြားတိရစ္ဆာန်များဆီသို့ လွယ်ကူစွာပျံ့နံ့သည်။ လူကိုလည်း ကူးစက်နိုင်ပါသည်။
      
ရောဂါလက္ခဏာများ

ဝဲရောဂါဖြစ်ပါက ဆိတ်၏ ဦးခေါင်းနှင့် လည်ပင်းတွင် ဝဲစွဲခြင်းကြောင့် ယားယံသဖြင့် ပွတ်တိုက်ထားသော ဒဏ်ရာများ ရှိနေသည်။
      
ဆိတ်က ဝဲယားသဖြင့် မိမိကိုယ်ကို ပွတ်တိုက်သည်။ ကုတ်ဖဲ့သည်။
      
ဆိတ်ခန္ဓာကိုယ်မှ အမွှေးများ ကျွတ်ကျ ပြုတ်ကျသည်။
      
ဆိတ်မှာ အားနည်းသည့် လက္ခဏာ ပေါ်နေသည်။
      
      
ကာကွယ်ခြင်း

ဆိတ်၏ နေထိုင်ရာနေရာအနှံ့ကို သန့်ရှင်းအောင် ထားပါ။ ခြောက်သွေ့အောင် ထားပါ။
      
ဝဲစွဲသော ဆိတ်အား အခြားဆိတ်များနှင့် ခွဲထားပေးပါ။
      
ဝဲစွဲနေသော ဆိတ်ကို မျိုးပွားခြင်းအတွက် အသုံးမပြုပါနဲ့။
      
ဝဲမှာ လူတို့အား လွယ်ကူစွာ ကူးစက်တတ်သောကြောင့် ရောဂါဖြစ်နေသော ဆိတ်ကို ကုသပေးစဥ်ကာလ၌ပင် သတိပြုရန် လိုသည်။
    
ကုသခြင်း

ဝဲစွဲနေသော ဆိတ်ကိုကုသစဥ် လက်ကို ပလတ်စတစ် စွပ်ထားခြင်း သာမက ဘရပ်(ရှ်)ဖြင့် ဆေးကို သုတ်လိမ်းပေးပါ။
      
ဆိတ်တစ်ကောင်အတွက် အသုံးပြုထားသောဆေးကို အခြားတစ်ကောင်သို့ ဆက်မသုံးသင့်ပါ။
      
ဆေးများကို အသုံးမပြုမီ လိုသလောက်သာ သီးသန့်ခွဲထားရန် လိုအပ်ပါသည်။
      
အုန်းမုတ်ခွက်ကို ပြာချပြီး အုန်းသီးဖြင့် ရောမွှေပါ။ ထို့နောက် ဝဲစွဲနေသာနေရာကို နေ့စဥ်တစ်ကြိမ် သုတ်လိမ်းပေးပါ။ 
      
ကန့်မှုန့်ကို စားဆီတစ်မျိုးမျိုးဖြင့် လူးပြီး တိရစ္ဆာန်၏ ဝဲစွဲနေသော နေရာကို ပွတ်ပေးပါ။ 
      
ကန့်မှုန့် (၃၀)ဂရမ်ကို အင်ဂျင်ဝိုင် (၁၀၀)စီစီနှင့် ရောပြီး ဝဲစွဲသည့်နေရာကို နေ့စဥ်(၁)ကြိမ် လူးပေးပါ။ ဝဲပျောက်သည်အထိ ပြုလုပ်ပေးပါ။

တမာရွက်နု (သိုမဟုတ်) ရွက်ရင့် လက်တစ်ဆုပ်ကို လေသလပ်အခြောက်ခံပြီး ထောင်းပါ။ ရေအနည်ငယ်ရောပြီး ဝဲစွဲသည့်နေရာများကို ပွတ်တိုက်ပေးပါ။
      
သင်္ဘောမဲဇလီ(ပွေးကိုင်းကြီး)ရွက် လက်တစ်ဆုပ်ကို ထောင်းပြီး ရေသင့်ရုံဖျော်ပါ။
      
ဝဲစွဲသည့်နေရာကို နေ့စဥ်တစ်ကြိမ် ကျ လူးပေးပါ။ ဝဲလုံးဝပျောက်သည်အထိ ပြုလပ်ပေးပါ။ 
''',
      Color(0xFFCDDC39),
      'assets/dodont/gt15.png',
    ),
    Item(
      'ကြက်ဝမ်းကျရောဂါ',
      '''ရောဂါဖြစ်ပွားရသည့် အကြောင်းရင်းများ

အဓိကအားဖြင့် ကြက်ဝမ်းကျရောဂါကို ဖြစ်စေတတ်သော ရောဂါပိုးများကို ရှူရှိုက်မိ၍ ဖြစ်တတ်ပါသည်။
      
ရာသီဥတု အပြောင်းအလဲများ၊ အစားအသောက်အပြောင်းအလဲများနှင့် ကြက်များအားနည်းလာသောအခါတွင်လည်း ရောဂါဖြစ်ပွားတတ်ပါသည်။
      
ရောဂါလက္ခဏာများ
      
ခေါင်းငိုက်စိုက်ကျ၍ အပူချိန်တက်ပြီး အမောက်နှင့် ပါးပြင်များမှာ အညိုရောင်ဖြစ်နေတတ်ပါသည်။
      
ရောဂါပိုးသည် ခြေထောက်နှင့် တောင်ပံကြွက်သားများကို တိုက်ခိုက်ခြင်းကြောင့် ခြေထောက်များမှာ ယောင်ရမ်း၍ သန်စွမ်းမှု မရှိတော့ပါ။
      
အစာစားစဥ် အတောင်ခါ၍သော်လည်းကောင်း၊ အိပ်တန်းဝင်ချိန်တွင် အိပ်စင်ပေါ်မှ ပြုတ်ကျ၍သော်လည်းကောင်း သေတတ်ပါသည်။
      
မသေမီ ဝမ်းပျော့ပျော့သွားတတ်၍ ဝမ်းမှာအစိမ်းရောင်ရှိတတ်ပြီး အနံ့မှာ အလွန်ဆိုးဝါးလှပါသည်။
      
ကာကွယ်ကုသနည်း

ကြက်ခြံသန့်ရှင်းရေးနှင့် ရောဂါပိုးမွှားနှိမ်နင်းရေးသည် အဓိကဖြစ်ပါသည်။ အမြဲသန့်ရှင်းမှုရှိခြင်းနှင့် ပိုးသတ်နေခြင်းဖြင့် ရောဂါဖြစ်ပွားမှုကို ကာကွယ်နိုင်ပါသည်။
      
ရောဂါဖြစ်ပွားနေသည့် ကြက်များကို သီးခြားစီ ခွဲထားရမှာဖြစ်ပြီး သေဆုံးသွားသောကြက်များကိုလည်း မြေမြှုပ်ပေးရပါမည်။
      
ကြက်ခြံရှိ သောက်ရေခွက်၊ အစာခွက်တို့ကို ပိုးသတ်ဆေးဖြင့် သန့်စင်ရန် လိုအပ်ပါသည်။
      
ကြက်ခြံသန့်ရှင်းရေး အလေးထားဆောင်ရွက်ရေး၊ အချိန်မှန် ပိုးသတ်ပေးရေးနှင့်ကြိုတင်ကာကွယ်ဆေးများ ထိုးနှံပေးခြင်းဖြင့် ရောဂါဖြစ်ပွားမှုကို ကာကွယ်နိုင်ပါသည်။
          
ကြက်ဝမ်းကျရောဂါနှင့် သွေးဝမ်းတို့ကိုကုသရာမှာ အေဗီချိုင်းနားဆေးမှုန့် (Aviochina Powder) ကလည်း အစွမ်းထက်လှပါသည်။ ကြက်များ သွေးဝမ်း မဖြစ်အောင်၊ ဝမ်းကျရောဂါ မဖြစ်အောင် ကာကွယ်သည့်အနေဖြင့် ဆေး ၁ ထုပ်ကို ငှက်ပျောဖူးပုလင်းအလုံး ၃၀ ဖြင့် ထည့်ဖျော်ပြီး ရက်ပေါင်း ၆၀ နီးပါး တိုက်ကျွေးနိုင်ပါသည်။
      
မွေးမြူရေးသမားအချို့ကတော့ ကြက်ဝမ်းကျရောဂါအတွက် ထရစ်ပယ်ဆာလ်ဖာ(Triple Sulfa)ကို ကြက်စာ ၃ ပိဿာတွင် ဆေး ၁၆ ပြားထည့်ပြီး ၃ ရက်မှ ၅ရက်ထိတိုက်ကျွေးကြပါသည်။
''',
      Color(0xFFB388FF),
      'assets/dodont/gt16.png',
    ),
    Item(
      'SMS ရောဂါလက္ခဏာများ',
      '''အသားစားကြက်များကို ရုတ်တရက်သေဆုံးစေသည့် SMSရောဂါလက္ခဏာများ (Type A)
      
မှောက်လျက်ခြေထောက်ကို ရှေ့သို့ဆန့်အိပ်ခြင်း
      
ခန္ဓာကိုယ်တုန်ခြင်း
      
အာရုံကြောလက္ခဏာပြခြင်း၊ ဒယီးဒယိုင်လမ်းလျှောက်ခြင်း (Encephalomyelitis ရောဂါနှင့်ဆင်တူသည်)
အချို့ မျက်စိကောင်းစွာ မမြင်ရခြင်း
      
တက်ခြင်း၊ ကြက်ငယ်များတွင် သွေးတွင်းသကြားဓာတ်ကျခြင်း (ပုံမှန် 137mg/cc ရှိသော်လည်း ယင်းရောဂါဖြစ်ပွားချိန်တွင် 30mg/cc သာရှိ)ပြန်ကောင်းသောကြက်တို့ ကြီးထွားမှု သိသာစွာနည်းသွားခြင်း
      
အသံကျယ်လောင်စွာ တကျီကျီမြည်လျက် ပတ်ပြေးကာ သေဆုံးခြင်း
      
 ရောဂါလက္ခဏာစတင်တွေ့ရပြီး ၂-၆ နာရီအတွင်း သေဆုံးတတ်ခြင်း
      
သေနှုန်း ၁ ရာခိုင်နှုန်းခန့်ရှိပြီး ၃ ရက်ထက်ပိုပြီး မဖြစ်ပွားတတ်ပါ။
      
ရောဂါလက္ခဏာများ (Type B)
      
Type A ကဲ့သို့ ရောဂါလက္ခဏာများမပြပါ။
      
၁-၂ ပတ်သားအရွယ်တွင် သေနှုန်း သိသာစွာများတတ်သည်။
      
၃ ရက်ထက်ပို၍ ရောဂါဖြစ်နိုင်သည်။ သို့သော် သေနှုန်းမှာမူ ၀.၅ ရာခိုင်နှုန်းသာရှိသည်။
''',
      Color(0xFFCFD8DC),
      'assets/dodont/gt17.png',
    ),
    Item(
      'SMS ရောဂါကို ကာကွယ်ကုသနည်း',
      '''ကုသခြင်းနှင့်ကာကွယ်ခြင်း
      
သွေးတွင်း ရုတ်တရက်သကြားဓာတ်လျော့ကာ သေဆုံးတတ်သောကြောင့် Glucose 2% (သောက်ရေတစ်ဂါလံလျှင် ၉၀ ဂရမ်နှုန်း) ၂ ရက်ဆက်တိုက်ပါ။
      
နောက်ဆက်တွဲရောဂါထိန်းနိုင်ရန် Enrofloxacin (EN) ကို သောက်ရေ တစ်ဂါလံလျှင် ၂.၅ ဂရမ်နှုန်း ၃ ရက်ဆက်တိုက်ပါ။
      
ကြက်ငယ်အသက်ရက်အလိုက် အပူချိန်ညီအောင် အနွေးပေးပါ။
      
ဗီတာမင် E နှင့် Selenium ဆေးတိုက်ပါ။ ဗီတာမင်အားဆေးများပေးပါ။
      
ခြံတွင်းကြွက်၊ darking beetle (ပိုးအမဲကောင်) များ ဝင်ရောက်မှုကို ထိန်းချုပ် နှိမ်နင်းပါ။
      
ညအချိန် အလင်းရောင် ကန့်သတ်ပေးပါ။ ၁-၂ နာရီ မီးပိတ်ခြင်းသည် Growth Hormone level ကို မြင့်စေပြီး သွေးတွင်းသကြားဓာတ်နည်းမှုကို သက်သာစေသည်။
''',
      Color(0xFF7986CB),
      'assets/dodont/gt18.png',
    ),
    Item(
      'ကြက်နှလုံးအရည်စုခြင်းရောဂါ',
      '''ကြက်နှလုံးအရည်စုခြင်းရောဂါလက္ခဏာများ

ကြက်များပူးကပ်နေခြင်း
      
အမွှေးအတောင်မသပ်မရပ်ဖြစ်ခြင်း
      
အစာစားနှုန်းကျခြင်း/လျော့ခြင်း
      
ဝမ်းသွားလျှင် အဝါရောင်အချွဲပါခြင်း
      
နှလုံးထိပ်ရှိ နှလုံးဖုံးမြှေးအိတ်အတွင်း အဝါရောင်အရည်စုမိနေခြင်း
      
နှလုံးနှင့် နှလုံအဆီတွင် အပ်ဖျားသဏ္ဍန်သွေးယိုထွက်ခြင်း
      
အသဲရောင်ခြင်း၊ကျွတ်ဆပ်ကြေမွလွယ်ခြင်း၊အရောင်ဖျော့ခြင်း
      
အဆုပ်ရောင်ခြင်းသွေးခဲခြင်း
      
သိုင်းမတ်ဂလင်းနှင့် ဖင်ဆီဖူးသေးငယ်ရှုံ့သွားခြင်း

ကာကွယ်ထိန်းချုပ်ခြင်း
      
ကြက်ခြံပတ်ဝန်းကျင် သန့်ရှင်းပိုးသတ်ခြင်း
      
ကြက် မရောက်မီ အစာခွက်ရေခွက်အသုံးအဆောင်များအားလုံး ပိုးသတ်ထားခြင်း
      
ဇီဝလုံခြုံရေးအစီအစဉ်ကောင်းများကို သေချာလိုက်နာခြင်း
      
အရည်ကြည်စုဆောင်းခြင်းကိုကာကွယ်ရန် အသဲဆေး / ဆီးရွှင်ဆေးများပေးခြင်း
      
သွေးအားကောင်းစေသောဆေး/ ဗီတာမင်အီးတို့ကို ပေးခြင်း
      
ခြံတွင်း လေဝင်လေထွက်ကောင်းစေခြင်း
      
''',
      Color(0xFF64FFD4),
      'assets/dodont/gt19.png',
    ),
    Item(
      'ကြက်ကျောက်ရောဂါ',
      '''ဆောင်းရာသီတွင်ဖြစ်တတ်သော ကြက်ရောဂါများကို ကာကွယ်ကုသနည်းများ

ရောဂါလက္ခဏာများ

ကြက်မျက်လုံး၊ မျက်နှာ၊ ပါးပျဉ်း၊ နှုတ်ခမ်းထောင့်များပေါ်တွင် အနာဖုများတွေ့ရတတ်ပြီး အရပ်အခေါ် “နှင်းသီး”ဟု ခေါ်ကြပါသည်။

ရောဂါအမျိုးအစားများ
      
အရေပြားပေါ်တွင် ဖြစ်တတ်သော အခြောက်အမျိုးအစားနှင့် အာခေါင်၊ မျက်လုံးတွင်ဖြစ်တတ်သော အစိုအမျိုးအစားဟူ၍ (၂)မျိုးရှိပါသည်။

ကုသနည်း
      
အရေပြားပေါ်တွင် ဖြစ်တတ်သော အခြောက်အမျိုးအစားကို Chikusan ဆေးဖြင့် သုတ်လိမ်းပေးပါက ပျောက်ကင်းနိုင်ပါသည်။
      
အာခေါင်၊ မျက်လုံးတွင်ဖြစ်တတ်သော အစိုအမျိုးအစားမှာ ကုသရခက်ခဲပြီး ဗိုင်းရပ်စ်ဖြစ်၍ ကူးစက်မြန်ပါသည်။
      
ထို့ကြောင့် Chikusan တိုက်ကျွေးခြင်းဖြင့် ကိုယ်ခံအားမြှင့်ပေးရန်လိုအပ်ပါသည်။
''',
      Color(0xFFCDDC39),
      'assets/dodont/gt20.png',
    ),
    Item(
      'ကြက်သန်ကောင်ရောဂါ',
      '''ကြက်သန်ကောင်ရောဂါမှာ ခြံလှောင်မွေးသော ဥစားကြက်နှင့် အသားစားကြက်များတွင် အဖြစ်များပါသည်။

ရောဂါဖြစ်ပွားသည့် အကြောင်းရင်း

Ascaridia-galli (ခေါ်)သန်လုံးကောင်ရောဂါမှာ ကြက်၏အစာလမ်းကြောင်းတစ်လျှောက် အူလမ်းကြောင်းပိတ်ဆို့ကုန်သည်အထိဖြစ်စေပြီး သေကြေဆုံးရှုံးနိုင်ပါသည်။

ရောဂါလက္ခဏာများ    

ကြက်၏အူအတွင်း အရွယ်ရောက်ပြီးသန်ကောင်များ စွဲကပ်ပါက အစာချေဖျက်နိုင်စွမ်းကျပြီး ကြက်ထံမှ အာဟာရကို သန်ကောင်က ရယူစားသုံးခြင်းကြောင့် ကြက်များကြီးထွားနှုန်းနှေးခြင်း၊ထုတ်လုပ်မှု ကျဆင်းခြင်း၊ ကိုယ်ခံစွမ်းအားကျခြင်းနှင့် သေဆုံးခြင်းများဖြစ်နိုင်ပါသည်။

ကုသနည်း
      
အရွယ်ရောက်ပြီး ကြက်တစ်ကောင်လျှင် ဘောစကိုင်းရွက် အစိမ်း(၂)ဂရမ်( ဇီးသီးခန့်)ကို တစ်ရက်လျှင် ၂ ကြိမ်နှုန်းဖြင့် ၂ ရက်ဆက် တိုက်ကျွေးခြင်းဖြင့် သန်ချနိုင်သည်။
      
ဘောစကိုင်းရွက်၊ နာနတ်ရွက်တို့ကို အမှုန့်လုပ်၍ ကြက်စာတွင် ထည့်သွင်းကျွေးမွေးခြင်းဖြင့်လည်း ကုသနိုင်ပါသည်။

''',
      Color(0xFFFFE082),
      'assets/dodont/gt21.png',
    ),
    Item(
      'ကြက်များရောဂါကာကွယ်ရန်',
      '''မွေးမြူရေးကြက်များ ရောဂါမဝင်စေရန် ကြိုတင်ကာကွယ်သင့်သည့်အချက်များ

အဖြစ်များလေ့ရှိသည့် ရောဂါများကို သိရှိရန်နှင့် သင့်လျော်သည့် ကာကွယ်ဆေးထိုး အစီအမံများ ချမှတ်ရမည်။

ကြက်ခြံသည် မြင့်ပြီးခြောက်သွေ့ရမည်။ ကောင်းမွန်သော အညစ်အကြေးစွန့်ပစ်မှုနှင့်အထူလမ်း အနည်းဆုံး (၃၀) မီတာကွာသင့်သည်။

ကြက်များကို သင့်တော်သည့် နေရာအကျယ်အဝန်းနှင့် လိုအပ်သည်များထားပေးရမည်။ ကြက်များ ရောင်းချပြီးသည်နှင့် ခြံကိုပိုးသတ်ဆေးများဖြင့် သေချာသန့်ရှင်းပေးထားပြီး အတိုင်းအတာတစ်ခုအထိ ခြံကိုကြက် မမွေးဘဲထားရမည်။

ကြမ်းပြင်ကို ချောမွေ့အောင် ကွန်ကရစ်ခင်းပေးထားရမည်။

ခြံအဝင်တွင် ပိုးသတ်ဆေးကန်ပြုလုပ်ပေးထားပြီး အလုပ်သမားများ ၎င်းအပေါ်မှဖြတ်ဝင်ရန်နှင့် ခြံ အတွင်းစီးရန် သီးသန့်ရှုးဖိနပ်များ ထားပေးရမည်။

လေဝင်လေထွက်ကောင်းမွန်နေရမည်။

အခင်းများကို ကောင်းမွန်ရန်နှင့် လိုအပ်ပါက အသစ်လဲပေးရမည်။

အစာခွက်ထဲ ကျန်ရှိနေသော အစာများမပုပ်သိုးစေရန် အစာကျွေးချိန်များ နီးကပ်ရမည်။

ကြောင်၊ ကြွက်၊ ခွေးစသည်တို့ မဝင်အောင် ကာကွယ်ထားရမည်။

အချိန်ကာလပိုင်းခြား၍ အပြင်ကပ်ပါးပိုးသတ်ဆေးများကို အသုံးပြုရမည်။

ကြက်သေ (သို့) နေမကောင်းသော ကြက်များအား ချက်ချင်းဖယ်ရှားပစ်ရန်နှင့် အနက် (၁)မီတာ ကျော်တွင် မြှင့်ပေးရမည်။

''',
      Color(0xFFFFB74D),
      'assets/dodont/gt22.png',
    ),
    Item(
      'အသားတိုးကြက်ရေဖျဉ်းရောဂါ',
      '''အသားတိုးကြက်ရေဖျဉ်းရောဂါလက္ခဏာများ
      
ကြက်များကြီးထွားမှုမြန်သည့် အချိန် (အသက် ၃-၄ ပတ်သား) တွင် -ရုတ်တရက် သေနှုန်းမြင့်ခြင်း
      
ဝမ်းဗိုက်ဖောင်းကားပြီး ကြီးထွားနှုန်းညံ့ခြင်း
      
အသက်ရှူခက်ခဲခြင်း
      
အောက်ဆီဂျင်ပိုရရန် လ‌ည်ပင်းကို ဆန့်ပြီး အသက်ရှူနေခြင်း
      
အချို့ကြက်များ လမ်းမလျှောက်နိုင်ဘဲ လဲနေခြင်း
      
ကုသထိန်းချုပ်ခြင်း
      
ရေဖျဉ်းဖြစ်ရသည့် အဓိကအကြောင်းမှာ ကြီးထွားမှုနှုန်းမြန်ခြင်းကြောင့် ဖြစ်သည်။ ထို့ကြောင့် ကြီးထွားမှုနှုန်းကို လျှော့ရန် ဂျုံ၊ ပြောင်းနှင့် ရောစပ်ထားသော အစာစပ်ဆေးများကို ကြက်များ ပြန်ကောင်းလာသည်အထိ ထည့်ကျွေးပေးရပါမည်။
      
အချို့မှာ အစာကို လျှော့ကျွေးခြင်းဖြင့် ရေဖျဉ်းကြောင့်ဖြစ်သည့် သေနှုန်းကိုလည်း လျှော့ချနိုင်ပါသည်။
      
Vitamin – E + Selenium ကလည်း ရေဖျဉ်းရောဂါ ထိန်းချုပ်ရာတွင် ကောင်းကျိုးရစေပါသည်။
      
Vitamin – C (550ppm) ကို အသုံးပြုခြင်းကလည်း အကျိုးဖြစ်ထွန်းသည်ဟု မှတ်တမ်းများအရ သိရပါသည်။

လိုက်နာဆောင်ရွက်သင့်သည့် အချက်များ
      
အပူချိန်ကို တည်ငြိမ်အောင်ထိန်းပေးပါ။
      
လေအရည်အသွေး ကောင်းမွန်အောင် စီမံပါ။
      
အခင်း၏စိုထိုင်းဆ အမြင့်ဆုံးဖြစ်ပါစေ။
      
ဖိစီးမှုဒဏ်အမျိုးမျိုး (အပူဒဏ်၊ အအေးဒဏ်) လျှော့ချပါ။
      
ကြက်များ ပြွတ်သိပ်မနေပါစေနှင့်။
      
အစာခွက်ထဲတွင် ကြက်စာအမြဲရှိနေပါစေ။
      
အစာနှင့် ရေကို ကြက်များ လွယ်ကူစွာစားသောက်နိုင်သော နေရာလွတ် ရှိပါစေ။
      
တည်ငြိမ်သင့်တင့်သော အလင်းပြင်းအား ရရှိပါစေ။
''',
      Color(0xFFC51162),
      'assets/dodont/gt23.png',
    ),
    Item(
      'ဘဲအအေးမိ၊ ချောင်းဆိုးရောဂါ',
      '''ဘဲ အအေးမိ၊ နှာရည်ယို၊ ချောင်းဆိုးရောဂါလက္ခဏာများမှာ 
      
နှာချေခြင်း၊
      
နှာရည်ယို စီးကျခြင်း၊
      
ခံတွင်းပျက်ခြင်း၊
      
မျက်လုံးတွင် အရည်လည်နေခြင်း၊
      
နှုတ်သီးတွင် အစာများကပ်နေခြင်း၊
      
အမွှေးအတောင်များ တွဲလျားကျနေခြင်းတို့ ဖြစ်ပွားကြပါသည်။
          
ဤရောဂါသည် လေ၊ သောက်ရေနှင့် အစာများမှတဆင့် ကူးစက်ပြန့်ပွားနိုင်ပါသည်။

ဘဲ အအေးမိ၊ နှာရည်ယို၊ ချောင်းဆိုးရောဂါ ကာကွယ်ခြင်း
      
အာဟာရပြည့်ဝသော အစာများကိုကျွေးပါ။
      
သန့်ရှင်းသောရေကိုသာ တိုက်ပါ။
      
ဘဲခြံတွင် ဘဲများကို ကြပ်ညပ်စွာ မထားပါနှင့်။
      
ဘဲခြံနှင့် ခြံဝန်းကျင်ကို သန့်ရှင်းစွာထားပါ။
      
ဆိုးရွားသောရာသီဥတုဒဏ်ကို ခံနိုင်ရည်ရှိစေရေးအတွက် အကာအကွယ်ရအောင် စီမံထားပါ။
      
ဘဲများကို ကာကွယ်ဆေးထိုးရန် လိုအပ်ပါက ကြိုတင်ထိုးနှံပေးပါ။
      
သောက်ရေ ၁ လီတာတိုင်းတွင် နနွင်းမှုန့် လက်ဖက်စားဇွန်း တစ်ဝက်ရောပေးပါ။
      
ဆင်နှာမောင်းပင် (သို့မဟုတ်)ဂွေးရွက်ပြုတ်ရည်ကို တိုက်ထားပေးပါ။
      
 ဘဲ အအေးမိ၊ နှာရည်ယို၊ ချောင်းဆိုးရောဂါ ကုသခြင်း
      
ဂျင်း ၁ ကျပ်သားကို ထောင်းပြီး အရည်ညှစ်ယူပါ။ ယင်းကို ရေ ၂၅၀ စီစီတွင် ကြံသကာ ၁ ကျပ်သားနှင့် ရေဖျော်ပါ။
      
ယင်းနှုန်းအတိုင်းရလာသည့် ဖျော်ရည်ကို ဘဲ ၁၀ ကောင်စာနှုန်းဖြင့် သောက်ရေတွင် ရောတိုက်ပါ။
      
ပဲနံ့သာစေ့ ၁ ကျပ်သားကို ရေ ၁ လီတာနှင့်ပြုတ်ပြီး ရရှိသော အရည်ကို အအေးခံ၍ တိုက်ပါ။ ထိုအရည်ကို သောက်ရေနှင့် ရောပြီး သောက်သုံးစေပါ။ 
      
အရွက်များကိုလည်း အစာနှင့် ရောကျွေးနိုင်ပါသည်။
      
ဆင်နှာမောင်းရွက်(သို့မဟုတ်)ဂွေးရွက် ၁ ဆကို ရေ ၂ ဆရောပြီး ၅ မိနစ်မှ ၁၀ မိနစ်အထိ ကျိုပါ။ 
      
မင်စုတ်ပြွန်(သို့မဟုတ်) အပ်ဖြုတ်ထားသော ပလတ်စတစ်ဆေးထိုးပြွန်ဖြင့် ၁ ရက်လျှင် ၂ ကြိမ်၊ ၃ ကြိမ် တိုက်ပေးပါ။
      
ဤရောဂါကိုကာကွယ်ရန်နှင့် ကုသရန်အတွက် ဘဲ ၁ ကောင်စီ ကို ကြက်သွန်ဖြူ ၁ မွှာကျနှုန်းဖြင့် နေ့စဥ် အစာနှင့် ရောကျွေးနိုင်ပါသည်။
''',
      Color(0xFFFF8A65),
      'assets/dodont/gt24.png',
    ),
    Item(
      'ဘဲများကိုင်တွယ်ဖမ်းဆီးခြင်း',
      '''ဘဲများအား ကိုင်တွယ်ဖမ်းဆီးရာတွင် 
      
ဘဲများကို ကိုင်တွယ်လျှင် သတိထားပြီး ကိုင်ရပါမည်။
      
ဘဲဖမ်းရာတွင် ခြေထောက်နှင့် တောင်ပံများမှ ကိုင်တွယ်ဖမ်းဆီးလျှင် ဘဲမှာနာကျင်၍ အရိုးများကျိုးနိုင်ပါသည်။
      
ခြေထောက်နှင့် တောင်ပံကို ကိုင်တွယ်ဖမ်းဆီးခြင်းမပြုဘဲ လည်ပင်းအောက်ခြေပိုင်းအား ညင်သာစွာဆုပ်ကိုင်ခြင်းဖြင့် ဖမ်းဆီးရပါမည်။
      
၎င်းအပြင် လက်ဖဝါးဖြင့် ခြေထောက်၂ ချောင်းအား ထိန်းချုပ်၍ လက်ဖျံပေါ်တွင် ဘဲရင်ဘတ်အားတင်၍ ဖမ်းသူ၏ခန္ဓာကိုယ်နှင့် ကပ်ထားခြင်းဖြင့် ညင်သာစွာ ကိုင်တွယ်နိုင်ပါသည်။

''',
      Color(0xFFFF5252),
      'assets/dodont/gt25.png',
    ),
    Item(
      'ဝက်နားရွက်ပြာရောဂါ',
      '''ဝက်မွေးသူတွေ သတိပြုသင့်တဲ့ ဝက်နားရွက်ပြာရောဂါလက္ခဏာမျာ
      
ရောဂါဖြစ်ပွားသောဝက်သည် အစာစားပျက်သည်။
      
ဖျားနာသည်။
      
ကိုယ်အပူချိန် ၄၀ မှ ၄၂ ဒီဂရီစင်တီဂရိတ်အထိ ရှိလာမည်။
နှာရည်ယိုခြင်း၊ နှာချေခြင်းများ ဖြစ်လာမည်။
      
အသက်ရှူကျပ်ပြီး မျက်မြှေးရောင်ခြင်း၊ မျက်စိနာခြင်းများ ဖြစ်လာမည်။
      
အရေပြားများ နီလာပါမည်။
      
နားရွက်၊ ဝမ်းဗိုက်နှင့် အမတန်ဆာများတွင် အနီရင့်ရောင်၊ အပြာရောင်အကွက်များ ဖြစ်လာပါမည်။
      
ဝမ်းလျှောတတ်ပါသည်။
      
ခန္ဓာကိုယ်ဒယီးဒယိုင်ဖြစ်၍ နောက်ပိုင်းမသန် ချိနဲ့လာပါမည်။
      
ဝက်မကြီးများတွင် သားလျှောခြင်း၊ သားပျက်ခြင်း၊ အသေမွေးခြင်း၊အင်အားချိနဲ့သော ဝက်ကလေးများမွေးခြင်း၊ အသေအခြောက်ကလေးများ မွေးတတ်ပါသည်။
      
ဝက်မွေးသူတွေ သတိပြုသင့်တဲ့ ဝက်နားရွက်ပြာရောဂါကုသခြင်း
      
ဝက်နားရွက်ပြာရောဂါသည် ဗိုင်းရပ်စ်ပိုးကြောင့် ဖြစ်ပွားရခြင်းဖြစ်၍ ကုသရန်ဆေးမရှိပါ။
      
အခြားနောက်ဆက်တွဲရောဂါများ မဖြစ်ပွားအောင်သာ သန့်ရှင်းရေးပြုလုပ်ခြင်း၊ ပိုးသတ်ဆေးဖျန်းခြင်း၊ အာဟာရပြည့်ဝသည့် အစာနှင့် ရေကို ကျွေးမွေးတိုက်ကျွေးခြင်းဖြင့် ဆုံးရှုံးမှု လျော့ပါးစေနိုင်ပါသည်။
      
ရောဂါဖြစ်ပွားသည့်ဝက်နှင့် ၎င်းဝက်၏အညစ်အကြေးများ၊ အစာကြွင်းအစာကျန်များတွင် ရောဂါ ပိုးပါရှိနိုင်သဖြင့် ၄င်းပစ္စည်းများ၊အညစ်အကြေးများကို စနစ်တကျသုတ်သင်ရှင်းလင်းနိုင်ရန် လိုအပ်ပါသည်။

ကာကွယ်ခြင်း
      
ရောဂါဖြစ်ပွားသောဝက်ကို နေရာရွှေ့ပြောင်းခြင်းမပြုဘဲ အတူနေနေသော ကျန်းမာသည့် ဝက်များကိုသာ ရွှေ့ပြောင်းမွေးမြူရပါမည်။
      
ရောဂါဖြစ်ပွားသော ခြံနေရာနှင့် ပတ်လည်တွင် သန့်ရှင်းရေးပြုလုပ်ခြင်း၊ မွေးမြူရေးခြံသုံး ပိုးသတ် ဆေးဖျန်းခြင်းများပြုလုပ်ရပါမည်။
      
ရောဂါဖြစ်၍ သေဆုံးသောဝက်ကို ပိုးသတ်ဆေးဖျန်း၍ ၆ ပေအနက်ကျင်းတူး၍ မြှုပ်ရပါမည်။ ဖြစ်နိုင်ပါက မီးရှို့ဖျက်ဆီးခြင်းသည် အကောင်းဆုံးဖြစ်သည်။
      
တစ်ပိုင်တစ်နိုင်ဝက်မွေးမြူသူများသည် ခြံလှောင်မွေးမြူခြင်းထက် လွှတ်ကျောင်း၍မွေးတတ်ပြီး လွှတ်ကျောင်းမွေးမြူသူများတွင် အများဆုံးဖြစ်ပွားကြောင်း တွေ့ရပါသည်။
      
ဝက်စာကိုစနစ်တကျစပ်၍ ကျွေးသူများတွင် ဖြစ်ပွားမှုနည်းသည်။
      
စားသောက်ဆိုင်များမှာ အစာကျန်များကိုစု၍ကျွေးသူများတွင် ဖြစ်ပွားမှု ပိုမိုများပြားပါသည်။
      
ဖြစ်နိုင်ပါက အစာကျန်များကို ပွက်ပွက်ဆူအောင်ပြုတ်၍ အအေးခံပြီးမှကျွေးလျှင် ရောဂါဖြစ်ပွားမှု လျော့ကျစေနိုင်မည်ဖြစ်ပါသည်။

ကာကွယ်ဆေး
      
ဝက်နားရွက်ပြာရောဂါကာကွယ်ရေးနှင့် ပတ်သက်၍ ကာကွယ်ဆေးထိုး၍ ရပါသည်။
      
သို့သော် ကာကွယ်ဆေးသည် ဖော်စပ်ထားသည့် ဗိုင်းရပ်စ်မျိုးကွဲတစ်ခုတည်းကိုသာ ကာကွယ်ပေးနိုင်ပြီး အခြားပိုးမျိုးကွဲဝင်ရောက်လာပါက ကာကွယ်မှု မပေးနိုင်ပါ။
      
ပိုးအရှင်သုံးကာကွယ်ဆေးထိုးထားသည့် ဝက်များသည် ဗိုင်းရပ်စ်ပိုးအရှင်များ ပြန်လည်စွန့်ထုတ်တတ်ကြသည်။
      
သို့ဖြစ်၍ ကာကွယ်ဆေးအသုံးပြုမှုကို အပြည်ပြည်ဆိုင်ရာ ကျွမ်းကျင်သူများနှင့် ညှိနှိုင်းဆောင်ရွက်ဆဲဖြစ်ပါသည်။
''',
      Color(0xFFCDDC39),
      'assets/dodont/gt26.png',
    ),
    Item(
      '၀က်ဆားအဆိပ်သင့်ရရောဂါ',
      '''ဆားအဆိပ်သင့်ခြင်းကြောင့်တွေ့ရသည့်လက္ခဏာများ
      
အစောပိုင်းအဆင့်တွင် အစာစားပျက်ခြင်း
      
ဝက်အုပ်လိုက် အစာလုံးဝမစားခြင်း
      
Nipple ပိုက်ဖြင့်ရေတိုက်သော ခြံတွင် nipple ခေါင်းကို မကြာမကြာကိုက်ခြင်း
      
လမ်းသွားလျှင် ဒယီးဒယိုင်ဖြစ်ခြင်း
      
အာရုံကြောလက္ခဏာများဖြစ်သည့် အသားတဆတ်ဆတ်တုန်ခြင်း
      
မျက်မမြင်ကဲ့သို့ ဟိုဟိုဒီဒီ လျှောက်နေခြင်း
      
အလွန်သိသာသည့် လက္ခဏာမှာ ခွေးကဲ့သို့ ဖင်ထိုင်ခြင်း
      
ဦးနှောက်အမြှေးရောင်ခြင်း ( menigitis ) သွက်ချာပါဒဖြစ်ခြင်း လဲနေခြင်း၊ လျှာကိုကိုက်ဝါးခြင်း
      
သွားရည်ကျခြင်း
      
နားရွက်ထိပ်နီခြင်း၊ ဝမ်းဗိုက်နီခြင်း (ထိုအခါ နားရွက်ပြာ၊ အာဖရိကန်ဝက်အပြင်းဖျားရောဂါတို့နှင့် ဆင်တူနေတတ်သည်)
      
ရံဖန်ရံခါ သေနှုန်းမြင့်မားတတ်ပါသည်။

ကာကွယ်ကုသခြင်း
    
ဤရောဂါအတွက် ဆေးကုသခြင်းသည် သိပ်မထိရောက်လှ၊ ကြိုတင်ကာကွယ်ခြင်းသည်သာ ထိရောက်သည်။

ရောဂါဖြစ်ပွားမှုကိုတွေ့ရှိပါက
      
ပါးစပ်မှ ဓာတ်ဆားရေတိုက်ပါ။ ပိုက်ပျော့ဖြင့်လည်း ပါးစပ်မှ တိုက်နိုင်သည်။ ပြင်းထန်ပါက အစက်ချတိုက်ပါ။
      
ချိုငန် အကြောဆေးအရည်( 5 % ) အကြောဆေးပေးနိုင်သည်။
      
Corticosteroid ထိုးဆေးပေးခြင်းကလည်း အကူအညီ ဖြစ်စေပါသည်။
      
သောက်ရေစံနစ်တစ်လျှောက်လုံး စစ်ဆေးပါ။
      
ပိုက်များပိတ်ဆို့နေပါက အမြန်ပြုပြင်ပါ။
      
သောက်ရေပေးစံနစ်ကို ပုံမှန် နေ့စဉ်စစ်ဆေးသင့်သည်။
      
ခရီးရှည်သွားလျှင် အနားပေး၍ ရေတိုက်ပါ။

''',
      Color(0xFFB2FF59),
      'assets/dodont/gt28.png',
    ),
    Item(
      'ဝက် ဘက်တီးရီးယားရောဂါ',
      '''ဝက်များ ဘက်တီးရီးယားရောဂါ မကျအောင် ကာကွယ်နည်းများ
 
ဝက်များရောဂါဖြစ်ပွားစေသည့် အဓိကအကြောင်းအရင်းများမှာ 
      
ရောဂါပိုးမွှား အမျိုးမျိုးဝင်ရောက်ခြင်း၊
      
ကိုယ်တွင်းဖြစ်စဥ်များ ချို့ယွင်းခြင်း(သို့)ပြောင်းလဲသွားခြင်း၊
      
ပြင်ပမှထိခိုက်ဒဏ်ရာ ရရှိခြင်း၊
      
အာဟာရချို့တဲ့ခြင်း၊
      
ပတ်ဝန်းကျင်မှ သဘာဝဖိစီးမှုဒဏ်များ ရရှိခြင်း၊
      
အဆိပ်ဖြစ်စေသော အစာများ စားသုံးမိခြင်း၊
      
မွေးရာပါချို့ယွင်းချက်ရောဂါများ ပါရှိလာခြင်း၊
      
မသန့်ရှင်းသောလေကို ရှူရှိုက်မိခြင်း၊
      
ကာကွယ်ဆေးထိုးနှံမှု မရှိခြင်း စသည့်အချက်များကြောင့် ဖြစ်သည်။

ရောဂါလက္ခဏာများ
      
ရုတ်တရက်ရောဂါဝင်ရောက်လာပါက 
      
အပူချိန်မြင့်တက်ခြင်း
      
အသက်ရှူမြန်ခြင်း
      
နားရွက်များအေးစက်ခြင်း
      
အရောင်ဖျော့လာခြင်း
      
အဆုတ်အအေးမိခြင်း
    
စသည်တို့ကို တွေ့ရပြီး သေဆုံးသည်အထိ ဖြစ်ပွားနိုင်ပါသည်။ထို့ပြင် ချောင်းဆိုးခြင်း၊ ပိန်ချုံးခြင်း၊ နှလုံးဖုံးအမြှေးပါးရောင်ခြင်းတို့ကိုလည်း တွေ့ရနိုင်ပါသည်။

ဝက်များရောဂါမဖြစ်စေရန် လိုက်နာသင့်သည့်အချက်များ
      
အဆောက်အဦကို နေရောင်ခြည်ကောင်းစွာရရှိအောင် စီမံခြင်း၊
      
လေဝင်လေထွက် ကောင်းမွန်၍ ခြောက်သွေ့သန့်ရှင်းသော အခင်းများဖြစ်ခြင်း၊
      
ရာသီဥတုအေးလွန်းသည့်အချိန်တွင် အနွေးဓာတ်ရရှိအောင် ဆောင်ရွက်ပေးခြင်း၊
      
ကြမ်းခင်းများ ခြေချော်မှုမရှိစေရန် စီမံပေးခြင်း၊
      
အာဟာရဓာတ်ပြည့်ဝသောအစာကို လုံလောက်စွာ ကျွေးပေးခြင်း၊
      
ခြံသန့်ရှင်းရေးနှင့် ပိုးသတ်ဆေးပက်ဖျန်းခြင်းတို့ကို စနစ်တကျ ဆောင်ရွက်ပေးခြင်း၊
      
ကာကွယ်ဆေးများကို စနစ်တကျထိုးနှံပေးခြင်း၊
      
ပဋိဇီဝဆေးများကို တိရစ္ဆာန်ဆေးကုဆရာဝန်များ၏ ညွှန်ကြားချက်အတိုင်း တိုက်ကျွေးခြင်းတို့ဖြစ်ပါသည်။

ဝက်ခြံအတွင်းကူးစက်ရောဂါများ ဝင်ရောက်လာပါက ဆောင်ရွက်ရန်နည်းလမ်းများ
      
ရောဂါပိုးများကူးစက်ရာတွင် ၁ ကောင်မှ ၂ ကောင်သို့၊ တစ်ခြံမှ တစ်ခြံသို့ လေမှလည်းကောင်း၊ ရေမှလည်းကောင်း၊ ခြံသို့လာရောက်သောလူမှ လည်းကောင်း အကြောင်းအမျိုးမျိုးဖြင့် ကူးစက်နိုင်ပါသည်။
      
ဝက်ခြံတစ်ခြံတွင် ရောဂါဖြစ်နေသောဝက်နှင့် အခြားဝက်များကို သီးသန့်ခွဲထားရပါမည်။
      
သေဆုံးသောဝက်ကို မီးရှို့ပစ်ခြင်း (သို့) တွင်းနက်နက်တူး၍ မြေမြှုပ်ခြင်းများကို ဆောင်ရွက်ရပါမည်။ ရေတွင်မျှောခြင်း၊ အခြားတစ်နေရာသို့ သွားရောက်စွန့်ပစ်ခြင်း မပြုလုပ်ရပါ။
      
ရောဂါဖြစ်သောဝက်ကို တစ်နေရာမှ တစ်နေရာသို့ သယ်ဆောင်သွားခြင်း၊ ရောင်းချခြင်း မပြုရပါ။
      
ရောဂါဖြင့် သေဆုံးသောခြံကို ပိုးသတ်ဆေးများပက်ဖျန်း၍ သန့်ရှင်းရေးပြုလုပ်ပြီး အနည်းဆုံး ၂ ပတ်ကြာမှသာ ဝက်အသစ်ထပ်မံထည့်ရပါမည်။
      
ဝက်ခြံအတွင်းသို့ ဝက်အသစ်များ မထည့်မီ ၁ ပတ်ခန့် သီးခြားခွဲထားပြီး ရောဂါမရှိကြောင်း သေချာမှသာလျှင် ဝက်ခြံထဲသို့ ထည့်ပါ။
      
ကူးစက်ရောဂါဟု သံသယရှိပါက မွေးမြူရေးနှင့် ကုသရေးဦးစီးဌာနသို့ သတင်းပို့ရမည်ဖြစ်ပါသည်။
     
''',
      Color(0xFF66BB6A),
      'assets/dodont/gt27.png',
    )
  ];
}