import 'dart:ui';

class Item {

  String title;
  String description;
  Color color;
  String imageUrl;


  Item(this.title, this.description, this.color, this.imageUrl);

}

List<Item> getGridItems(){
  return <Item>[
    Item(
      'ငါး ကပ်ပါးရောဂါ',
      '''ရောဂါလက္ခဏာများ

     - ငါး၏ ခန္ဓာကိုယ်ပေါ်တွင် ဝါဂွမ်းပုံ အဆုပ်လိုက် ဖြစ်လာသည်။

     - အရောင်အားဖြင့် အဖြူရောင်မှိုအစုမှ တဖြည်းဖြည်းအညိုရောင် ပြောင်းလာမည်။

     - အရောင်ပေါ်မူတည်၍ ဖြစ်ပေါ်နေသော မှိုအစုအဝေးအား သိရှိနိုင်ပါသည်။

ရောဂါဖြစ်ပွားတတ်သည့် ငါးအမျိုးအစားများ

     - ငါးကြင်း၊ ငါးသိုင်းအုပ်စု၊ ရွှေငါးနှင့် ရေချိုငါးအမြောက်အများတွင် ဖြစ်ပွားတတ်ပါသည်။

ရောဂါဖြစ်ပွားနိုင်သည့်အချိန်ကာလ

      - မိုးတွင်းကာလနှင့် ဆောင်းအကူးကာလများတွင် ဖြစ်ပွားတတ်ပါသည်။

ကာကွယ်ခြင်းနှင့် ထိန်းချုပ်ခြင်း

     - ငါးအစာများကို (၆)လထက်ကြာအောင် မထားရ။

     - ငါးစာများကို လေဝင်လေထွက်ကောင်းသော နေရာများတွင် ထားရပါမည်။

    - ရောဂါကျရောက်သော ငါးများအား Sodium Chloride 20g/1 for (30min) ခန့် စိမ်ပေးရပါမည်။

     - Formalin 0.4 – 0.5 ml / 1 for 1 hour ခန့် စိမ်ပေးထားခြင်းဖြင့် ရောဂါကာကွယ်နိုင်ပါသည်။''',
      Color(0xFFEAB9E7),

      'assets/dodont/f011.png',
    ),
    Item(
      'အောက်စီဂျင် ရရှိရန်',
      '''နံနက်ပိုင်းမိုးအုံ့သောရက်၊နှင်းကျသောရက်များနှင့် နေထွက်နောက်ကျသောရက်များတွင် ငါးများခေါင်းထောင်လျှက် ကူးခတ်ခြင်း၊ ကမ်းစပ်သို့စုပြုံလာခြင်းမျိုးရှိပါက ငါးမွေးမြူးကန်သည် အောက်ဆီဂျင်လျော့နည်းမှုဖြစ်ပွားနေသဖြင့် ကန်အတွင်းသို့ရေသစ်သွင်းခြင်း၊ ရေပန်းချခြင်း၊ရေဒလက်များမောင်းပေးခြင်း၊ မွေးမြူကန်အတွင်း လှေလှော် ပေးခြင်း စသည့်နည်းလမ်းများ ရေတွင်ပျော်ဝင်အောက်ဆီဂျင်မြင့်တက်စေရေး ဆောင်ရွက်ပေးရန်။
''',
      Color(0xFFA3A3C9),

      'assets/dodont/f02.png',
    ),
    Item(
      'အစာမှန်ကန်စွာကျွေးနည်း',
      '''နေအပူချိန်မြင့်မားလွန်ကဲမှုကြောင့် ငါးမွေးမြူရေးကန်များရှိ ကန်ရေများ ရေငွေ့ပျံပြီးရေလျော့နည်းကျဆင်းလာသဖြင့် ကန်ထဲရှိငါးများ၏   စွန့်ပစ်အညစ်အကြေးကြောင့်သော်လည်းကောင်း၊ မွေးမြူထားသောငါးများကို အစာကျွေးလွန်ကဲသဖြင့် စားကြွင်းစားကျန်များကြောင့်သော် လည်းကောင်း၊ရေထုညစ်ညမ်းပြီး ဆက်စပ်၍ ငါးရောဂါကျရောက်တတ်သဖြင့် သြဇာဓါတ် ထည့်သွင်းခြင်းနှင့် ငါးအစာအလွန်အကျွံကျွေးခြင်းကို လျော့ချရန်။
''',
      Color(0xFFA9DEEA),
      'assets/dodont/f01.png',
    ),
    Item(
      'အောက်စီဂျင်နည်းခြင်း',
       '''ငါးကန်အောက်စီဂျင်လျော့နည်းခြင်း ဖြေရှင်းနည်းမျာ
       ကန်အတွင်းလှိုင်းများထစေရန် ရေပြင်ကိုဝါးလုံးဖြင့်ရိုက်ပေးပါ။ဘောလုံးဖြင့်ပစ်ပါ။
       
ငါးကန်ဧရိယာ ၀.၀၁ ဧက လျှင် အောက်စီဖလို/အောက်စီလိုက်ဖ် (၅-၇)ဂရမ် ထည့်ပေးပါ။

ဖြစ်နိုင်လျှင် ပြင်ပမှသန့်ရှင်းပြီး အောက်စီဂျင်ပါ ပြည့်ဝသည့်ရေကို သွင်းပေးပါ။

အစာနှင့်မြေဩဇာထည့်ခြင်းကို ရက်အနည်းငယ်ကြာ ရပ်ဆိုင်းထားပါ။
''',
      Color(0xFFD593AA),

      'assets/dodont/f04.png',
    ),
    Item(
      'အနီရောင်အလွှာပေါ်ခြင်း',
 '''ငါးကန်ရေမျက်နှာပြင်ပေါ်တွင် အနီရောင်အလွှာပေါ်ခြင်း ဖြေရှင်းနည်းများ
 
 ကောက်ရိုး(သို့)ငှက်ပျောရွက်တို့ဖြင့် ပြုလုပ်ထားသည့်ကြိုးဖြင့် ကန်ရေပြင်တွင် အနီရောင် အလွှာကို ဖယ်ရှားနိုင်ပါသည်။
 
 ၀.၀၁ ဧက ကန်အတွက် ပုလဲဓာတ်မြေဩဇာကို ၁၀၀-၁၅၀ ဂရမ် (၆ကျပ်သားမှ ၁၀ ကျပ်သား ခန့်) ကို ၁၀ရက်ခြား(သို့)၁၂ရက်ခြားခန့်  ၂ကြိမ် (သို့) ၃ကြိမ်ခန့်ထည့်ပေးပါ။ (သို့မဟုတ်)
 ၀.၀၁ ဧက ကန်အတွက် ကျောက်ချဉ်(၁၀၀)ဂရမ် (၆ကျပ်သား)ထည့်ပေးပါ။
''',
      Color(0xDDEC807D),

      'assets/dodont/f08.png',
    ),
    Item(
      'အစိမ်းရောင်အလွှာပေါ်ခြင်း',
      '''ငါးကန်တွင် အစိမ်းရောင်ရေညှိ ရေမှော်များ ထူထပ်ပွားများလာပြီး အစိမ်းရောင်အလွှာ ဖြစ်ပေါ်လာခြင်း ဖြေရှင်းနည်း
      
၀.၀၁ ဧက ကန်လျှင် ဂျစ်ပ်ဆမ် ၆၃ ကျပ်သားခန့်(သို့)

ဒုတ္ထာ(ကော့ပါးဆာလ်ဖိတ်)၁၀-၁၂ ဂရမ်(၆ကျပ်သားခန့်-၈ကျပ်သားခန့်)သုံးစွဲပါ။ 

၎င်းဆေးကို အိတ်ငယ်တွင် ထည့်စည်းပြီး ရေထဲရှိ ဝါးလုံးတိုင်တွင် ကပ်ချည်၍ ရေထဲသို့ ၄လက်မ -၆ လက်မ ခန့် အောက်ချနှစ်ထားပေးပါ။
''',
      Color(0xFF73C985),

      'assets/dodont/f07.png',
    ),
    Item(
      'ရေနောက်ကျိခြင်း',
      '''ငါးကန်ရေနောက်ကျိခြင်း ဖြေရှင်းနည်းများ

၀.၀၁ဧက ကန်လျှင် ထုံး ၅၀၀ ဂရမ် (၃၁ ကျပ်သားခန့်)ထည့်ပေးပါ။

၀.၀၁ဧကကန်လျှင် ဂျစ်ပ်ဆမ် ၁-၁.၅ ကီလိုဂရမ် (၆၂ကျပ်သား-၉၅ကျပ်သားခန့်)သို့ ၀.၀၁ ဧကလျှင် ကောက်ရိုးခြောက် ၁-၁.၅ ဂရမ် (၆၂ကျပ်သား-၉၅ကျပ်သားခန့်)ကို သတ်မှတ်ထားတဲ့ နည်းစနစ်အတိုင်း(ကောက်ရိုးခြောက်များကို ၁၀ ကျပ်သားခန့် အထုံးများပြုလုပ်ပြီး၊ ကန်ရေ နေရာအနှံ့ပစ်ချပေးပါ။ ၃ ရက်ကြာပြီးနောက် ၎င်းကောက်ရိုးများကို ပြန်လည်ဆယ်ယူပါ။ (သို့မဟုတ်)

၀.၀၁ ဧကလျှင် ကျောက်ချဉ် ၂၅၀ ဂရမ် (၁၅ကျပ်သားခန့်)အသုံးပြုပါ။''',
      Color(0xFF7A743F),

      'assets/dodont/f012.png',
    ),
    Item(
      'ငါးရောဂါစီမံခန့်ခွဲမှု',
      '''ငါးအနာအဆာရောဂါဖြေရှင်းနည်းများ

၀.၀၁ ဧကကန်အတွက် အိမ်သုံးဆေး ၂၅၀ ဂရမ် (၁၅ကျပ်သားခန့်) (သို့) ထုံး ၃၀ ကျပ်သားခန့် ထည့်သွင်းနိုင်ပါတယ်။ ၎င်းအချိန်အဆသုံးပြီးနောက် နောက်ထပ်သုံးပါက အထက်ပါနှုန်းထားရဲ့ ထက်ဝက်ကို ဆောင်းရာသီနောက်ပိုင်း တစ်လခြား သုံးစွဲနိုင်ပါတယ်။

ငါးကို ရေ ၁၀ လီတာတွင် ပိုတက်ဆီယမ်ပါမင်ဂနိတ် ၅ ဂရမ် (၀.၃ကျပ်သားခန့်) ထည့်ဖျော်ထား တဲ့ ဖျော်ရည်တွင် ငါးကို ၁၀ စက္ကန့်ခန့် နှစ်ထားနိုင်ပါတယ်။

၁ မီတာ(သို့) ၃ ပေအနက်ရှိတဲ့ ၀.၀၁ ဧက ကန်အတွက် ၂.၆၅ ဂရမ် (၁၆ ကျပ်သားခန့်) ပမာဏ ရှိ ဘက်တီးရီးယား ပိုးသတ်ဆေးကို အသုံးပြုနိုင်ပါတယ်။''',
      Color(0xFFCF99D3),

      'assets/dodont/f03.png',
    ),
    Item(
      'အပူချိန်လွန်ကဲမှု',
      '''ငါးမွေးမြူရေးကန်များ အပူချိန်ပြင်းထန်လွန်ကဲမှုဒဏ်မှ ကြိုတင်ကာကွယ်ရန်နည်းလမ်းများ
      
ငါးမွေးမြူရေးကန်များ နေအပူချိန်လွန်ကဲမှုကြောင့် ရေခမ်းလာပါက သန့်ရှင်းသောရေသစ် များဖြည့်သွင်းပေးရန်။

ရေသစ်သွင်းရန်အခက်အခဲရှိပါက မွေးမြူထားသောငါးများကိုအရေအတွက် လျော့ချမွေးမြူ ရန်။

အပူချိန်ပြင်းပြသည့်အချိန်များဖြစ်သည့်နေ့လည်ပိုင်းတွင်ငါးများကန်ပြောင်းရွေ့ခြင်းမပြုရန်။

ကန်ရေအပူချိန်မြင့်မားသော အချိန်များတွင် ရေထုညစ်ညမ်းမှုဖြစ်စေသည့် ကဇော်ဖတ်၊ဝါးဇော်ဖတ်များ ကျွေးခြင်းကို ရှောင်ကြဉ်၍ ပုံမှန်အစာများကိုသာချိန်ဆကျွေးရန်။

အစာကျွေးပြီးပါက အစာကျန်များရှိ/မရှိကိုပုံမှန်စစ်ဆေးရန်။

မွေးမြူရေးကန်အားလိုအပ်ပါက ရေသစ်လဲလှယ်နိုင်ရေးအတွက် ရေကောင်းရေသန့်သိုလှောင်သည့် အရန်ကန်စီစဉ်ထားရှိပြီး ရေများရနိုင်သမျှသိုလှောင်ထားရန်။

ကန်အခြေအနေနှင့်ရေအရည်အသွေးပြောင်းလဲမှုအခြေအနေများကို နေ့စဉ်နံနက်(၆)နာရီ၌ ပုံမှန်စစ်ဆေးရန်။

ငါးမွေးကန်၌ ပုံမှန်မဟုတ်သောအခြေအနေပြောင်းလဲခြင်းမျိုးများ ဖြစ်ပေါ်လာသည်ကိုတွေ့ရှိရပါက အနီးဆုံးငါးလုပ်ငန်းဦးစီးဌာနသို့ ဆက်သွယ်ဆောင်ရွက်ရန်။
''',
      Color(0xFFFFB570),

      'assets/dodont/f06.png',
    ),
    Item(
      'ရေကြီးနစ်မြုပ်မှု',
      '''ငါးမွေးမြူရေးကန်များ ရေကြီးနစ်မြုပ်မှုမှ ကြိုတင်ကာကွယ်ရေးရန် နည်းလမ်းများ
      
      ငါးမွေးမြူရေးကန်များ၏ ကန်ပေါင်များခိုင်ခံ့ရန်အတွက် ကန်ပေါင်ပါးသော၊ နိမ့်သောနေရာများတွင် သဲအိတ်များဖို့၍ ကန်ပေါင်ခိုင်ခံ့အောင်ပြုလုပ်ထားပါရန်။

အကယ်၍ရေကြီးရေလျှံလာပါက ငါးများလွတ်ထွက်မှု မရှိစေရေးအတွက် ဇာပြာပိုက်များဖြင့် ကာရံထားပါရန်။

ရေစီးကြောင်းနှင့်နီးသော ငါးကန်များတွင် ရေတိုက်စားမှု ကာကွယ်ရန်အတွက် တုတ်ရိုက်ပြီး ဝါးထရံများဖြင့် ကာရံ၍ သဲအိတ်များဖို့ထားပါရန်။

ငါးများရွှေ့ပြောင်းနိုင်ရန်အတွက် ငါးဖမ်းပိုက်များ၊ စက်လှေများနှင့် စက်ပစ္စည်းများအား ကြိုတင်ပြင်ဆင်ထားပါရန်နှင့် အထူးသဖြင့် မျိုးငါးကြီးများအား ဦးစားပေးရွှေ့ပြောင်းထားပါရန်၊၊

မွေးမြူရေးကန်၏ ရေထွက်/ရေလျှံပေါက်များ၊ ရေကျော်မည့် နေရာများအား အစဉ်ဂရုတစိုက် စစ်ဆေးနေပါရန်၊၊

ထူးခြားသည့်အခြေအနေများ အချိန်နှင့်တစ်ပြေးညီ သိရှိနိုင်ရန်အတွက် ဆက်သွယ်သတင်းပို့နိုင်မည့် နည်းလမ်းများ ကြိုတင်ပြင်ဆင်ထားပါရန်၊၊

''',
      Color(0xFFC4A98E),

      'assets/dodont/f05.gif',
    ),
    Item(
      'သတိပြုရန်',
     '''ပြည်တွင်းထုတ်နေ့စဉ် သတင်းစာများတွင်ပါရှိသည့် မိုးလေဝသနှင့်ပတ်သက်သည့် သတင်း၊ ဆောင်းပါးများအား အမြဲမပြတ် ဖတ်ရှုသတိပြုပြီး ငါးမွေးမြူသူအချင်းချင်း သတင်းအချက်အလက်ဖလှယ်ကြပါရန်၊၊
''',
      Color(0xFF7EF6B0),
      'assets/dodont/f09.png',
    ),
    Item(
      'သတိပြုရန်',
      '''နိုင်ငံပိုင်ရေဒီယို၊ အသံလွှင့်ဌာနများမှ ထုတ်လွှင့်လျက်ရှိသော အရေးပေါ်မိုးလေဝသ သတိပေးချက်များနှင့် ပတ်သက်သည့် သတင်းများကို အမြဲဂရုတစိုက် နားထောင်ပါရန် ၊၊
''',
      Color(0xFFD593AA),
      'assets/dodont/f010.png',
    ),
  ];
}